{
  "filename": "Lab 3-Kali Linux.pdf",
  "text": "Kali Linux Lab: Penetration Test\nSpring 2025\nChengyi Qu\nSubmission Due: March 11th \nBackground\n• Kali Linux is an open-source, Debian-based Linux distribution geared \ntowards various information security tasks, such as Penetration \nTesting, Security Research, Computer Forensics and Reverse \nEngineering.\n• In this lab, we will working on several apps inside Kali Linux and \nprocess a series of penetration test.\nBasic Setup\n• Download the virtual box version Kali Linux: https://www.kali.org/get-\nkali/#kali-virtual-machines \n• You can check the doc here: \nhttps://www.kali.org/docs/virtualization/import-premade-virtualbox/ \nClone the Kali Linux machine on Virtual Box\n• Power off the machine. Select the VM, on the top menu, select \nMachine -> Clone, select Generate new MAC for network adapters \nand Full clone. Click finish to clone.\nGenerate new Nat Networks and make two \nmachine talk to each other\n• Power off all machines, Go to tools -> little list icon -> network, click Nat \nNetwork tab -> click ‘Create’ on top.\n• Under General options -> Name your Nat Network as ‘TestNetwork’ (can be \nothers) -> Type Ipv4 prefix into 192.168.100.0/24 -> Enable ‘DHCP’, click Apply.\n• On each Kali Linux, select Settings -> Network -> \nNat Network with the name of ‘TestNetwork’\nTask 1:Show IP assigned and communications \n(10 points)\n• Login on each Kali Machine (user: kali, password: kali), open terminal \nand check the ip address and show successful communication.\n• Thinking about how to check IP address? How to test a successful \ncommunication?\n• What to include in your report on this question?\n• Screenshots on terminal shows the IP address on each Kali machine;\n• Show communication between each other with some command\n• Your name typed in the terminal to avoid cheat ☺\nIntroduction to Kali Linux\n• The successor to Backtrack, a popular penetration testing distribution that was first \nreleased in 2006.\n• https://www.kali.org/\n• It has a HUGE number of tools. A few are listed here:\n• BBQSQL \n• Jsql\n• Reaver\n• Nmap\n• dnsenum\n• dnsrecon\n• sigguesser\n• cisco-orc\nTask 2: learn Dmitry\nDmitry is Deepmagic Information Gathering Tool. It is essentially a \nsearch and scanning tool. \n8\nAnalysis using Dmitry (20 points)\nLet’s use Dmitry on my own website again and type the following:\ndmitry –i –s –e chengyiqu.com\n-i is a whois lookup.\n-s is a search for subdomains.\n-e is a search for email addresses.\n• What you need to submit:\n• Show screenshot of the Dmitry on the above command and explain the output.\n• Which name server my website is using? Which port I’m opening for access?\n• Any other information you find from this website scanning?\n9\nTask 3: Learn Recon-ng\nType Recon-NG at the shell, or select from menu.\n10\nRecon-ng test (30 points)\n• Use this tutorial: https://medium.com/@bibinrajbs/using-recon-ng-\nin-kali-2020-cc76aa3a4a6d to generate a Car report\n• What you need to submit:\n• Change two different car titles instead of Tesla and BMW (make sure you type \nthe current domain name);\n• Save in your own file location, name it as report.html;\n• A HTML report screenshot, include the address URL.\n• Note that you need to build the report.html first in order to let Recon-ng find \nthe location\nTask 4: Lean the basic of Metasploit\n• Following this tutorial to hack inside the Metasploitable VM:\nhttps://medium.com/@nickhandy/kali-linux-metasploit-getting-\nstarted-with-pen-testing-89d28944097b \nHints: \n• To build a new Metasploitable VM in Vmbox, check this link: \nhttps://smallbusiness.chron.com/open-wfc-file-18909.html \n• You will need to test the connection between Kali linux to \nMetasploitable VM before hacking\n• Use right ctrl to release from Mataspoitable VM.\nTask 4: Lean the basic of Metasploit \n(40 points)\n• What you need to submit:\n• Screenshots on successfully hacking inside the Metasploitable VM.\n• Create a file with ‘your name.txt’ with any content inside the file from Kali \nLinux, and check back on the Metasploitable to see if the file exists.\n• Take screenshots on the file name with your name and content using ‘cat’ \ncommand on Metasploitable.\n• (15 points) Run at least one more tool in Metasploit and explain the results, \ne.g.,\n• scanner/smb/smb_version\n• auxiliary/scanner/mssql/mssql_ping\n• scanner/ssh/ssh_version\n• auxiliary/scanner/ftp/anonymous\n• or others…\nAdditional tasks\n• There are a lot of tools pre-installed in Kali. Try to explore some other \ntools listed in the following slides and get extra points by including \nyour findings.\n• You may gain at most 20 extra points on this exploration. \n• You need to provide a detailed report on at least 2 (10 points each) of \nthe tools from the following list and show screenshots on successfully \nuse these tools to explore. \nSparta\nSparta is a tool that gives you access to \nmany vulnerability scanners in one, \nincluding \n►Mysql-default\n►Nikto\n►Snmp-enum\n►Smtp-enum-vrfy\n►Snmp-default\n►Snmp-check\nSparta is also an easy-to-use GUI tool \nrather than a command line.\nJohn the Ripper\nJohn the Ripper is a well-known password cracking tool. Kali Linux has \na shell version of John the Ripper and a GUI version named Johnny.\nGhost Phisher\nThis is a very versatile tool, with several interesting functions. \nEach tab has settings to turn your Kali Linux machine into\n►A fake wireless access point\n►A fake DNS server\n►A fake DHCP server\n►A fake HTTP server\nAnd more. There are tabs for \nsession hijacking and \nharvesting credentials.\nMacchanger\nThis tool changes the MAC address your Kali machine sends out, \nwhich makes it more difficult to trace the attack back to the Kali \nmachine. Also, MAC spoofing can be a way to circumvent some forms \nof authentication.\nWifi Honey\n• Create your own fake AP with wifi-honey \n• Generic example:\nwifi-honey <essid> <channel> \n<interface>\n• Specific example:\nwifi-honey FreeWiFi 6 eth0\nmsfvenom\nMsfvenom essentially combines msfpayload and msfencode so that you \ncan encode payloads and then send them to the target. It is a powerful \ntool, and a part of Metasploit you should be familiar with. It is used from \nthe shell in Kali, not from inside Metasploit. You start by trying msfvenom \n–h. \n20\nConclusion\n• You need to provide both the screenshots and explanation to get full \npoints.\n• Please make sure to include your own information to avoid any cheat \ncheck, either on the screenshots or on the explanation.\n• Submit one single PDF file. \nSubmission Due: March 11th \n"
}