{
  "filename": "Lab 1-SEED-Lab-Sniffing-Spoofing.pdf",
  "text": "SEED Lab: Packet Sniffing and \nSpoofing Walkthrough\nSpring 2025\nChengyi Qu\nBackground\n• Packet sniffing and spoofing are two important concepts in network \nsecurity; they are two major threats in network communication. Being able \nto understand these two threats is essential for understanding security \nmeasures in networking. \n• There are many packet sniffing and spoofing tools, such as Wireshark, \nTcpdump, Netwox, Scapy, etc. Some of these tools are widely used by \nsecurity experts, as well as by attackers. \n• Being able to use these tools is important for students, but what is more \nimportant for students in a network security course is to understand how \nthese tools work, i.e., how packet sniffing and spoofing are implemented.\nLab Environment Setup\n➢Virtual Machine download (!!Use Ubuntu 20.04 VM, NOT cloud version):\nhttps://seedsecuritylabs.org/labsetup.html\n➢Virtual Machine setup manual:\nhttps://github.com/seed-labs/seed-labs/blob/master/manuals/vm/seedvm-\nmanual.md\n➢Network Security Lab:\nhttps://seedsecuritylabs.org/Labs_20.04/Files/Sniffing_Spoofing/Sniffing_Spoofing.\npdf\nLab objective\n• Learn to use the tools and understanding the technologies underlying \nthese tools. \n• In the second objective, students will write simple sniffer and spoofing \nprograms, and gain an in-depth understanding of the technical aspects of \nthese programs. This lab covers the following topics:\n•Docker Containers\n•Scapy & Python\n•Sniffing\n•Spoofing\nSetup the Docker Container\n• Docker container can run whole application or a service.\n• It helps in eliminating the usage of virtual machine images\n• Download the “Labsetup.zip” from the manual \n(https://seedsecuritylabs.org/Labs_20.04/Networking/Sniffing_S\npoofing/)\n• Enter the Labsetup folder and use the docker-compose.yml file to set \nup the lab environment.\n• Some of the basic docker commands\n• docker-compose up -d (to start the container)\n• dockps (to find out container ID)\n• docksh <id> (to log into the container) \nhttps://github.com/seed-labs/seed-labs/blob/master/manuals/docker/SEEDManual-Container.md\nTasks\n• There are two sets of tasks in this lab. We will do the first set.\n• The first set focuses on using tools to conduct packet sniffing and \nspoofing. It only requires a little bit of Python programming (usually a few \nlines of code); students do not need to have a prior Python programming \nbackground. The set of tasks can be used by students with a much \nbroader background.\n• Follow step-by-step instructions in the below link (up to Section 3.4)\nhttps://seedsecuritylabs.org/Labs_20.04/Files/Sniffing_Spoofing/Sniffing_Spoofing.pdf\nHow to get ready for the task?\n• 1. Start up the docker container, and leave the CLI background.\n• 2. Have three CLI windows, login to the three hosts (two hosts \nnode and one hacker node)\n• 3. Use the Hacker node to process the Tasks.\n• 4. To generate traffic between two hosts, you may use ‘ping’. \nhttps://github.com/seed-labs/seed-labs/blob/master/manuals/docker/SEEDManual-Container.md\nTask Set 1: Using Tools to Sniff and Spoof \nPackets\n❑ How Packets Are Received \n✓NIC (Network Interface Card)  is a physical or logical link between a \nmachine and a network\n✓Each NIC has a MAC address\n✓NIC checks the destination address for every packet, if the address \nmatches the cards MAC address, it is further copied into a buffer in the \nkernel\nPython + Scapy\n•  Powerful modules (or programs) for packet manipulation\n•  Packet parsing\n•  Packet sending and receiving\n•  Packet sniffing\n•  Packet spoofing\n•  Adding new protocols\n•  Many more applications …\n$ view mycode.py\n#!/bin/bin/python3\nfrom scapy.all import *\na = IP() \na.show()\n$ sudo python3 mycode.py\n###[ IP ]### version = 4\n \nihl \n = None\n...\nSimple Scapy program\n• Here is sample code on how scapy works\nInteractive mode of Python\n$ sudo python3\n>>> from scapy.all import *\n>>> a = IP()\n>>> a.show()\n###[ IP ]###\nversion = 4\nihl = None\n...\n•\nWe can run the program one line at a time at the Python \nprompt.\nLab Tasks\nLab Task Set I\n• Task 1.1A Sniffing packets (30 points)\n• Task 1.1B Scapy’s filtering (10 Extra Points!)\n• Task 1.2 Spoofing ICMP packets (30 points)\n• Task 1.3 Traceroute (40 points)\n• Task 1.4 Sniffing and-then Spoofing (10 Extra Points!)\nNote: We will write our code in the ./volumes folder (on the VM), so they can be used \ninside the containers. \nTask 1.1A Sniffing Packets (30 Points)\n• Sniffing program in Scapy\n• You need to find your own iface value \nusing the below command\n• “ifconfig” [Refer 2.2]\n#!/usr/bin/python3 \nfrom scapy.all import *\ndef print_pkt(pkt): \npkt.show()\npkt = sniff(iface=’br-\nc93733e9f913’,filter=’icmp’,prn=print_pkt)\nTask 1.1A. The above program sniffs packets. For each captured packet, the \ncallback function print_pkt() will be invoked; this function will print out some of \nthe information about the packet. Run the program with the root privilege and \ndemonstrate that you can indeed capture packets. After that, run the program \nagain, but without using the root privilege; describe and explain your \nobservations.\nTask 1.1B Scapy’s filtering (Extra points!)\n• Understand the syntax and usage of BPF (Berkeley Packet Filter)\n• Capture only the ICMP packet (3 extra points)\n• Capture any TCP packet that comes from a particular IP and with a \ndestination port number 23. (3 extra points)\n• Capture packets comes from or to go to a particular subnet. You can pick \nany subnet, such as 128.230.0.0/16; you should not pick the subnet that \nyour VM is attached to. (4 extra points)\n• To obtain extra credits, for each subtask, please attach both the code \nyou modified, and the Scapy’s output details.\nPacket Spoofing\n• When some critical information in the packet is forged, we refer to it as \npacket spoofing. \n• Many network attacks rely on packet spoofing.\n• Let’s see how to send packets with spoofing.\nTask 1.2 Spoofing ICMP Packets (30 points)\n• How to spoof an ICMP packets\n• Make any necessary change to the sample code, and then demonstrate that you \ncan spoof an ICMP echo request packet with an arbitrary source IP address.\n• Use Wireshark to observe whether our request will be accepted by the receiver.\n• Submit code details, output from code and Wireshark screenshot to get full \npoints\n>>> from scapy.all import *\n>>> a = IP() \n>>> a.dst = ’10.0.2.3’ \n>>> b = ICMP() \n>>> p = a/b \n>>> send(p) \n. Sent 1 packets.\nTask 1.3 Traceroute (40 points)\n• Time-To-Live (TTL) \n• Uses Scapy to estimate the distance, in terms of \nnumber of routers, between your VM and a \nselected destination\n• Example python program: \n>>> a = IP()\n>>> a.dst = ’1.2.3.4’\n>>> a.ttl = 3 \n>>> b = ICMP() \n>>> send(a/b)\nTask: Write your tool to perform the entire procedure automatically \n(Send+ Receive)\nHINT\n•\nUse sr1() in Scapy to receive response from the destination i.e., to \ncheck if the IP packet has reached the destination or not\n•\nCheck for ICMP type in the response packet. If the packet reaches the \ndestination, type should be 0 \nhttps://networkdirection.net/articles/network-theory/icmptypes/\nSniffing and-then Spoofing\n• In many situations, we need to capture packets first, and then spoof a \nresponse based on the captured packets. \n• Procedure (using ICMP as example)\n• Use PCAP API to capture the packets of interests\n• Make a copy from the captured packet\n• Replace the data field with a new message and swap the source and \ndestination fields \n• Send out the spoofed reply\nTask 1.4: Sniffing and Then Spoofing \nUsing Scapy (Extra points!)\n✓In this task, you will combine the sniffing and spoofing techniques to implement the \nfollowing sniff-and then-spoof program. \n✓You need two machines on the same LAN: the VM and the user container. From the user \ncontainer, you ping an IP X. This will generate an ICMP echo request packet. If X is alive, \nthe ping program will receive an echo reply, and print out the response.\n✓Your sniff-and-then-spoof program runs on the VM, which monitors the LAN through \npacket sniffing. Whenever it sees an ICMP echo request, regardless of what the target IP \naddress is, your program should immediately send out an echo reply using the packet \nspoofing technique.\n✓You need to use Scapy to do this task. In your report, you need to provide evidence to \ndemonstrate that your technique works.\n✓Show original code and output for each IP you check (i) a non-existing host on the \nInternet (3 points), ii) a non-existing host on the LAN (3 points), and iii) an existing host \non the Internet (4 points).\nWhat you need to submit\n✓A detailed lab report that should\no Describe what you have done, what you have observed, and how you \ninterpret the results. \no Include evidences to support the observations. Evidences include \npacket traces, screenshots, etc. \no Reports should also list the important code snippets with explanations.  \nSimply attaching code without any explanation will not receive credits.\nReferences\n• https://seedsecuritylabs.org/labsetup.html\n• https://github.com/seed-labs/seed-labs/blob/master/manuals/vm/seedvm-\nmanual.md\n• https://github.com/seed-labs/seed-\nlabs/blob/master/manuals/docker/SEEDManual-Container.md\n• https://seedsecuritylabs.org/Labs_20.04/Files/Sniffing_Spoofing/Sniffing_S\npoofing.pdf\n"
}