{
  "filename": "Lab 4-OpenSSF-Scorecard.pdf",
  "text": "OpenSSF Lab: Learn Scorecard\nSpring 2025\nChengyi Qu\nSubmission Due: Mar 25th\nBackground\n• Scorecard is an automated tool that assesses a number of important \nheuristics (\"checks\") associated with software security and assigns each \ncheck a score of 0-10. You can use these scores to understand specific \nareas to improve in order to strengthen the security posture of your project. \nYou can also assess the risks that dependencies introduce, and make \ninformed decisions about accepting these risks, evaluating alternative \nsolutions, or working with the maintainers to make improvements.\nChaoss\nAbout CHAOSS\nCHAOSS is a Linux Foundation project focused on creating metrics, metrics models, and \nsoftware to better understand open source community health on a global scale.\nhttps://chaoss.community/kbtopic/all-metrics/ \nWho is using Scorecard?\n• Scorecard has been run on thousands of projects to monitor \nand track security metrics. Prominent projects that use \nScorecard include:\n• Tensorflow\n• Angular\n• Flutter\n• sos.dev\n• deps.dev\nLab Key Links\n➢Learn Scorecard from OpenSSF:\n \nhttps://openssf.org/training/securing-projects-with-openssf-scorecard-course/ \n➢OpenSSF Best Practice Badge:\n \nhttps://www.bestpractices.dev/en \n➢Github Pages/personal website:\nhttps://github.com/topics/personal-website\n \nhttps://pages.github.com/ \nLab objective\n• Learn to use Scorecard from the OpenSSF course, get \ncertificate of the course. \n• Include badges in one of your Git repo:\n• Badges on Scorecard scores\n• Badges on OpenSSF Best Practices\n• Analysis your code, modify your code and show improvement of \nyour scorecard scores.\nTasks\n• Learn\n• Learn from OpenSSF Scorecard course and get certification\n• Extra points: Other two course options of the OpenSSF courses\n• Earn\n• Earn Scorecard score badge in your current Github Repo\n• Earn OpenSSF Best Practice badge in your current Github Repo\n• Repeat!\n• Analysis your code, kill some security concerns and increase your Scorecard scores!\nTask 1: Learn: Pass the course (30 scores)\n❑ Pass the course and get certificate (with your name ☺)\n❑https://openssf.org/training/securing-projects-with-openssf-scorecard-course/ \n❑(Bonus Points – 20 Scores) https://openssf.org/training/securing-your-software-supply-\nchain-with-sigstore-course/ \nTask 2: Earn: TWO badges to earn (30 \npoints)\n❑Select one of your Github project.\n❑Design a Github welcome page of the project (Can be your personal website).\n❑Earn TWO badges of your repo: Scorecard and OpenSSF Best Practice\n❑Scorecard scores can be anything we will improve later.\n❑OpenSSF Best Practice MUST be PASS or Silver or Gold, pending is not accepted! \nTask 3: Repeat: Low score? No worries! \n(40 points)\n❑Try to address TWO of the \nHIGH issues after code \nscanning. (20 points each)\n❑Any improve of your score are \naccepted!\n❑Describe in the report on \n❑Which of the open issue has \nbeen addressed?\n❑How you address that issue?\n❑How much improve on your \nscores?\nWhat you need to submit\n✓Certification PDF(s) (if you pass Sigstore course attach separately.)\n✓A detailed lab report that should\no For Task 2: URL of the Github Project you choose, and screenshots of \nyour README.md with Badge showing in the front.\no For Task 3: Describe all your efforts on addressing issues highlighted by \nScorecard. And some screenshots showing you have a score increase!\no Simply attaching screenshots without any explanation will not receive \ncredits.\nSubmission Due: Mar 25th\n"
}