{
  "filename": "Lab5-OpenWRT.pdf",
  "text": "                                                                                                                         \n \n-1- \n \nSetting Router\nRepeat \nnetwork\nSSH to server\nTcpDump \ninstallation\nExtroot \nconfiguration\nFurther \npackage \nintroduction\nCEN 3078 Computer Security \nSpring 2025 \nLab # 5 –  OpenWrt \nChengyi Qu (cqu@fgcu.edu) \n \n1. \nPurpose of the Lab  \n \nIn this lab, you will understand the OpenWrt project and learn how to use an OpenWrt \nbased router. You will be able to use a storage device (USB or sata or SDcard or any other \nremovable storage drive) to expand your OpenWrt/LEDE (Linux Embedded Development \nEnvironment) device's space in the root filesystem, to install freely all the packages you need \nand to collect data. You will also be able to capture, filter and inspect packets using \ntcpdump and Wireshark tools on OpenWrt/LEDE router.  \n \n    2.  References to guide Lab work \n \n[1] OpenWrt project main page: https://OpenWrt.org/ \n[2] Quick Start for Adding a USB drive on OpenWrt: https://OpenWrt.org/docs/guide-\nuser/storage/usb-drives-quickstart \n[3] OpenWrt extroot configuration: https://OpenWrt.org/docs/guide-user/additional-\nsoftware/extroot_configuration \n[4] Tcpdump or Wireshark tools configuration and OpenWrt configuration: \nhttps://OpenWrt.org/docs/guide-user/firewall/misc/tcpdump_wireshark \n[5] Getting start with OpenWrt: https://www.ayomaonline.com/security/getting-started-\nwith-OpenWrt-linuxfying-routers/ \n[6] Tcpdump usage examples: \nhttps://www.rationallyparanoid.com/articles/tcpdump.html \n[7] Extroot configuration: https://openwrt.org/docs/guide-user/additional-\nsoftware/extroot_configuration  \n[8] DNS spoofing with Dnsmasq: https://www.linux.com/learn/intro-to-\nlinux/2017/7/dns-spoofing-dnsmasq  \n \n    3.  Lab Steps and output collection guidelines \n \n \n  \n \n \n \n \n \n \n \n \nFigure 1: Lab Steps Overview \n \nFigure 1 shows the required steps to be followed to have a brief understanding of OpenWrt \nproject and some settings on extroot configuration and network sniffing. You will need an \nerased USB drive device to finish this lab. After this lab, you will be able to turn your router \nin a fully capable GNU/Linux computer that is always powered on and even do some \nhacking operations through the router. \n \nLet’s get started! \n \n                                                                                                                         \n \n-2- \n \n \n3.1  \nOpenWrt \n \nThe OpenWrt Project is a Linux operating system targeting embedded devices. Instead of \ntrying to create a single, static firmware, OpenWrt provides a fully writable filesystem with \npackage management. This frees you from the application selection and configuration \nprovided by the vendor and allows you to customize the device using packages to suit any \napplication. For developers, OpenWrt is the framework to build an application without \nhaving to build a complete firmware around it; for users, this means the ability for full \ncustomization, to use the device in ways never envisioned. \n \nOpenWrt is a highly extensible GNU/Linux distribution for embedded devices (typically \nwireless routers). Unlike many other distributions for these routers, OpenWrt is built from \nthe ground up to be a full-featured, easily modifiable operating system for your router. In \npractice, this means that you can have all the features you need with none of the bloat, \npowered by a Linux kernel that's more recent than most other distributions. \n \nIn this Lab, we will use a router called GL-MT300N-V2 which has OpenWrt pre-installed. \nThis router is small, light and easy to use. Some hacker may use this kind of router on the \npublic environment such as a coffee store, shopping mall, airport, etc to mark a free wi-fi \nnetwork and achieve user’s information and password.  \n \n3.2.  \nGetting started with OpenWrt \nPower up the router and wait for few seconds. Once orange color light up you will have the \ndefault WiFi network up and running. \n \nFigure 1: Examples on connecting with router Wi-Fi network \n \nDefault WiFi password is written on the back of the mini router. Once you are connected to \nthe network, use the default IP address written on the back of the mini router to access the \nmanagement console. \n \n                                                                                                                         \n \n-3- \n \nAfter language, country selection, and setting admin password, you will get the simplified ad\nmin console for GL.iNet. \n \n \n \nFigure 2: Simplified admin console for GL.iNet \n \nIn this section, we will use the repeat network on the network connection. Select internet \nsettings on simplified admin console shown as figure 2. Find “Repeat” on main page, \nselect Scan, then you will find some available Wi-Fi network. If not, you can use your \nmobile phone to start an access point. Then use your phone as a hotspot and connected \nwith the network. If you are using your mobile phone as a personal hotspot, you may \ndisconnect with any Wi-Fi network use LTE/4G as the network connection. \n \nNotice: You may not successfully connect to the internet as a repeater through \nEagle-WiFi since it needs to be accessed through username and password. \n \nWhen you successfully connected with one Wi-Fi, refresh the website and you will see the \n‘internet connection’ bar has changed from blank to an IP address setting on it and if you \nclick on that, you will find the detailed information on repeater connection. \n \n \n \nFigure 3: Example on successfully connect to the internet through repeater mode \n \n                                                                                                                         \n \n-4- \n \nNotice: To make sure you are successfully connected to the internet, you may ping \n8.8.8.8 and check the connection. If you are using mobile devices on repeater \nconnection, be aware of mobile data use. \n \nSometimes the operating system will automatically switch to an Internet-accessible \nWi-Fi network. So make sure your repeatable Wi-Fi has Internet access all the time \nand you are always connecting on the Wi-Fi by the router.  \n \n3.3.  \nAnalyzing network traffic with OpenWrt \n \nIn this section, we will SSH to OpenWrt installed router and use software such as tcpdump \nand Wireshark to analyze network traffic. \n  \n \nStep 1: SSH to the router.  \n \nIn this step, you can use whether windows PuTTY or Linux/Unix based system to SSH to \nthe router i.e. Kali system. If you are using windows system, download PuTTY from the \nwebsite (Choose MSI (‘Windows Installer’) -> 64-bit or 32-bit) and install. Open PuTTY, \non Host Name(or IP address) part, type in the router IP address and click open. Then, on \ncommand window, log in as root and type in the password you set before. You will then \nsuccessfully SSH to the router. If you are using Kali, make sure to configure the network \ninterface to Bridge. \n \n \n \n \nFigure 4: Example on successfully using PuTTY on Windows SSH to the router \n \n                                                                                                                         \n \n-5- \n \nWarning: These approaches might specially come in handy when you need to \nanalyze packets generated by mobile devices. It could be a great setup to analyze \nhow an Android device infected with a malware, behaves and communicates with \nexternal components. \n \nIn addition, a similar setup can also be used to perform a passive man in the middle \nattack. This is why it is generally advised not to use public WiFi networks unless \nyou are protected with a VPN (or at least trusted SSL/TSL connections). \n \n \nStep 2: Analyzing network traffic with remote Wireshark listener \n \nIn this section, you will use the Kali VM system and Wireshark in Kali to analysis the \nnetwork traffic in your laptop. Following three steps are setups before analyzing. \n \n \nFirst, open your Kali system and make sure the network adapter is in “Bridge” mode.  \nSecond, run “dhclient” on the command line to refresh the network settings and make \nsure your Kali system has an updated IP address in the same network of your laptop and \nyour router. \n \nThird, mark down all the IP address of these three devices. Following is an example: \n \n• \nOpenWrt Router: 192.168.8.1 \n• \nMy laptop device: 192.168.8.226 (Victim, check your ipconfig/ifconfig under Wi-fi) \n• \nKali system with Wireshark: 192.168.8.181 (attacker, check this as well) \n \nOnce you finish setting up all the IP address, we can use the following commands to \nanalysis on Wireshark. \n \n1. SSH into OpenWrt installed router (usually port 22, as we did on step 1) and install \n“iptables-mod-tee” to update the router with below command: \n \n$ opkg update  \n$ opkg install iptables-mod-tee \n \n2. Run following iptables command to “forward a copy of each packet with source-IP (-\ns) on out interface (-o) to gateway-IP (–gateway)” \n \n$ iptables -A POSTROUTING -t mangle -o br-lan ! -s 192.168.8.226 \n-j TEE --gateway 192.168.8.181 \n \n3. Run following iptables command to “forward a copy of each packet with destination-I\nP (-d) on in interface (-i) to gateway-IP (–gateway)” \n \n$ iptables -A PREROUTING -t mangle -i br-lan ! -d 192.168.8.226 -\nj TEE --gateway 192.168.8.181 \n \n4. Start capturing traffic on Wireshark over eth0 with below filter applied : \n \n(ip.src == 192.168.8.226) || (ip.dst == 192.168.8.226) \n                                                                                                                         \n \n-6- \n \n \nFigure 5: Wireshark capturing from Laptop \n \n \nFrom victim send 10 packets to 8.8.8.8, after that stop Wireshark. \n \n \nUse Wireshark to display the captured traffic. \n \n \nStep 3: Capturing communication with tcpdump \n \nTcpdump can be installed on OpenWrt router itself. Therefore, this approach eliminates \nthe need of having a remote Wireshark or similar listener to analyze the traffic in real-time. \n \n \nSSH into OpenWrt installed the router and install “tcpdump” with below command: \n \nopkg update \nopkg install tcpdump \n \nExecute below command to listen on the interface (-i) and store captured information to a \nfile (-w) and be verbose while doing so (-v). \n \ntcpdump -i any -v -w pcap.cap \n \nIn the exercises, you will need to retrieve and open the pcap.cap file with Wireshark for \nfurther analysis. \n \nFrom victim send 10 packets to 8.8.4.4 \n \nUse tcpdump –r pcap.cap command to display the content of the file \n \n3.4. \nExtroot configuration \n \nNotice: In this section, you will need an empty USB storage device since all the data \ninside the device will be erased. \n \nMany useful LEDE utilities and packages rely on external storage to hold data files. This \nsection is used on how to use a storage device (USB or sata or sdcard or whatever) to \nexpand your LEDE device's space in root filesystem, to install freely all the packages you \nneed. \n \nBackground Info: \n                                                                                                                         \n \n-7- \n \n \nIn most supported devices, the LEDE firmware splits the internal storage into two partitions \n \n• \n“root filesystem” (/), a highly-compressed read-only partition \n• \n“overlay” (/overlay), a second partition that is writable \n \nThe overlay partition is merged with the root filesystem using the overlayfs (a feature of \nlinux kernel), showing a single “whole” read-write filesystem to applications. This way \nLEDE fits even in tiny amounts of internal storage (as low as 4 MiB) but still allows to write \nsettings and install some packages in the writable partition without changing all Linux \nprograms used. \n \nExtroot, also known as rootfs on external storage, works by setting another overlay \npartition in the external storage device, and during boot, this new overlay partition will be \nmounted over the internal storage's overlay partition. This approach allows easy fallback \nin case the external storage device is removed, as your LEDE device will still have its own \noverlay partition and thus will load all configuration from there. Which means that it will \nbehave exactly the same as just before you set up extroot. \n \nStep 1: From the command line interface write (on a single line): \n \n$ opkg update && opkg install block-mount kmod-fs-ext4 kmod-usb-\nstorage e2fsprogs kmod-usb-ohci kmod-usb-uhci fdisk \n \nThis installs packages needed for a partition with the ext4 filesystem (and doesn't install \npackages for the f2fs filesystem). \n \nStep 2: Run command “fdisk -l” to check which part is the major storage section on your \nUSB disk. Your USB device may only have one partition, so make sure to use your own \nsda to mount. For example, sda2 is the major storage section in this USB disk: \n \n \n \nFigure 6: USB device size check information. \n \n \n \n \nStep 3: We now first format the external drive as f2fs or ext4. \n \n                                                                                                                         \n \n-8- \n \nFor f2fs: \n \n$ mkfs.f2fs /dev/sda2 \n \nFor ext4: \n \n$ mkfs.ext4 /dev/sda2 \n \nThen we transfer the content of the current overlay inside the external drive \n \n$ mount /dev/sda2 /mnt ; tar -C /overlay -cvf - . | tar -C /mnt -\nxf - ; umount /mnt \n \nStep 4: Now we create automatically the fstab uci subsystem and fill it with the right \nconfiguration to have /dev/sda2 as new overlay \n \n$ block detect > /etc/config/fstab; sed -i \ns/option$'\\t'enabled$'\\t'\\'0\\'/option$'\\t'enabled$'\\t'\\'1\\'/ \n/etc/config/fstab; sed -i s#/mnt/sda2#/overlay# \n/etc/config/fstab; cat /etc/config/fstab; \n \n \nNow we are successfully generated fstab on /dev/sda2. \n \nStep 5: Now as you refresh the website of the router, you can see a device appears on \nthe main page. \n \n \nFigure 7: USB device successfully mounted. \nIf you did not find the device, you may reboot the router. If you have any questions on \nextroot configuration, you may first check this website [7] \n \n4. What to turn in for Grading?  \n(Report with answers to below questions should be turned on the due date; do not forget to write \nyour name and title on the reports) \n1. Provide a screenshot (like Figure 5) of your running results for Section 3.3. Highlight \nthe IP addresses of the Router, victim and attacker. (30 points) \n                                                                                                                         \n \n-9- \n \n \n2. Based on packets captured in Section 3.3, use the command tcpdump to display the \nten packets sent to 8.8.4.4 on your screen. Include a screenshot on input the .cap file in \nWireshark (use scp to achieve that: https://www.freecodecamp.org/news/scp-linux-\ncommand-example-how-to-ssh-file-transfer-from-remote-to-local/ ) and the tcpdump \nquery you used. (30 points) \n3. Dnsmasq is a lightweight DNS, TFTP, PXE, router advertisement and DHCP server. It \nis intended to provide coupled DNS and DHCP service to a LAN. Dnsmasq accepts DNS \nqueries and either answers them from a small, local, cache or forwards them to a real, \nrecursive, DNS server. It loads the contents of /etc/hosts so that local hostnames which \ndo not appear in the global DNS can be resolved and also answers DNS queries for DHCP \nconfigured hosts. It can also act as the authoritative DNS server for one or more domains, \nallowing local names to appear in the global DNS. Read the article: “DNS spoofing with \nDnsmasq (https://openwrt.org/docs/guide-user/base-system/dhcp.dnsmasq )” and try to \nrun Dnsmasq on your router. Provide a screenshot on successfully assign Dnsmasq on \nyour router. (40 points) \n4. (Extra Points) Open-ended question: In this lab, we introduce two basic packages which \nhelps you start learning OpenWrt system. Search online and the official website, provide \nwhich you think are interesting such as security tools, guest hotspot and so on. Explain \nwhat these packages are mainly do and install at least one package which interests you \nthe most in your router. Provide some screenshots. (10 points each package explore, 30 \nextra points at most to be given) \n \n \n"
}