{
  "filename": "Midterm-review.pptx",
  "text": "CEN 3078 Computer Security\nMidterm - Review\n\n2\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nModel of Internet Layers for User/Device Communications\n3\nTCP/IP Communication\n4\nTCP/IP Communication (2)\n5\n6\nTypes of Ethical Hackers\nWhite Hat Hacker\nDo not intend to harm the system or organization but they so, officially to penetrate and locate the vulnerabilities, providing to fix them and ensure safety\nBlack Hat Hacker\nThey are non-ethical hackers performing hacking to fulfill their selfish intentions to collect monetary benefits\nGrey Hat Hacker\nCombination of white and black – they hack without any malicious intent for fun; don’t use approval from a targeted organization and publicly disclose any vulnerability\n\n\n\n\n7\nBasic Security Terminology\nDevices:\nFirewall\nFilters network traffic\nProxy server\nDisguises IP address of internal host\nIntrusion Detection System (IDS)\nMonitors traffic, looking for attempted attacks\nActivities:\nAuthentication\nAuditing\n8\nExercise: Act during an Intrusion\nSuppose you observe that your PC is responding very slowly to information requests from the net. And then you further observe that your network gateway shows high levels of network activity, even though you have closed your e-mail client, Web browser, and other programs that access the net. \n\nWhat types of malware could cause these symptoms? \nHow might the malware have gained access to your system? \nWhat steps can you take to check whether this has occurred? \nIf you do identify malware on your PC, how can you restore it to safe operation?\n9\nIn-Class Exercise: Act during an Intrusion\nWhat types of malware could cause these symptoms? \nVirus, Worm\nHow might the malware have gained access to your system? \nPhishing attacks using malicious email messages that activate the virus or worms by using a web link pointing to a malware download or carrying malicious attachments\nWhat steps can you take to check whether this has occurred? \nRefer to your anti-virus software logs\nUse a traffic network analyzer, like Wireshark, and scan the network traffic for a period of time to possibly determine the type of traffic being generated by the PC, the destination, and also the service that is generating that traffic\n10\nIn-Class Exercise: Act during an Intrusion\n\nd) If you do identify malware on your PC, how can you restore it to safe operation?\nIsolate the machine from any network connections\nAttempt to create a backup of the data, although the backup will contain infected files, at least data will be saved for future cleaning\nIf possible, completely rebuild the system and recover the data from the most recent backup that is considered free from malware\nIf no backups are available then try to clean the system using an anti-virus package or other data recovery tools\nMoral: Have a plan and know your Risks; Consider Cyber Insurance purchase and follow Incident Response best practices…\nCyber Security Definition\nNIST 7298 Report defines the term cybersecurity as follows:\n“Measures and controls that ensure confidentiality, integrity, and availability of information system assets including hardware, software, firmware, and information being processed, stored, and communicated.”\n\n\n11\n1. What assets do we need to protect?\n2. How are those assets threatened?\n3. What can we do to counter those threats?\nNIST standard FIPS 199 (Standards for Security Categorization of Federal Information and Information Systems) \nKey Security Concepts\n12\nRelated CIA Triad Definitions – from Information Assurance Perspective\nConfidentiality: This term covers two related concepts:\nData confidentiality: Assures that private or confidential information is not made available or disclosed to unauthorized individuals\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nIntegrity: This term covers two related concepts:\nData integrity: Assures that information and programs are changed only in a specified and authorized manner\nSystem integrity: Assures that a system performs its intended function in an unimpaired manner, free from deliberate or inadvertent unauthorized manipulation of the system\nAvailability: Assures that systems work promptly and service is not denied to authorized users\n\n13\nApplication Security vs. Network Security\n14\nApplication Security\n\n\nPreservation of confidentiality, integrity, and availability of application information\nOther properties such as authenticity, accountability, non-repudiation, and reliability can also be involved\nNetwork Security\n\n\nProtection  of networks and their services from unauthorized modification, destruction, or disclosure \n\nProvision of assurance that the network performs its critical function correctly and that there are no harmful side effects\nSecurity Concepts and Relationships\u000b(from RFC 2828, Internet Security Glossary)\n15\nAdversary (threat agent)\nIndividual, group, organization, or government that conducts or has the intent to conduct detrimental activities\u000b\nAttack\nAny kind of malicious activity that attempts to collect, disrupt, deny, degrade, or destroy information system resources or the information itself\n\nCountermeasure\nA device or techniques that has as its objective the impairment of the operational effectiveness of undesirable or adversarial activity\nAims to prevent espionage, sabotage, theft, or unauthorized access to or use of sensitive information or information systems\n\nRisk\nA measure of the extent to which an entity is threatened by a potential circumstance or event, and typically a function of: (i) the adverse impacts that would arise if the circumstance or event occurs; and (ii) the likelihood of occurrence\nSecurity Concepts and Relationships (2)\u000b(from RFC 2828, Internet Security Glossary)\n16\nSecurity Policy\nA set of criteria for the provision of security services; It defines and constrains the activities of a data processing facility in order to maintain a condition of security for systems and data.\n\nSystem Resource (Asset – Hardware, Software, Data, Network)\nA major application, general support system, high impact program, physical plant, mission critical system, personnel, equipment, or a logically related group of systems\n\nThreat\nAny circumstance or event with the potential to adversely impact/harm: organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, or the Nation through an information system – via unauthorized access, destruction, disclosure, modification of information, and/or denial of service\n\nVulnerability\nFlaw or weakness within: an information system, system security procedures, internal controls, or implementation that could be exploited or triggered by a threat source\n\n\nBasically, a threat is a possible danger that might exploit a vulnerability…\nVulnerabilities, Threats and Attacks\n17\nCategories of vulnerabilities\nCorrupted (loss of integrity)\nLeaky (loss of confidentiality)\nUnavailable or very slow (loss of availability)\n\nThreats\nCapable of exploiting vulnerabilities\nRepresent potential security harm to an asset\n\nAttacks (threats carried out)\nPassive – attempt to learn or make use of information from the system that does not affect system resources\nActive – attempt to alter system resources or affect their operation\nInsider – initiated by an entity inside the security parameter\nOutsider – initiated from outside the perimeter\n\n\n\nLevels of Impact\n18\n(i) organization functions are noticeably reduced; (ii) minor damage to assets; (iii) minor financial loss; or (iv) minor harm to individuals\n(i) organization functions are significantly reduced; (ii) significant assets damage; (iii) significant financial loss; or (iv) significant but not life-threatening individuals harm\n(i) organization functions are severely disrupted; (ii) major damage to assets; (iii) catastrophic financial loss; or (iv) individual loss of life or life-threatening injuries\nIn-Class Exercise:\u000bHow to Secure Linux OS?\nTo avoid malicious compromise of system resources, following issues need to be addressed:\nUse strong passwords – lock account if multiple login failures\nInstall only the required software packages\nDo you need Apache?\nSetup access lists for services (i.e., host firewall)\nRegularly patch the OS \nCheck listening ports and verify if those are required\nUse “netstat” or even an Intrusion Detection System (IDS) for monitoring\nRun only required system services\nUse “chkconfig” to list all services started at bootup\nAvoid telnet, rlogin and rsh – use scp/sftp instead \nSecure remote access\nSecure NFS if sharing files over network\n\nFor more details - http://www.puschitz.com/SecuringLinux.shtml\n\n19\nThreats on Assets\n20\nAn online drive is compromised\nAfter a successful attack (e.g., Sony Hack)\nAn unauthorized copy of software is made - or -\nLicenses are used without permission\nImportance of Cybersecurity for Manufacturers\nManufacturing businesses are increasing online for operations\nWeb, Cloud Computing, Internet-of-Things, Big Data\nManufacturers are unfortunately a frequent target of hackers and attackers\nAccording to a report from the U.S. Department for Homeland Security, manufacturing is the second highest industry with the most reported cyber attacks, only subsequent to the energy sector\nAccording to a report by NTT Security, the manufacturing industry was the most heavily targeted industry during Q2 2017, accounting for 34% of all documented attack activity\nA Kaspersky Lab Survey of IT managers published in Virus News also found that “21 percent of manufacturers suffered a loss of intellectual property (IP) within the past year” \n21\nhttps://www.nist.gov/blogs/manufacturing-innovation-blog/cybersecurity-protecting-manufacturing-technology-and-innovation \nIn-Class Exercise: \u000bCreate a survey for a small-business company\n22\n\nCreate a survey questionnaire that will help a cybersecurity expert to assist a manufacturing/utility enterprise in becoming aware of their current cyber security posture and help them in:\nDefending their company’s vital data and information\nPreventing theft or damage to company infrastructure, equipment and systems\nAvoiding major disruptions to operations and the delivery of products\nProtecting employee’s personal information\nShielding the company from negative publicity\nPlanning IT budgets and policies with adequate cyber incident response\n\nDiscuss potential improvements in cyber attack threat detection and mitigation strategies that result in benefits in terms of: \nincreased productivity, cost savings and reduced risk\nSmall Business Response Exercise\nQ1) Important assets in your enterprise that are networked internally or with an external site\na) Do you use industrial equipment that is connected to the Internet? Yes  /  No\nb) Are there machines connected to computers with industry-standard/paid software licenses? Yes  /  No\nc) Do you store and share business-related data using cloud platforms? Yes  /  No\nd) Do you operate a private data center/server with network equipment? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q1:\n\n23\nAssume you are speaking to a small business enterprise \n- <<Name>>\nSmall Business Response Exercise (2)\nQ2) Potential cyber attack threats and the risks associated with compromise of valuable assets\na) Are you concerned about loss of data confidentiality due to undesired information exposure? Yes  /  No\nb) Are you concerned about data integrity because of data corruption by human/machine? Yes  /  No\nc) Are you concerned of loss of services or infrastructure that makes data inaccessible? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q2:\n\n24\nSmall Business Response Exercise (3)\nQ3) Solutions adopted to address cyber security threats and the risks associated with compromise of valuable assets\na) Do you use commercial or open-source software or network appliances for cyber security? Yes  /  No\nb) Do you manage network firewalls or role-based access control policies? Yes  /  No\nc) Do you have a process to monitor and prevent potential cyber intrusion detection? Yes  /  No\nd) Do you need the cyber security solutions to be compliant for external security audits? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q3:\n\n\n25\nSmall Business Response Exercise (4)\nQ4) Cyber security posture and potential of impact limits your workers day-to-day productivity\na) Do you have a cyber security posture related design document? Yes  /  No\nb) Do you have a budget allocated for cyber security related business cost? Yes  /  No\nc) Are you satisfied with the effort and/or $$ on cyber security? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q4:\n\n\n26\n27\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\n28\nPassive and Active Attacks\n\nPassive Attack\nActive Attack\n\nAttempts to learn or make use of information from the system but does not affect system resources\nHard to detect (no alteration)\nEasy to stop\nEavesdropping on, or monitoring of, transmissions\nGoal of attacker is to obtain information that is being transmitted\nTwo types:\nRelease of message contents\nTraffic analysis\n\nAttempts to alter system resources or affect their operation\nHard to stop\nEasy to detect (application impact)\nInvolve some modification of the data stream or the creation of a false stream\nFour categories:\nReplay\nMasquerade\nModification of messages\nDenial of service\nPassive Attack – Interception\u000b(Sniffing)\n29\nPacket sniffing describes the process of capturing live data as they flow across a network\nPassive Attack – Traffic Analysis\u000b(Sniffing)\n30\nObserve traffic pattern\nActive Attack – Interruption\u000b(Spoofing)\n31\nBlock delivery of message\n\nPacket spoofing occurs when critical information in the packet is forged by an attacker\nActive Attack – Fabrication\u000b(Spoofing)\n32\nFabricate message\n\nE.g., TCP session hijacking, DNS cache poisoning\nActive Attack – Replay\u000b(Sniffing + Spoofing)\n33\nActive Attack – Modification\u000b(Sniffing + Spoofing)\n34\n\n\n\nModify message\nTCP/IP Communication (Recall)\n35\nSocket Programming – Sending packets\n36\nTCP – connection-oriented transport protocol (error-free)\nUDP – connectionless transport protocol (for time-sensitive communication)\nPort Number – Route information to particular application process (some numbers are reserved e.g., port 80 for web servers)\nUDP Client Example – sending packets using Python; and use Netcat program to test the server\n\n\n\n\n\n\n\n\n\n\nHow packets are received?\n37\nNIC (Network Interface Card) is a physical or logical link between a machine and a network\n\nEach NIC has a MAC address\n\nEvery NIC on the network will hear all the frames on the wire\n\nNIC checks the destination address for every packet, if the address matches the card’s MAC address, it is further copied into a buffer in the kernel\n\n\n\n\n\n\n\nApplication\nLAN (Layer 2)\nSocket System Calls\nNIC\nUpper layer processing starting with IP\nOS control starts\nAttack Surfaces\n38\nAttack Surface Categories\n39\nAttack Surface Analysis\n40\nAn attack surface analysis is a useful technique for assessing the scale and severity of threats to a system\n\nA systematic analysis of points of vulnerability makes developers and security analysts aware of where security mechanisms are required\nUse Decomposition to document components, applications and their infrastructure  develop data flow diagrams along with privilege boundaries  ensure proper controls are in place for any data crossing boundaries \n\nOnce an attack surface is defined, designers may be able to find ways to make the surface smaller, thus making the task of the adversary more difficult\nIgnore “high-risk, low-reward” cases\n\nThe attack surface also provides guidance on setting priorities for testing, strengthening security measures, or modifying the service or application\nDetermine the layers of security you need based on the threat, don’t forget they impact performance\n\n\n\n\n\n\n\nThreat Modeling\n41\nThreat model - a framework which details internal and external vulnerabilities, as well as objectives and countermeasures\n\nFive major threat modeling steps:\n Defining security requirements\n Creating an application diagram \n Identifying threats \n Mitigating threats\n Validating that threats have been mitigated \n\n\nThreat Models\n42\nMicrosoft STRIDE\nhttps://www.microsoft.com/en-us/securityengineering/sdl/threatmodeling\n\n\nFundamental Security Design Principles\n43\nDespite years of research and development, it has not been possible to develop security design and implementation techniques that systematically exclude security flaws and prevent all unauthorized actions\nIn the absence of such foolproof techniques, it is useful to have a set of widely agreed design principles that can guide the development of protection mechanisms [NSA/DHS Proposed]\nSecurity Design Principles\nEconomy of mechanism\nDesign of security measures embodied in both hardware and software should be as simple and small as possible\nThe motivation for this principle is that - small design is easier to test and verify thoroughly; complexity complicates management\nFail-safe defaults\nAccess decisions should be based on permission rather than exclusion\nDefault situation is lack of access, and the protection scheme identifies conditions under which access is permitted\nComplete mediation\nEvery access must be checked against the access control mechanism\nSystems should not rely on access decisions retrieved from a cache\nOpen design\nDesign of a security mechanism should be open rather than secret\nFor example, although encryption keys must be secret, encryption algorithms should be open to public scrutiny\n\n\n\n\n\n44\nSecurity Design Principles (2)\nSeparation of privilege\nA practice in which multiple privilege attributes are required to achieve access to a restricted resource\nE.g., multifactor user authentication, which requires a password and a smart device, to authorize a user\nLeast privilege\nEvery process and every user of the system should operate using the least set of privileges necessary to perform the task\nE.g., use of this principle can be seen in role-based access control\nLeast common mechanism\nDesign should minimize the functions shared by different users, providing mutual security\nThis principle helps reduce the number of unintended communication paths\nPsychological acceptability\nSecurity mechanisms should not interfere unduly with the work of users, while at the same time meeting the needs of those who authorize access\nIf security mechanisms hinder the usability or accessibility of resources, users may opt to turn off those mechanisms\n\n\n\n\n\n45\nSecurity Design Principles (3)\nIsolation\nPublic access systems should be isolated from critical resources (data, processes, etc.) to prevent disclosure or tampering\nIn cases where the sensitivity or criticality of the information is high, limit the number of systems on which that data are stored \nEncapsulation\nA specific form of isolation based on object-oriented functionality\nProtection by encapsulating a collection of procedures and data objects so that they may be called only at designated domain entry points \nModularity\nDevelopment of security functions as separate, protected modules and use of a modular architecture for mechanism design and practice\nLayering\nUse of multiple, overlapping protection approaches addressing the people, technology, and operational aspects of information systems\nLeast astonishment\nA program or user interface should always respond in the way that is least likely to astonish the user\nFor example, the mechanism for authorization should be transparent enough to a user that the user has a good intuitive understanding of the security goals\n\n\n\n\n\n46\n47\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nClasses of Intruders – Cyber Criminals\n48\nHackers/Crackers: Individuals or members of an organized crime group with a goal of financial reward\nVerizon found that 92% of the breaches they investigated were by outsiders, with 14% by insiders, and with some breaches involving both outsiders and insiders\nInsiders were responsible for a small number of very large dataset compromises\nTheir activities may include: \nIdentity theft\nTheft of financial credentials\nCorporate espionage\nData theft\nData ransoming\nTypically they are young, often Eastern European, Russian, or southeast Asian hackers, who do business on the Web\nThey meet in underground forums (e.g., DarkMarket.org and theftservices.com) to trade tips and data and coordinate attacks\n\n\n\n\n\n\nClasses of Intruders – Activists\n49\nAre either individuals, usually working as insiders, or members of a larger group of outsider attackers, who are motivated by social or political causes\n\nAim of their attacks is often to promote and publicize their cause typically through:\nWebsite defacement\nDenial of service attacks \nTheft and distribution of data that results in negative publicity or compromise of their targets (e.g., Edward Snowden, Chelsea Manning)\n\nAlso know as Hacktivists - Skill level is often quite low sometimes (i.e., script-kiddies) but there are large skilled groups \n\t\t(e.g., Anonymous Group, LulzSec)\n\n\n\n\n\n\n\nExamples of Intrusion\n50\nNIST SP 800-61 (Computer Security Incident Handling Guide) List:\nRemote root compromise\nWeb server defacement\nGuessing/cracking passwords\nCopying databases containing credit card numbers\nViewing sensitive data without authorization\nRunning a packet sniffer\nDistributing pirated software\nUsing an unsecured device to access internal network\nImpersonating an executive to get information\nUsing an unattended workstation\n…\n\n\n\n\n\n\n\nIntruder Behavior\n51\nThe techniques and behavior patterns of intruders are constantly shifting, to exploit newly discovered weaknesses and to evade detection and countermeasures\nE.g., they start with a phishing attack that results in the installation of malware that steals login credentials that eventually results in the compromise of a Point-of-Sale terminal\n\n\n\n\n\nDefinitions\n52\nSecurity Intrusion: \nUnauthorized act of bypassing the security mechanisms of a system\n\nIntrusion Detection: \nA hardware or software function that gathers and analyzes information from various areas within a computer or a network to identify possible security intrusions\n\nIntrusion Detection Systems (IDSs) / Intrusion Prevention Systems (IPSs): \nDesigned to aid countering intrusion threats and are reasonably effective against known, less sophisticated attacks (e.g., large-scale email scams)\nThey may not be effective against the more sophisticated, targeted attacks by some criminal or state-sponsored intruders (e.g., new, zero-day exploits)\nThey are part of a defense-in-depth strategy that may also include encryption of sensitive information, detailed audit trails, strong authentication and authorization controls, and active management of application and network security\n\n\n\n\n\n\nIDS vs IPS\n53\nIntrusion Detection System\n54\nHost-based IDS (HIDS)\nMonitors the characteristics of a single host and its users for suspicious activity\nNetwork-based IDS (NIDS)\nMonitors network traffic and analyzes network, transport, and application protocols to identify suspicious activity\nDistributed or hybrid IDS\nCombines information from a number of sensors, often both host and network based, in a central analyzer and user interface that is able to better identify and respond to intrusion activity\n\nAnalysis Approaches\n55\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nAnomaly detection\nSignature/Heuristic detection\nInvolves the collection of data relating to the behavior of legitimate users over a period of time\nCurrent observed behavior is analyzed to determine whether this behavior is that of a legitimate user or that of an intruder\nCan detect unknown, zero-day attacks, as it starts with known good behavior and identifies anomalies to it – but false alarms are common!\nUses a set of known malicious data patterns or attack rules that are compared with current behavior\nAlso known as misuse detection\nCan only identify known attacks for which it has patterns or rules\nAnomaly Detection Classification Approaches\n56\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nTwo key issues that affect the relative performance of these alternatives are: (i) the efficiency/effectiveness, and (ii) cost of the detection process\nMachine Learning Approaches Proposed for an IDS\n57\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nBayesian networks:  Encode probabilistic relationships among observed metrics\n\nMarkov models:  Develop a model with sets of states, some possibly hidden, interconnected by transition probabilities\n\nNeural networks:  Simulate human brain operation with neurons and synapse between them, that classify observed data\n\nFuzzy logic:  Uses fuzzy set theory where reasoning is approximate, and can accommodate uncertainty\n\nGenetic algorithms:  Uses techniques inspired by evolutionary biology, including inheritance, mutation, selection and recombination, to develop classification rules\n\nClustering and outlier detection:  Group the observed data into clusters based on some similarity or distance measure, and then identify subsequent data as either belonging to a cluster or as an outlier\n\n\n\n\n\n58\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nPrivacy\n59\nMinimum human supervision\nOverlaps with computer security\n\nDramatic increase in scale of information collected and stored\nData-intensive research, Modeling & Simulation, IoT, Social Networks\n\nMotivated by law enforcement, national security, economic incentives\n\nIndividuals have become increasingly aware of access and use of personal information and private details about their lives\n\nConcerns about extent of privacy compromise have led to a variety of legal and technical approaches to reinforcing privacy rights\n\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nPrivacy Protection\n60\nMinimum human supervision\nBoth policy and technical approaches are needed to protect privacy\n\nIn terms of technical approaches, the requirements for privacy protection for data stored on information systems can be addresses in part using the technical mechanisms developed for database security\n\nWith regard to social media sites, technical controls include:\nThe provision of suitable privacy settings to manage who can view data on individuals\nNotification when one individual is referenced or tagged in another’s content\nAlthough social media sites include some form of these controls, they are constantly changing, causing frustration for users who are trying to keep up with these mechanisms\n\nAnother approach for managing privacy concerns in big data analysis is to anonymize the data, removing any personally identifying information before release to researchers or other organizations for analysis\n\nData Privacy\n61\nMinimum human supervision\nIn terms of policy, guidelines are needed to manage the use and reuse of big data, ensuring suitable constraints are imposed in order to preserve privacy:\n\nConsent\nEnsuring participants can make informed decisions about their participation in the research\nPrivacy and confidentiality\nPrivacy is the control that individuals have over who can access their personal information\nConfidentiality is the principle that only authorized persons should have access to information\nOwnership and authorship\nAddresses who has responsibility for the data, and at what point does an individual give up their right to control their personal data\nData sharing – assessing the social benefits of research\nThe social benefits that result from data matching and reuse of data from one source or research project in another\nGovernance and custodianship\nOversight and implementation of the management, organization, access, and preservation of digital data\n62\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \n63\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nTCP Protocol\n64\nTransmission Control Protocol (TCP) is a core protocol of the Internet protocol suite\nSits on the top of the IP layer; transport layer\nProvide host-to-host communication services for applications\nTwo transport Layer protocols\nTCP: provides a reliable and ordered communication channel between applications\nUDP: lightweight protocol with lower overhead and can be used for applications that do not require reliability or communication order \nTCP Header\nTCP Segment: TCP Header + Data. \n\nSource and Destination port (16 bits each): Specify port numbers of the sender and the receiver.\n\nSequence number (32 bits) : Specifies the sequence number of the first octet in the TCP segment. If SYN bit is set, it is the initial sequence number.\nAcknowledgement number (32 bits): Contains the value of the next sequence number expected by the sender of this segment. Valid only if ACK bit is set.\n65\nTCP Header\nHeader length (4 bits): Length of TCP header is measured by the number of 32-bit words in the header, so we multiply by 4 to get number of octets in the header.\nReserved (6 bits): This field is not used.\nCode bits (6 bits): There are six code bits, including SYN,FIN,ACK,RST,PSH and URG.\nWindow (16 bits): Window advertisement to specify the number of octets that the sender of this TCP segment is willing to accept. The purpose of this field is for flow control.\nChecksum (16 bits): The checksum is calculated using part of IP header, TCP header and TCP data.\nUrgent Pointer (16 bits): If the URG code bit is set, the first part of the data contains urgent data (do not consume sequence numbers). The urgent pointer specifies where the urgent data ends and the normal TCP data starts. Urgent data is for priority purposes as they do not wait in line in the receive buffer, and will be delivered to the applications immediately.\nOptions (0-320 bits, divisible by 32): TCP segments can carry a variable length of options which provide a way to deal with the limitations of the original header.\n66\nTCP 3-way Handshake Protocol\nSYN Packet: \nThe client sends a special packet called SYN packet to the server using a randomly generated number x as its sequence number\n\nSYN-ACK Packet:\nOn receiving it, the server sends a reply packet using its own randomly generated number y as its sequence number\n\nACK Packet\nClient sends out ACK packet to conclude the handshake\n67\nKernel establishes send and receive buffer on both sides\nTCP 3-way Handshake Protocol\nWhen the server receives the initial SYN packet, it uses TCB (Transmission Control Block) to store the information about the connection\nThis is called half-open connection as only client-server connection is confirmed\nThe server stores the TCB in a queue that is only for the half-open connection\nAfter the server gets ACK packet, it will take this TCB out of the queue and store in a different place\nIf ACK doesn’t arrive, the server will resend SYN+ACK packet; The TCB will eventually be discarded after a certain time period\n68\nTCP 3-way Handshake Protocol\nSYN Packet: \nThe client sends a special packet called SYN packet to the server using a randomly generated number x as its sequence number\n\nSYN-ACK Packet:\nOn receiving it, the server sends a reply packet using its own randomly generated number y as its sequence number\n\nACK Packet\nClient sends out ACK packet to conclude the handshake\n69\nKernel establishes send and receive buffer on both sides\nTCP 3-way Handshake Protocol\nWhen the server receives the initial SYN packet, it uses TCB (Transmission Control Block) to store the information about the connection\nThis is called half-open connection as only client-server connection is confirmed\nThe server stores the TCB in a queue that is only for the half-open connection\nAfter the server gets ACK packet, it will take this TCB out of the queue and store in a different place\nIf ACK doesn’t arrive, the server will resend SYN+ACK packet; The TCB will eventually be discarded after a certain time period\n70\n71\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \n72\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\n73\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nSYN Flooding Attack\nIdea : To fill the queue storing the half-open connections so that there will be no space to store TCB for any new half-open connection, basically the server cannot accept any new SYN packets.\n\nSteps to achieve this : Continuously send a lot of SYN packets to the server. This consumes the space in the queue by inserting the TCB record\nDo not finish the 3rd step of handshake as it will dequeue the TCB record\nWhen flooding the server with SYN packets, attackers use random source IP addresses; otherwise the attacks may be blocked by the firewalls…\n74\nCountermeasures: SYN Cookies\nAfter a server receives a SYN packet, it calculates a keyed hash (H) from the information in the packet using a secret key that is only known to the server\nThis hash (H) is sent to the client as the initial sequence number from the server. H is called SYN cookie\nThe server will not store the half-open connection in its queue when SYN Cookie kicks-in after a certain number of SYN packets are received; instead information is put in the packet to see if it is a real connection to get information back\nIf the client is an attacker, H will not reach the attacker\nIf the client is not an attacker, it sends H+1 in the acknowledgement field\nThe server checks if the number in the acknowledgement field is valid or not by recalculating the cookie\n75\n76\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Reset Attack\nTo disconnect a TCP connection gracefully :\n\nA sends out a “FIN” packet to B\nB replies with an “ACK” packet. This closes the A-to-B communication\nNow, B sends a “FIN” packet to A and A replies with “ACK”\n\nUsing Reset flag (another way to terminate connection between A & B in abnormal/urgent situations) :\n\nOne of the parties sends RST packet to immediately break the connection\n77\nTCP Reset Attack\nGoal: To break up a TCP connection between A and B\n\nSpoofed RST Packet: The following fields need to be set correctly:\nSource IP address, Source Port, Destination IP address, Destination Port (i.e., 4-Tuple to identify a TCP connection) \nSequence number (within the receiver’s window)\n78\nFun fact: This tampering technique can be used by a firewall or abused by a malicious attacker to interrupt Internet connections.\nThe Great Firewall of China, and Iranian Internet censors are known to use TCP reset attacks to interfere with and block connections as a major method to carry out Internet censorship.\n79\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\n80\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Session Hijacking Attack\nGoal: To inject data in an established connection.\n(This is different from the DoS attack in TCP SYN Flooding or Reset)\n\nSpoofed TCP Packet: The following fields need to be set correctly:\nSource IP address, Source Port, \nDestination IP address, Destination Port\nSequence number (within the receiver’s window)\n\n\n81\nDefending Against Session Hijacking\nMaking it difficult for attackers to spoof packets\nRandomize source port number\nRandomize initial sequence number \n\nNote: Randomization is NOT effective against local attacks that can sniff packets and determine this information \n\nEncrypting payload\n82\n83\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nDenial-of-Service (DoS) Attack\n84\nA denial of service (DoS) is an action that prevents or impairs the authorized use of networks, systems, or applications by exhausting resources such as central processing units (CPU), memory, bandwidth, and disk space\nA form of attack on the availability of a service; focus is generally on network services that are attacked over their network connection\n\nDoS Attack - Facts\nOne of the most common types of attacks\nAims to prevent users from accessing system\nRequires a minimum of technical skill\nEffective because computers and other systems have physical limitations\nNumber of simultaneous users\nSize of files\nSpeed of data transmission\nAmount of data stored\n\n85\nDenial-of-Service (DoS) Attack Categories\n86\nClassic DoS Attacks\nFlooding ping command\nAim of this attack is to overwhelm the capacity of the network connection to the target organization\nTraffic can be handled by higher capacity links on the path, but packets are discarded as capacity decreases\nSource of the attack is clearly identified (e.g., in ICMP echo request) unless a spoofed address is used - attacker might use a large company’s Web server to target a medium-sized company with a lower-capacity network connection\nNetwork performance is noticeably affected\nDefense: Load balancers, firewalls\n\n\n87\nFlooding Attacks\nClassified based on network protocol used\nIntent is to overload the network capacity on some link to a server\nVirtually any type of network packet can be used\n\n\n\n88\nDistributed DoS (DDoS) Attacks\nUse of multiple systems to generate flooding attacks\nAttacker uses a flaw in operating system or in a common application to gain access and installs their zombie program on it \nLarge collections of such systems under the control of one attacker’s control can be created, forming a botnet\n\n\n89\nHypertext Transfer Protocol (HTTP) Based Attacks\n90\nHTTP flood attack\nAttack that bombards Web servers with HTTP requests\nConsumes considerable resources\nSpidering - Bots start from a given HTTP link and follow all links on the provided Web site in a recursive way \nSlowloris attack\nAttempts to monopolize a server’s multi-threading by sending HTTP requests that never complete\nEventually consumes Web server’s connection capacity\nUtilizes legitimate HTTP traffic\nExisting intrusion detection and prevention solutions that rely on signatures to detect attacks will generally not recognize Slowloris\nRate limiting number of host connections can help defend or delayed binding can be done by a load balancer to ensure web server or proxy will not see incomplete requests\n\n\n\n\nDNS Reflection Attack\nReflector attack establishes a self-contained loop between the intermediary and the target system; Both systems act as reflectors\nMost reflector attacks can be prevented through network-based and host-based firewall rulesets that reject suspicious combinations of source and destination ports\n\n\n91\nNormal DNS Operation\nDNS Operation under Attack\nThe DNS client sends a query from its UDP port 1792 to the server’s DNS port 53 to obtain the IP address of a domain name. The DNS server sends a UDP response packet including the IP address. \nThe attacker sends a query to the DNS server with a spoofed IP source address of j.k.l.m; this is the IP address of the target. The attacker uses port 7, which is usually associated with echo, a reflector service. The DNS server then sends a response to the victim of the attack, j.k.l.m, addressed to port 7. If the victim is offering the echo service, it may create a packet that echoes the received data back to the DNS server. This can cause a loop between the DNS server and the victim.\nAmplification Attacks\n92\nThey are a variant of reflector attacks and also involve sending a packet with a spoofed source address for the target system to intermediaries\nThey differ in generating multiple response packets for each original packet sent; this can be achieved by directing the original request to the broadcast address for some network; as a result, all hosts on that network can potentially respond to the request, generating a flood of responses to a victim (spoofed) IP address\nIt is only necessary to use a service handled by large numbers of hosts on the intermediate network; the well-known Smurf DoS program used ping flood mechanism using ICMP echo request packets\nThe best additional defense against this form of attack is to not allow directed broadcasts to be routed into a network from outside\n\n\nAmplification Attacks cont.\n93\nSmurf Attack\nDNS Amplification Attack\n94\nUse packets directed at a legitimate DNS server as the intermediary system\n\nAttacker creates a series of DNS requests containing the spoofed source address of the target system\n\nExploit DNS behavior to convert a small request to a much larger response (amplification)\n\nTarget is flooded with responses\n\nBasic defense against this attack is to prevent the use of spoofed source addresses\n\n\n\n\n\nAnother way to category DDoS\nVolume Based Attacks\u000bIncludes UDP floods, ICMP floods, and other spoofed-packet floods. The attack’s goal is to saturate the bandwidth of the attacked site, and magnitude is measured in bits per second (Bps).\nProtocol Attacks \u000bIncludes SYN floods, fragmented packet attacks, Ping of Death, Smurf DDoS, and more. This type of attack consumes actual server resources, or those of intermediate communication equipment, such as firewalls and load balancers, and is measured in packets per second (Pps).\nApplication Layer Attacks \u000bIncludes HTTP Based Attacks, attacks that target Apache, Windows, or OpenBSD vulnerabilities, and more. Comprised of seemingly legitimate and innocent requests, these attacks aim to crash the web server, and the magnitude is measured in Requests per second (Rps).\n\n95\nFour lines of DDoS Attack Defense\n96\nDDoS Attack Prevention\n97\nBlock spoofed source addresses\nOn routers as close to source as possible\nFilters may be used to ensure path back to the claimed source address is the one being used by the current packet\nFilters must be applied to traffic before it leaves the ISP’s network or at the point of entry to their network\nUse modified TCP connection handling code\nCryptographically encode critical information in a cookie that is sent as the server’s initial sequence number\nLegitimate client responds with an ACK packet containing the incremented sequence number cookie\nDrop an entry for an incomplete connection from the TCP connections table when it overflows\n\n\n\n\n\n\nDDoS Attack Prevention (2)\n98\nBlock IP directed broadcasts\n\nBlock suspicious services and combinations\n\nManage application attacks with a form of graphical puzzle (captcha) to distinguish legitimate human requests\n\nGood general system security practices\n\nUse mirrored and replicated servers when high-performance and reliability is required\n\n\n\n\n\nResponding to DoS Attacks\n99\nAntispoofing, directed broadcast, and rate limiting filters should have been implemented \n\nIdeally have network monitors and IDS to detect and notify abnormal traffic patterns\n\n\n\n\n\n\n\nResponding to DoS Attacks\n100\nIdentify type of attack\nCapture and analyze packets \nDesign filters to block attack traffic upstream\nOr identify and correct system/application bug\nHave ISP trace packet flow back to source\nMay be difficult and time consuming\nNecessary if planning legal action\nImplement contingency plan\nSwitch to alternate backup servers\nCommission new servers at a new site with new addresses\nUpdate incident response plan\nAnalyze the attack and the response for future handling\n\n\n\n\n\nHow to Defend Against DoS Attacks – On your own?\nIn addition to previously mentioned methods…\nConfigure your firewall to \nFilter out incoming ICMP packets\nDisallow any incoming traffic\nUse tools such as NetStat and others\nDisallow traffic not originating within the network\nDisable all IP broadcasts\nFilter for external and internal IP addresses\nKeep AV signatures, OS, and software patches current\nHave an Acceptable Use Policy\n\n\n\nSummary\nDoS attacks are among the most common attacks on the Internet\nDoS attacks are unsophisticated\nDoS attacks can have devastating effects\nYour task is constant vigilance and protection strategy\n\n103\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nInteracting with Database in Web Application\nA typical web application consists of three major components:\n\n\n\n\n\n\n\n\n\n\nSQL (Structured Query Language) Injection attacks can cause damage to the database\nAs we notice in the figure, the users do not directly interact with the database but through a web server; If this channel is not implemented properly, malicious users can attack the database\n\n104\nLaunching SQL Injection Attacks\nEverything provided by user will become part of the SQL statement (user data is mixed with web application code and given to the database); Is it possible for a user to change the meaning of the SQL statement?\nThe intention of the web app developer by the following is for the user to provide some data for the blank areas:\n\n\n\n\nAssume that a user inputs a random string in the password entry and types “EID5002’#” in the eid entry; The SQL statement will become the following: \n105\nUser is taking help of some special characters (e.g., # which will comment remainder of query i.e., the password check) to change the meaning of the SQL statement\nLaunching SQL Injection Attacks\nEverything from the # sign to the end of line is considered as comment; The SQL statement will be equivalent to the following:\n\n\n\nThe above statement will return the name, salary and SSN of the employee whose EID is EID5002 even though the user doesn’t know the employee’s password; This is a security breach\nLet’s see if a user can get all the records from the database assuming that we don’t know all the EID’s in the database\nWe need to create a predicate for WHERE clause so that it is true for all records (i.e., ‘a’ is dummy that would not have any match, BUT we can add a true condition like “OR 1 =1” to match all the records)\n106\nLaunching SQL Injection Attacks using cURL\n\nMore convenient to use a command-line tool to launch attacks\nEasier to automate attacks without a graphic user interface\nUsing cURL, we can send out a form from a command-line, instead of from a web page as follows:\n\n\nThe above command will not work; In an HTTP request, special characters are in the attached data needs to be encoded (with %20) or they maybe mis-interpreted\nIn the above URL we need to encode the apostrophe, whitespace and the # sign and the resulting cURL command is as shown below:\n\n107\nModify Database\n\n\nConsider the form created for changing passwords; It asks users to fill in three pieces of information, EID, old password and new password\n\nWhen Submit button is clicked, an HTTP POST request will be sent to the server-side script changepasswd.php, which uses an UPDATE statement to change the user’s password\n\n108\nIf the statement is UPDATE or INSERT INTO, we will have chance to change the database\nModify Database\n\nLet us assume that Alice (EID5000) is not satisfied with the salary she gets; She would like to increase her own salary using the SQL injection vulnerability; She would type her own EID and old password. The following will be typed into the “New Password” box:\n\n\nBy typing the above string in “New Password” box, we get the UPDATE statement to SET one more attribute for us, the salary attribute; The SQL statement will now look as follows:\n\n\n\nWhat if Alice doesn’t like Bob and would like to reduce Bob’s salary to 0, but she only knows Bob’s EID (eid5001), not his password; How can she execute the attack?\n109\nDue to SQL injection vulnerability, attackers can change other attributes (e.g., salary)\nMultiple SQL Statements\n\nDamages that can be caused are bounded because we cannot change everything in the existing SQL statement\nIt will be more dangerous if we can cause the database to execute an arbitrary SQL statement\nTo append a new SQL statement “DROP DATABASE dbtest” to the existing SQL statement to delete the entire dbtest database, we can type the following in the EID box\n\nThe resulting SQL statement is equivalent to the following, where we have successfully appended a new SQL statement to the existing SQL statement string\n\n\nThe above attack doesn’t work against MySQL, because in PHP’s mysqli extension, the mysqli::query() API doesn’t allow multiple queries to run in the database server\n \n\n\n\n\n110\nMultiple SQL Statements\nThe code below tries to execute two SQL statements using the $mysqli->query() API\n\n\n\n\n\n\nWhen we run the code, we get the following error message:\n\n\n\n\nIf we do want to run multiple SQL statements, we can use $mysqli -> multi_query() [not recommended for security purposes]\n\n\n111\nThe Fundamental Cause\nMixing data and code together is the cause of several types of vulnerabilities and attacks including SQL Injection attack, XSS attack, attacks on the system() function and format string attacks\n\n112\nCross-Site Scripting\nSQL Injection\nShell Script Injection\nCountermeasures: Filtering and Encoding Data\nBefore mixing user-provided data with code, inspect the data; Filter out any character that may be interpreted as code\nSpecial characters are commonly used in SQL Injection attacks; To get rid of them, encode them\nEncoding a special character tells parser to treat the encoded character as data and not as code; This can be seen in the following example\n\n\nPHP’s mysqli extension has a built-in method called mysqli::real_escape_string(); It can be used to encode the characters that have special meanings in SQL\nThe following code snippet shows how to use this API \n\n\n113\nThe filtering or escaping approach doesn’t address the fundamental cause of the problem; Data and code are still mixed together\nWhy Are Prepared Statements Secure?\nTrusted code is sent via a code channel\nUntrusted user-provided data is sent via data channel\nDatabase clearly knows the boundary between code and data\nData received from the data channel is not parsed\nAttacker can hide code in data, but the code will never be treated as code, so it will never be attacked\n\n114\n115\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nThe Cross-Site Scripting Attack\nIn XSS, an attacker injects malicious code to the victim’s browser via the target website\nWhen code comes from a website, it is considered as trusted with respect to the website, so it can access and change the content on the pages, read cookies belonging to the website and sending out requests on behalf of the user\n\nBasically, code can do whatever the user can do inside the session\nTypes: \nNon-persistent (Reflected) XSS Attack\nPersistent (Stored) XSS Attack\n\n\n116\nNon-persistent (Reflected) XSS Attack\nMany websites take input from the user, conduct some activities and then send response to the user in a web page, with the original user input included on the response (i.e., the user input is reflected back)\nE.g., Google search will give back your input and results\nIf a website with a reflective behaviour takes user inputs, then:\nAttackers can put JavaScript code in the input, so when the input is reflected back, the JavaScript code will be injected into the web page from the website\n117\nNon-persistent (Reflected) XSS Attack\nAssume a vulnerable service on website : http://www.example.com/search?input=word, where word is provided by the users\n\nNow the attacker sends the following URL to the victim and tricks him to click the link: http://www.example.com/search?input=<script>alert(“attack”);</script>\n\nOnce the victim clicks on this link, an HTTP GET request will be sent to the www.example.com web server, which returns a page containing the search result, with the original input in the page\nThe input here is a JavaScript code which runs and gives a pop-up message on the victim’s browser\n118\nPersistent (Stored) XSS Attack\nAttackers directly send their data to a target website/server which stores the data in a persistent storage\nIf the website later sends the stored data to other users, it creates a channel between the users and the attackers\n\nExample: User profile in a social network is a channel as it is set by one user and viewed by another\n119\nPersistent (Stored) XSS Attack\nThese channels are supposed to be data channels\nBut data provided by users can contain HTML markups and JavaScript code\nIf the input is not sanitized properly by the website, it is sent to other users’ browsers through the channel and gets executed by the browsers\nBrowsers consider it like any other code coming from the website; Therefore, the code is given the same privileges as that from the website\n120\nCountermeasures: The Filter Approach\nRemoves code from user inputs (corrects the mistake of mixing code and data together)\nIt is difficult to implement as there are many ways to embed code other than <script> tag\nUse of open-source libraries that can filter out JavaScript code \nExample: jsoup\n\n121\nCountermeasures: The Encoding Approach\nReplaces HTML markups with alternate representations\nIf data containing JavaScript code is encoded before being sent to the browsers, the embedded JavaScript code will be displayed by browsers, not executed by them\nConverts <script> alert(‘XSS’) </script> to &lt;script&gt;alert(‘XSS’)\n122\nCountermeasures: Using CSP\nHow websites tell browsers which code source is trustworthy is achieved using a security mechanism called Content Security Policy (CSP)\nThis mechanism is specifically designed to defeat XSS and ClickJacking attacks\nCSP has become a standard, which is supported by most browsers nowadays\nCSP not only restricts JavaScript code, it also restricts:\nother page contents, such as limiting where pictures, audio, and video can come from\nwhether a page can be put inside an iframe or not (used for defeating ClickJacking attacks)\n123\nIn-Class Practices\nQuestion 1: In order to implement the classic DoS flood attack, the attacker must generate a sufficiently large volume of packets to exceed the capacity of the link to the target organization. Consider an attack using ICMP echo request (ping) packets that are 500 bytes in size (ignoring framing overhead). How many of these packets per second must the attacker send to flood a target organization using a 0.5-Mbps link? How many per second if the attacker uses a 2-Mbps link? Or a10-Mbps link?\n\nAnswers to Q1\nLet’s have the following parameters: w the bandwidth of the communications channel, and p the minimum number of 500-byte size packets needed to exceed the capacity of the channel. To reach the capacity of the channel (p * 500 * 8) = w, with w expressed in bits, so p = w/4000. Based on it for each case we have:\nw = 0.5 Mbps = 500,000 bits; p = 500000/4000 = 125 packets/second \nw = 2.0 Mbps = 2,000,000 bits; p = 2000000/4000 = 500 packets/second\nw = 10.0 Mbps = 10,000,000 bits; p = 10000000/4000 = 2,500 packets/second\n\nIn-Class Practice\nQuestion 2: Consider a distributed variant of the attack we explore in Problem Q1. Assume the attacker has compromised a number of broadband-connected residential PCs to use as zombie systems. Also assume each such system has an average uplink capacity of 128 kbps. What is the maximum number of 500-byte ICMP echo request (ping) packets a single zombie PC can send per second? How many such zombie systems would the attacker need to flood a target organization using a 0.5-Mbps link? A 2-Mbps link? Or a10-Mbps link? Given reports of botnets composed of many thousands of zombie systems, what can you conclude about their controller’s ability to launch DDoS attacks on multiple such organizations simultaneously? Or on a major organization with multiple, much larger network links than we have considered in these problems?\n\nAnswers to Q2\nLet’s have the following parameters: w the bandwidth of the communications channel, and p the minimum number of 500-byte size packets needed to exceed the capacity of the channel, and z the number of zombies needed to exceed the capacity of the channel. The maximum number of packets a zombie can send is pz = 128,000/4000 =32 pps (packets per second). Based on the results from Q2, the number of required zombies will be z = p/pz = p/32, and for each case we have:\nw = 0.5 Mbps;\t    z = 125pps/32pps = 3,9 (requires 4 zombies)\nw = 2.0 Mbps;     z = 500pps/32pps = 15,6 (requires 16 zombies)\nw = 10.0 Mbps;   z = 2500pps/32pps = 78,1 (requires 79 zombies)\nBased on the results we got above, it suggests that just a few zombies with relatively low capacity communication channel will be able to cause problems to organizations. In the examples above, with corporate bandwidth from 0.5Mbps to 10Mbps, we have a very narrow channel for today’s standards, however the number of zombies required to shut those networks down is small compared with the thousands of zombies that a botnet controller could use. With thousands of zombies conducting flooding DoS attacks, a botnet controller will be able to attack many organizations at the same time or a big organization with multiple links. If the botnet controller manages to increase the size of the packet the attack will be even more effective. \nIn-Class Practices\nQuestion 3: All the information that a server needs to know about a connection is not only contained in the SYN packet, but also in the final ACK packet from the client. Therefore, information-wise, there is no need to allocate a buffer to save the information about half-open connections. If we get rid of this buffer, the SYN flooding attack will not be effective any more. Do you agree with such a statement or not. Please justify your answer.\n\nAnswers to Q3\nBasically, if we get rid of the buffer, we have solved the SYN flooding attack problem, but we will introduce a new and more powerful attack. The attacker can simply send ACK flooding packets, each one causing the server to allocate memory for a full connection, which takes more memory than that for half-open connections.\n\n130\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nThe Heartbleed Bug and Attack\n131\nVulnerability in the OpenSSL library, specifically the Heartbeat protocol in TLS (Transport Layer Security)\nOpenSSL (widely used library for TLS) drives HTTPS that your web browser relies on for online banking, and other secure transactions\nLaunched in 2012 on web servers built on top of OpenSSL\nDisclosed in 2014\nBackground: the Heartbeat Protocol\n132\nTLS/SSL protocols provide a secure channel between two communicating applications\nHeartbeat extension: implement keep-alive feature of TLS\nMaintains secure session without interruption (e.g., from firewall) when client and server are not sending data to each other for a period of time \nHard to initiate and re-establish secure sessions\nSend request packet to receiver and obtain an acknowledgement packet by doing a copy of the payload content based on payload length L\nThe copy caused the vulnerability; attacker can specify larger L\nHeartbleed bug is an implementation flaw in TLS/SSL heartbeat extension\nSimply update your system’s OpenSSL library. The following two commands can be used for it:\n\n\n\nThe following code shows how the OpenSSL library is fixed\n\nFixing the Heartbleed Bug\n133\nFixing the Heartbleed Bug – Use Bounds Checking\n134\nComparing the shown code with the vulnerable version shown earlier, \nAn if statement is added\ns  s3  rrec.length is the total number of bytes in the request packet; this is the actual length and not the one declared in the request packet\nConstant 1  size of type field\nConstant 2  size of length field\nConstant 16  minimum padding length\n\nThe if statement compares whether the declared payload length plus a constant (19) is larger than the actual size of the request packet\nIf larger, the packet is discarded and there will be no reply\nIf attacker send a request packet with larger declared length value, the packet won’t have any effect\nStory: Bounds Checking and Game Design \nCryptojacking\n135\nCryptojacking is the unauthorized use (i.e., hijacking) of someone else’s computer processing power to mine cryptocurrency\n\nHackers do this by either:\nSocial Engineering / Malware: Getting the victim to click on a malicious link (phishing) in an email that loads cryptomining code (malware) on the computer, or \nBrowser-based Attacks: By infecting a website or online ad with JavaScript code that auto-executes once loaded in the victim’s browser (mining will take place as long as browser/tab is open)\n\nEither way, the cryptomining code then works in the background as unsuspecting victims use their computers normally \nSymptoms: overheating of device, high processor usage, slower performance or lags in execution\nHow Cryptojacking Works\n136\nHackers inject a cryptomining script on a website or in an Ad that is placed on multiple sites\nWhen the victim visits the infected website, or if the malicious Ad pops up in the victim’s browser, the script automatically executes\nNo code is stored on the victim’s computer and no damage is done to computers or victims’ data\n\nInteraction with mining pool\nPrevention of Cryptojacking\n137\nUse VPN to encrypt internet connections and hide IP address\nAwareness and Training to thwart social engineering scams\nInstall an Ad-blocking or anti-cryptomining extension on web browsers\nUse end-point protection that is capable of detecting known crypto miners\nKeep your web filtering tools up to date\nMaintain browser extensions\nUse a mobile device management (MDM) solution to better control what’s on users’ devices\n\nDNS and Attacks\n138\nDNS Hierarchy, Zones, and Servers\n\nDNS Query Process\n\nDNS Attacks: Overview\n\nLocal DNS Cache Poisoning Attack\n\nDefense against DNS spoofing attacks\n\n\n\n\n\n\n\n\n\nDNS Domain Hierarchy\n139\nBelow ROOT, we have Top-Level Domain (TLD). Ex: In www.example.com, the TLD is .com\nThe next level of domain hierarchy is second-level domain which are usually assigned to specific entities such as companies, schools etc.\n\n\nDomain (nameserver) namespace is organized in a hierarchical tree-like structure\nEach node is called a domain, or subdomain.\nThe root of the domain is called ROOT, denoted as ‘ . ‘\n\nInternet Assigned Name Authority (IANA) \nDomain Name System (DNS) is a phonebook of the Internet – enables mapping of domain names to IP addresses of machines \nDNS Zone\n140\nHierarchy tree structure depicts subdomains within example.com domain\nIn this case, there are multiple DNS zones one for each country; the zone keeps records of who the management authority is for each of its subdomains\nFor scalability, you have sub-domains on different name servers\n\nDNS is organized according to zones \n\nA zone groups contiguous domains and subdomains on the domain tree and assign management authority to an entity\nusa.example.com is a domain with subdomains as boston, nyc and chicago; Two zones are created for usa.example.com - First contains usa domain, chicago and boston subdomain and second contains nyc subdomain\nDNS Query Process\n141\nDNS Cache\nLocal DNS Files\nRecursive\n.com\nDNS cache\nWhen the local DNS server gets information from other DNS servers, it caches the information\n\nEach piece of information in the cache has a time-to-live value, so it will be eventually time out and removed from the cache\n142\nQuestion: How local DNS server get’s root server IP? \nAnswer: The Zone file\nDNS Attacks\nDenial-of-Service Attacks (DoS): When the local DNS servers and the authoritative nameservers do not respond to the DNS queries, the machines cannot retrieve IP addresses which essentially cuts down the communication\n\nDNS Spoofing Attacks: \nPrimary goal: provide a fraudulent IP address to victims, tricking them to communicate with a machine that is different from their intention \nExample: If a user’s intention is to visit a bank’s web site to do online banking, but the IP address obtained through the DNS process is attacker’s machine, the user machine will communicate to the attacker’s web server\n143\nOverview of the Attack Surfaces\n144\nDNS queries involve several packets and thus present a broad attack surface in terms of spoofing (1 – 4 in figure below)\n/etc/hosts file\nwith localhost information\n\nYou can also launch DoS attack at all points – root, local DNS server, TLD server\nDNS Attacks on Compromised Machines\nIf attackers have gained the root privileges on a machine, \nModify /etc/resolv.conf: use malicious DNS server as the machine’s local DNS server and can control the entire DNS process\nModify /etc/hosts: add new records to the file, providing the IP addresses for some selected domains\nFor example, attackers can modify IP address of www.bank32.com which can lead to attacker’s machine\n\n145\nSpoofing DNS Replies (from LAN)\n146\nAttacks on user machines : When the user machine sends out a DNS query to its local DNS server, attacker can immediately send a spoofed reply, using local DNS as its source IP address; Attackers can put any arbitrary IP address in the reply\n\nAttacks on local DNS server : Cache Poisoning attack : When the local DNS server sends out iterative queries to get an answer from the DNS servers on the Internet, attackers can send out spoofed replies to the local DNS server; They get accepted as long as they arrive before the actual replies - This is called DNS cache poisoning\n\n147\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\n148\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nCritical Application Infrastructures\nVery large user bases, and web services that benefit societal needs \n149\nHealth Care\nConsumer Apps\nOnline Retail\nAdvanced \nManufacturing\nCloud Computing \nAnd Networking\nGaming\nLightweight and Flexible Security for IoT-based Public Safety Applications\nRecreated disaster scenes of tornado damages (in Joplin, MO 2011) at the: (a) Joplin High School; (b) Joplin Hospital\n150\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\nA. Esquivel, D. Kavzak Ufuktepe, R. Ignatowicz, A. Riddle, C. Qu, P. Calyam, K. Palaniappan, “Enhancing Network-edge Connectivity and Computation Security in Drone Video Analytics”, IEEE Applied Imagery Pattern Recognition (AIPR) Workshop, 2020.\n151\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\n152\nDetails in Module 4…\nMedia Application: \u000bJust-in-time News Feeds\nRecent shift in news related media consumption trends\nReaders are relying on 'just-in-time news feeds' versus the traditional print medium\nMedia companies are offering ‘just-in-time news’ feed service for their subscribers who pay money for ‘premium’ content\nParticularly popular in sectors such as Finance and Health Care\n\n153\nMedia Application: Anomaly Detection\n154\nUsed to detect anomalies occurring in a network path or server\nRequires collection of profiles or signatures that represent the normal and abnormal behavior \nE.g., number of failed login attempts permissible/occurred for a host, the level of processor usage, and consumed network bandwidth\n\nMedia Application: Anomaly Detection\n155\n“URL Anomaly Detection” checks the abnormality of a URL through detection of the deviation of the character distribution in the received URL string \nTraining Phase:\nHere, the data is trained using some sample URLs\nFrom the URLs, an ASCII map count of each character is generated. This count is used in the Anomaly Detection phase to calculate the String Length Probability and Character Distribution Frequency Probability\nDetection Phase:\nThis phase calculates the Anomaly value for a given input URL\nThe Character Frequency Distribution uses Histogram model to calculate the Frequency Distribution of each character in the given input URL string\nThe Anomaly Score is calculated as -\n\nManufacturing Application \u000bSecurity & Privacy\n156\n“Agile manufacturing” builds on the benefits of cloud computing (e.g., businesses\nDon’t need to invest and manage expensive computing resources or computational solver licenses) \nNeed to bridge the collaboration gap between Manufacturing App Developer and a Cloud Engineer  in “Manufacturing App Marketplaces”\n\nOr AWS, GCP, …\nManufacturing App Marketplace \u000bSecurity Architecture\n157\nHow to secure on-going efforts to scale-up the App Marketplace with user opt-in via a new web-access layer features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to run virtual desktops, and virtual machines for web servers to host the various Apps\n(c) secure storage of results after the computation stages to protect intellectual property of the manufacturers’ App designs and data sets\n(d) Defense against LoC using HoneyFiles (Defense by Pretense)\n\nSmartGrid Application\n158\nWide-area measurement and control systems (WAMCS) technology using Phasor Measurement Units (PMUs) is important\nHelps guarantee resilience, stability, reliability, state estimation, control, and protection of next-generation power systems\nHowever, there is an exponentially increasing number of PMUs and PDCs being deployed in the North American grid\nResult is an explosion in data volume, which needs an efficient wide-area communication and computing infrastructure\nSmartGrid Application\n159\nAs an example for power grids, according to UCAlug Open Smart Grid, every PMU (from a utility company) requires 600 to 1500 Kbps bandwidth, 20 ms to 200 ms latency, almost 100% reliability, and a 24-hour backup\nWAMCS will require cloud computing resources (e.g., storage) and Gigabit per second bandwidth for satisfactory performance and resilience\nChallenges are even more aggravated by the gradual transition from centralized to distributed systems for increased speed of data processing\nWith SDN\nPrivacy and Non-disclosure issues\nSmartGrid Security Architecture\n160\nHow to secure on-going efforts to store and process PMU data with utility companies opt-in via a new web-access layer and software-defined network features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to computation in the cloud to calculate e.g., secure state estimates in the power grids\n(c) secure storage of results after the computation stages to protect intellectual property of the utility company’s data sets\n(d) Defense against LoC attacks using Role-based Access Control\n\nSecurity and challenges in Collaborative Drone Systems\n\nThe use of these systems has been increasing and the issues related to security, privacy, reliability, regulation, and ownership are also increasing at the same pace [5].\n\nFurthermore, collaborative drone systems are usually resource-constrained, in addition to being highly vulnerable to physical and cyber attacks/threats.\n\nChallenges exist to secure the communication in collaborative drone services in terms of privacy leakage, data confidentiality protection, and the lack of development and implementation of mechanisms for reliable and secure protocols [6].\n[5] Hassija, V., Chamola, V., Agrawal, A., Goyal, A., Luong, N.C., Niyato, D., Yu, F., & Guizani, M. (2021). Fast, Reliable, and Secure Drone Communication: A Comprehensive Survey. \n[6] C. Lin, D. He, N. Kumar, K. R. Choo, A. Vinel, X. Huang, \"Security and Privacy for the Internet of Drones: Challenges and Solutions\", IEEE Communications Magazine, Vol. 56, no. 1, pp. 64-69, 2018.\n161\nAttacks on Drones\n\n162\nDoS\nMITM\nBlack Hole\nAttack Vectors\nThroughput is decreased. The communication between UAVs and the GCS is slowed and eventually, it will go out of service.\nThe attacker changes the GPS location information in the packets causing the target UAV to change its target destination (sending information to another agents, or making it crush to an entity)\nThis malicious node begins to beacon with the other UAVs in the swarm, and show high levels of energy, consistent on the protocol activity, causing the UAV to run out of energy before reaching the destination or accomplishing the task.\nHow these attacks are performed\n\n\n\nZero Trust – One way to solve all\n\n163\n\nDetection\nPrevention\nMitigation\nModeling threats that focus on\n\nCheck for a maliciously high data rate of packers from any UAVs in the network. If a drone is found to be send packets at a rate greater than the threshold, the node is blacklisted from the network and the updated blacklist will be sent to the remaining drones in the network.\n\nCompares the energy levels of the drones in the network with a predetermined energy threshold based on the known energy capabilities of the UAV. If the energy level of a UAV is greater than the threshold, then the node is blacklisted from the network.\n\nApply message authentication by using a hash value for each packet and an algorithm to enforce policies if the message integrity is violated. \n\nZero Trust - Defense Mechanisms\n\n\n\nThat’s it! Good Luck!\nExam Date: Mon, Feb. 26th\n"
}