{
  "filename": "Module 4 - Security Analytics - full.pptx",
  "text": "CEN 3078 Computer Security\nModule 3 – Security Analytics\n\n2\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\n3\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nCritical Application Infrastructures\nVery large user bases, and web services that benefit societal needs \n4\nHealth Care\nConsumer Apps\nOnline Retail\nAdvanced \nManufacturing\nCloud Computing \nAnd Networking\nGaming\nBalancing resilience (security) and user experience (performance/usability)\n5\nSecurity architectures need to build upon fundamental concepts of cyber security, along with their relevance in on-premise and cloud computing infrastructure for different application contexts…\n\nApplications: Public Safety, Media, Manufacturing, Healthcare, SmartGrid, …\nLightweight and Flexible Security for IoT-based Public Safety Applications\nRecreated disaster scenes of tornado damages (in Joplin, MO 2011) at the: (a) Joplin High School; (b) Joplin Hospital\n6\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\nA. Esquivel, D. Kavzak Ufuktepe, R. Ignatowicz, A. Riddle, C. Qu, P. Calyam, K. Palaniappan, “Enhancing Network-edge Connectivity and Computation Security in Drone Video Analytics”, IEEE Applied Imagery Pattern Recognition (AIPR) Workshop, 2020.\n7\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\n8\nDetails in Module 4…\nMedia Application: \u000bJust-in-time News Feeds\nRecent shift in news related media consumption trends\nReaders are relying on 'just-in-time news feeds' versus the traditional print medium\nMedia companies are offering ‘just-in-time news’ feed service for their subscribers who pay money for ‘premium’ content\nParticularly popular in sectors such as Finance and Health Care\n\n9\nMedia Application: Anomaly Detection\n10\nUsed to detect anomalies occurring in a network path or server\nRequires collection of profiles or signatures that represent the normal and abnormal behavior \nE.g., number of failed login attempts permissible/occurred for a host, the level of processor usage, and consumed network bandwidth\n\nMedia Application: Anomaly Detection\n11\n“URL Anomaly Detection” checks the abnormality of a URL through detection of the deviation of the character distribution in the received URL string \nTraining Phase:\nHere, the data is trained using some sample URLs\nFrom the URLs, an ASCII map count of each character is generated. This count is used in the Anomaly Detection phase to calculate the String Length Probability and Character Distribution Frequency Probability\nDetection Phase:\nThis phase calculates the Anomaly value for a given input URL\nThe Character Frequency Distribution uses Histogram model to calculate the Frequency Distribution of each character in the given input URL string\nThe Anomaly Score is calculated as -\n\nManufacturing Application \u000bSecurity & Privacy\n12\n“Agile manufacturing” builds on the benefits of cloud computing (e.g., businesses\nDon’t need to invest and manage expensive computing resources or computational solver licenses) \nNeed to bridge the collaboration gap between Manufacturing App Developer and a Cloud Engineer  in “Manufacturing App Marketplaces”\n\nOr AWS, GCP, …\nManufacturing App Marketplace \u000bSecurity Architecture\n13\nHow to secure on-going efforts to scale-up the App Marketplace with user opt-in via a new web-access layer features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to run virtual desktops, and virtual machines for web servers to host the various Apps\n(c) secure storage of results after the computation stages to protect intellectual property of the manufacturers’ App designs and data sets\n(d) Defense against LoC using HoneyFiles (Defense by Pretense)\n\nSmartGrid Application\n14\nWide-area measurement and control systems (WAMCS) technology using Phasor Measurement Units (PMUs) is important\nHelps guarantee resilience, stability, reliability, state estimation, control, and protection of next-generation power systems\nHowever, there is an exponentially increasing number of PMUs and PDCs being deployed in the North American grid\nResult is an explosion in data volume, which needs an efficient wide-area communication and computing infrastructure\nSmartGrid Application\n15\nAs an example for power grids, according to UCAlug Open Smart Grid, every PMU (from a utility company) requires 600 to 1500 Kbps bandwidth, 20 ms to 200 ms latency, almost 100% reliability, and a 24-hour backup\nWAMCS will require cloud computing resources (e.g., storage) and Gigabit per second bandwidth for satisfactory performance and resilience\nChallenges are even more aggravated by the gradual transition from centralized to distributed systems for increased speed of data processing\nWith SDN\nPrivacy and Non-disclosure issues\nSmartGrid Security Architecture\n16\nHow to secure on-going efforts to store and process PMU data with utility companies opt-in via a new web-access layer and software-defined network features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to computation in the cloud to calculate e.g., secure state estimates in the power grids\n(c) secure storage of results after the computation stages to protect intellectual property of the utility company’s data sets\n(d) Defense against LoC attacks using Role-based Access Control\n\nDrone Applications: Security Concerns\n2015: A drone flew into the power line and causes 3 hours of black-out of several hundred houses in West Hollywood, near Los Angeles.\n\n2016: Drone slam into Seattle's Space Needle.\n\n2017: A drone fragment got caught in the front wheel of one of the cyclists, causing him to go over the handlebars.\n\n2017: An accident that happened in 2017 in the Canadian province of Quebec, no eyewitnesses were present to prevent a drone collision. [3]\n\n2019: Drone Crash into Las Vegas Stadium Causes $10K Damage\n\n2021: Drone Slams into Building in World Trade Center\n\n\n\nFig. 1 Worldwide Drone Incidents, drone-related incidents and intrusions from around the world [2]\n[2] https://www.dedrone.com/resources/incidents/all\n[3] https://www.kaspersky.com/blog/drone-incidents/29000/ \nDrone swarms or collaborative drone systems with high-resolution video cameras are used for many operations such as precision agriculture, aerial imaging, and critical applications such as disaster scenarios or rescue response \n\nDrone swarms can also provide and facilitate communication in areas where terrestrial infrastructure is poor or has been destroyed.\nDrone swarms and their integration with cloud/edge infrastructure accomplishing collaborative missions.\n18\nDrone Applications: Security Concerns\nMotivation on Collaborative drone systems \n\nCollaborative drones and IoT play a vital role in supporting a lot of smart city applications such as those involved in communication, transportation, agriculture, safety and security, disaster mitigation, environmental protection, service delivery, energy saving, e-waste reduction, weather monitoring, healthcare, etc. [4]\nFig. 3 Collaborative drone and IoT for improving the smartness of smart cities[7]\n[4] Alsamhi, Saeed H., Ou Ma, Mohammad Samar Ansari, and Faris A. Almalki. \"Survey on collaborative smart drones and internet of things for improving smartness of smart cities.\" Ieee Access 7 (2019).\n19\n\nEnhancing\nNetwork Connectivity\n\nFire detection\n\nTraffic\nControl\nMonitoring\n\nPollution\nMonitoring\n\nAccident\nDetection\n\nSecurity\nAnd\nSurveillance\n\nPacking\nMonitoring\nSecurity and challenges in Collaborative Drone Systems\n\nThe use of these systems has been increasing and the issues related to security, privacy, reliability, regulation, and ownership are also increasing at the same pace [5].\n\nFurthermore, collaborative drone systems are usually resource-constrained, in addition to being highly vulnerable to physical and cyber attacks/threats.\n\nChallenges exist to secure the communication in collaborative drone services in terms of privacy leakage, data confidentiality protection, and the lack of development and implementation of mechanisms for reliable and secure protocols [6].\n[5] Hassija, V., Chamola, V., Agrawal, A., Goyal, A., Luong, N.C., Niyato, D., Yu, F., & Guizani, M. (2021). Fast, Reliable, and Secure Drone Communication: A Comprehensive Survey. \n[6] C. Lin, D. He, N. Kumar, K. R. Choo, A. Vinel, X. Huang, \"Security and Privacy for the Internet of Drones: Challenges and Solutions\", IEEE Communications Magazine, Vol. 56, no. 1, pp. 64-69, 2018.\n20\nAttacks on Drones\n\n21\nDoS\nMITM\nBlack Hole\nAttack Vectors\nThroughput is decreased. The communication between UAVs and the GCS is slowed and eventually, it will go out of service.\nThe attacker changes the GPS location information in the packets causing the target UAV to change its target destination (sending information to another agents, or making it crush to an entity)\nThis malicious node begins to beacon with the other UAVs in the swarm, and show high levels of energy, consistent on the protocol activity, causing the UAV to run out of energy before reaching the destination or accomplishing the task.\nHow these attacks are performed\n\n\n\nZero Trust – One way to solve all\n\n22\n\nDetection\nPrevention\nMitigation\nModeling threats that focus on\n\nCheck for a maliciously high data rate of packers from any UAVs in the network. If a drone is found to be send packets at a rate greater than the threshold, the node is blacklisted from the network and the updated blacklist will be sent to the remaining drones in the network.\n\nCompares the energy levels of the drones in the network with a predetermined energy threshold based on the known energy capabilities of the UAV. If the energy level of a UAV is greater than the threshold, then the node is blacklisted from the network.\n\nApply message authentication by using a hash value for each packet and an algorithm to enforce policies if the message integrity is violated. \n\nZero Trust - Defense Mechanisms\n\n\n\n23\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nData Science/ML and Cybersecurity\n24\nData science/machine learning is critical to reveal “evidence” in cyber attack incidents\nWithout (good) data, there is no knowledge\nTime-series data can be valuable for descriptive and predictive analytics of anomaly events\nUseful for malware research, penetration testing, etc.\nThreat intelligence collection supported by data is critical for decision making in real-life cyber operations/risk management\nHelps cybersecurity engineers prioritize and focus on critical events than working by instinct\n\n\n\nMany large organizations are hiring data scientists to help with cybersecurity analytics\nData-driven Cyber Intelligence Collection\n25\nThreat intelligence sharing helps a cyber analyst’s monitoring objectives for ‘soft critical events’ and ‘silent critical events’ relating to either performance bottlenecks that may relate to security incidents… \nData-driven Cyber Intelligence Collection\n26\nNeed to use statistical data planning policies in systems by considering variations of data structures of the many data silos involved \nActive measurements (ping, traceroute, Iperf or other such one-end or double-end measurement probing)\nPassive measurements (Netflow records, DNS, pcap, host logs, crash dumps, process logs, memory logs) \n\nMonitoring objectives drive network and host device data collection, storage and analysis/visualization in cyber threat hunting\n”Data farming” needs to be synergistic to “Data mining”\n\nMonitoring strategies for expected performance/safety assurances violations due to ‘soft failures’ or ‘silent failures’ \nVersus ‘hard failures’ or ‘failure alarms’ where faults are more apparent to operations personnel using traditional monitoring systems or intrusion detection systems\n\n\n\n\n\n\nTwo-stage Ensemble Learning\n27\nAttack feature analysis is done using a two-stage ensemble learning scheme:\n\nStage A: Outlier Detection\n\nStage B: Outlier Classification\n\n\n\n\nEpsilon is probability that an event is an outlier \u000b– it is tuned in the training phase\n\nIf probability is higher than epsilon or if it is manually triggered, the scheme enters Stage B\nOutlier Detection\n28\nComposition of many efficient, multivariate outlier detectors or hypotheses functions \n\nDetect network-wide correlated anomaly events\n\n\n\n\n\nFunctions:\nEnsemble of hypotheses\nFinal ensemble result\nAttack probability function\nThe posterior probability is proportional to the likelihood of the training data D times the prior probability of h\nOutlier Classification\n29\nDetected attacks are classified into either:\nInteresting events (e.g., attacks)\nErroneous conditions (e.g., router failure)\n\nIf final ensemble results of consecutive events fall in same range, we classify as an attack, else the events are ignored\n\n\n\n\n\n\nNOTE: Ground truth (in addition to high quality data) is extremely important in order to evaluate the accuracy of detected attacks\nThreat Detection and Characterization\n30\nEfficiently detect and characterize cyber threats in a manner that adapts to available data and resource limitations - “sensors for right data at right time”\n\nDetect malicious actions that threaten the integrity of enterprise networks through techniques that integrate information from both networks and hosts  \nGlobal Analysis of Threats\n31\nConstruct global situational awareness to detect otherwise invisible threats \nFocus on malicious activity that is invisible from the perspective of a single network, but becomes apparent when multiple systems share the right data\nAddress what computations need to occur locally, what information must move between locations, and what computations must occur at a central repository \nEmerging AI Technologies for Cyber Hunting\nAutoML - capability of automating the process of building, deploying, and managing machine learning models\nAmazon SageMaker, Big Squid (self-service ML workbench), RapidMiner (visual ML workflow designer)\nAugmented Intelligence - human-centered partnership model of people and AI working together \nEnhance cognitive performance, including learning, decision making, and new experiences \nExplainable AI - an ensemble of methods that make black-box AI algorithms’ outputs sufficiently understandable\nEdge AI - use of AI techniques embedded in IoT endpoints, gateways, and edge devices to act on sensor data\nApplications in streaming analytics for “right data at right time”\n\n32\nhttps://cra.org/ccc/wp-content/uploads/sites/2/2019/08/Community-Roadmap-for-AI-Research.pdf\nAmazon SageMaker\nAmazon SageMaker - fully managed service to label, build, train, and deploy ML models quickly\nAmazon SageMaker Notebooks, Active learning for ground truth\n\n33\nExplainable AI (XAI)\nML models in new age of applications are opaque, non-intuitive \nXAI improves understanding, trust for people\n\n34\nExplainable AI (XAI) Case Study\nAnomaly detection  network-wide bottleneck event diagnosis or cyber attack detection/mitigation\n\n35\n\nTypical ML Steps\n36\nData used to test a system should be representative of the data the system will see\nML for Cybersecurity Videos: https://www.youtube.com/channel/UC6qyO5J_rObFJewJWs89XRA/videos \nCommon Anomaly Detection Analysis Schemes\nStatistical Techniques\nIdentify anomalies without assuming a stochastic model in the measurements\nClassification Techniques\nIdentify the root-cause of anomalies through behavior observation (uses offline training/labeling; online testing on unlabeled measurements for category assignment)\nClustering Techniques\nCategory is not known apriori but placing data points that are similar close to each other – create category based on some distance function\nExpert System Techniques\nRoot-cause analysis by imitiating knowledge of human expert; rule-based or model-based\nGraph-theoretic Techniques\nCausality (cause-effect) or dependency graph representations; algorithms help test various hypotheses or data perspectives\n\n\n\n37\nAI System: “Smart” Workflow to Knowledge-driven Decision Making\nSensing (Assess/Data)\nRecognize important patterns/events in space and time\nFilter out the noise\nTrust in the data\nReasoning (Infer/Learn)\nTurning patterns/events and their relationship into knowledge\nLogic-based inference / evidence-based inference\nLocal/global situation assessment / similarity checking\nBuilding/using knowledge base/catalog with successful example cases\nActing (Predict/Fix)\nEstablish communication goal and generate dialog for a specific crisis\nPlanning / Problem Solving using model predictions\nRobotic Control using software-defined technologies\n\n\n\n38\n39\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nHacking Humor\u000bHackers find a way!\n40\nMinimum human supervision\nEthical Hacking (Recall)\n41\nMinimum human supervision\n\nEthical hackers learn and perform hacking in a professional manner, based on the direction of the client, and later, present a maturity scorecard highlighting their overall risk and vulnerabilities and suggestions to improve\n\nNew worms, malware, viruses, and ransomware are multiplying every day and creating a need for ethical hacking services to safeguard the networks of businesses, government agencies or defense\n\nAn Ethical Hacker answers the following questions:\nWhat kind of vulnerabilities does an attacker see?\nWhat information or system would a hacker most want access?\nWhat can an attacker do with the information?\nHow many people notice the attempted hack?\nWhat is the best way to fix the vulnerability?\n\nhttps://www.eccouncil.org/ethical-hacking/\nTypes of Ethical Hackers\n42\nMinimum human supervision\nWhite Hat Hacker\nDo not intend to harm the system or organization but they so, officially to penetrate and locate the vulnerabilities, providing to fix them and ensure safety\nBlack Hat Hacker\nThey are non-ethical hackers performing hacking to fulfill their selfish intentions to collect monetary benefits\nGrey Hat Hacker\nCombination of white and black – they hack without any malicious intent for fun; don’t use approval from a targeted organization and publicly disclose any vulnerability\n\n\nPenetration Testing / Pen Testing\n43\nMinimum human supervision\nEvaluate security of an IT infrastructure by safely trying (i.e., ethical hacking) to exploit vulnerabilities with written permission\nPerformed at different levels e.g., OS level, web apps level, wired/wireless network services level, end-user level, …\nAssessment to help identify misconfigurations, risky user behavior and validate the efficacy of defense mechanisms\nGoal is to find vulnerabilities before any attacker\nTwo types of Pen Testing\nBlack box: testing external components targeted with public or zero-day exploits (Black Hat)\nWhite box: testing internal components (White Hat) \nCould combine for Grey box testing\n\n\n\nPenetration Testing / Pen Testing\n44\nMinimum human supervision\nManual or automated approaches are used\nPen tester goal is to exploit a particular vulnerability and use compromised hosts to launch new exploits at other internal resources\nDocument the combination of vulnerabilities exploited in a particular sequence \nTesting ends if highest level of privilege escalation or highest levels of security clearance is attained\nA report is produced for decision makers with:\nExposed vulnerabilities in terms of attack surfaces\nStrategic conclusions on impact on business and operations\nPriorities for remediation against threats and attack vectors\nApprovals needed for fixes\nNotifications are sent to relevant stakeholders e.g., senior management, vendors of hardware/software\nPen Tester must close out work (e.g., backdoors to maintain access, etc.) to avoid someone else from exploiting the vulnerabilities later\n\n\n\nPenetration Testing Steps\n45\nMinimum human supervision\nInformation Intelligence\nUsing tools such as nmap, nslookup, people finders/Google search\nPerforming people profiling to target (e.g., via email or phone) as part of social engineering\n\nScanning and Enumerating\nTCP and UDP port scanning to learn about target environment and find exposed vulnerabilities\nUsing tools such as metasploit, nc, nessus for high-speed discovery, configuration auditing, asset profiling, sensitive data discovery\n\nAdvanced Fingerprinting\nAdvanced fingerprinting of web applications, DNS, load balancers, etc. using scanning methods\n\nVulnerability Assessment\nOverlaps with Pen Testing but largely non-intrusive to identify vulnerabilities in systems/networks and analyze security posture\n\t\n\n\n\nVulnerability Assessment and Penetration Testing (VAPT)\n46\nMinimum human supervision\nAutomated/cheaper, minutes, scheduled, passive, “breadth over depth”\n\nPopular Tools: Nessus, OpenVAS, Nikto, SAINT\nOften manual/expensive, days, opportunistic/intuitive, aggressive, “depth over breadth”\n\nPopular Tools: Metasploit, Kali Linux, NetSparker, Core Impact, Aircrack-ng, John Ripper, backtrack, wireshark\nWhich one to choose and when, VA or PT? How do they differ from a security audit to check compliance with standard security policies and procedures?\nVulnerability Assessment – dealing with Myths\n47\nMinimum human supervision\n“I have a firewall or use anti-virus to fend off attacks”\n+) Firewalls can be effective to mitigate threats and isolate/protect\n-) Hackers understand firewall strategies; can take down or by-pass a firewall through exploiting software bugs or admin oversight\n-) End-to-end session hijacking not detectable by firewalls\n\n“Web security is handled by using HTTPS”\n+) Encryption of communication from source to destination is secure\n-) Not effective against DDoS, brute force attacks, SQL injection\n-) Organizations can be compromised by fake SSL certificates\n\n“Our systems and data are not worthwhile targets”\n+) Small business enterprises may not be attractive targets\n-) More easy to attack since they may not take security seriously\n-) Ransomeware attacks are frequent and impact small businesses\n\n\n\t\n\n\n\nMany other vulnerabilities: weak passwords, OS command injection, buffer overflow, privilege over-provisioning, unrestricted uploads of dangerous file types, outdated software, … \n48\nModule-3: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nIT Security Management\nHelps in determining a clear view of an organization’s IT security objectives, security/privacy policies and general risk profile\nFormal (iterative) process of answering questions such as:\n\n\n\n\n\n\nEnsures that critical assets are sufficiently protected in a cost-effective manner\nSecurity risk assessment is needed for each asset in the organization that requires protection\nProvides the information necessary to decide what management, operational, and technical controls are needed to reduce the risks identified\n\n49\nIT Security Management [ISO13335] \n50\nIT Security Management is a Cyclic Process\n51\nCyclic process of must be repeated constantly in order to keep pace with the rapid changes in both IT technology and the risk environment\nPlan – Do – Check - Act Process Model\n52\nPlan:  Establish security policy, objectives, processes and procedures; perform risk assessment; develop risk treatment plan with appropriate selection of controls or acceptance of risk\n\nDo:  Implement the risk treatment plan\n\nCheck:  Monitor and maintain the risk treatment plan\n\nAct:  Maintain and improve the information security risk management\nprocess in response to incidents, review, or identified changes\nOrganizational Context and Security Policy\n53\nMaintained and updated regularly\nUsing periodic security reviews\nReflect changing technical/risk environments\n\nExamine role and importance of IT systems in organization\nWhich essential decisions depend on the accuracy, currency, integrity, or availability of data managed by the IT systems?\nWhat data created, managed, processed, and stored by the IT systems need protection?\nWhat are the consequences to the organization of a security failure in their IT systems?\n\n\n\n\n\n\n\n\nOrganizational Security Policy\n54\nNeeds to be addressed:\nScope and purpose including relation of objectives to business, legal, regulatory requirements\nIT security requirements of assets (in terms of CIA triad)\nAssignment of responsibilities across the organizational structure\nRisk management approach\nSecurity awareness and training\nIntegration of security into systems development\nInformation classification scheme\nContingency and business continuity planning\nIncident detection and handling processes\nHow and when policy reviewed, and change control to it\n\n\n\n\n\n\n\n\n\n\nSecurity Risk Assessment\n55\nCritical component of process in IT security management\n\nIdeally examine every organizational asset\nNot feasible in practice\n The time and effort required, even for large, well-resourced organizations, is clearly neither achievable nor cost effective \n\nApproaches to identifying and mitigating risks to an organization’s IT infrastructure:\nBaseline approach\nInformal approach\nDetailed risk analysis\nCombined approach\n\n\n\n\n\n\n\n\n\n\n\n\nBaseline Approach\n56\nGoal is to implement agreed controls to provide protection against the most common threats\n\nForms a good base for further security measures\n\nUse “industry best practice”\nEasy, cheap, can be replicated\nGives no special consideration to variations in risk exposure\nMay give too much or too little security due to rough baseline\n\nGenerally recommended only for small organizations without the resources to implement more structured approaches\n\n\n\n\n\n\n\n\n\n\n\n\n\nInformal Approach\n57\nDetailed Risk Analysis (Formal Process)\n58\nCombined Approach\n59\nCombines elements of the baseline, informal, and detailed risk analysis approaches\nAim is to provide reasonable levels of protection as quickly as possible and adjust the protection controls deployed on key systems over time\n\nApproach starts with the implementation of suitable baseline security recommendations on all systems\nNext, systems either exposed to high risk levels or critical to the organization's business objectives are identified in the high-level risk assessment\nA decision can then be made to possibly conduct an immediate informal risk assessment on key systems, with the aim of relatively quickly tailoring controls to more accurately reflect their requirements\nLastly, an ordered process of performing detailed risk analyses of these systems can be instituted\n\nOver time, this can result in the most appropriate and cost-effective security controls being selected and implemented on these systems\n\n\n\n\n\n\n\n\n\n\n\n\nDetailed Risk Analysis\n60\nThreat Identification\n61\nRisk Treatment Alternatives\n62\nE.g., taking out insurance against the risk occurring, by entering into a contract with another organization\nThe loss of this capability is traded off against the reduced risk profile\nE.g., implementing an off-site backup process, developing a disaster recovery plan, or arranging for data and processing to be replicated over multiple sites\nE.g., include technical or administrative controls such as deploying firewalls and access tokens, or change policies\nAnalyze Risks\n63\nSpecify likelihood of occurrence of each identified threat to asset given existing controls\n\nSpecify consequence should threat occur\n\nDerive overall risk rating for each threat\nRisk = probability threat occurs x cost to organization\n\nHard to determine accurate probabilities and realistic cost          consequences\n\nUse qualitative and quantitative ratings, heat maps\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRisk Likelihood\n64\nThere will very likely be some uncertainty and debate over exactly which rating is most appropriate\nThis reflects the qualitative nature of the ratings, ambiguity in their precise meaning, and uncertainty over precisely how likely it is that some threat may eventuate\nIt is important to remember that the goal of this process is to provide guidance to management as to which risks exist, and provide enough information to help management decide how to most appropriately respond\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRisk Consequences\n65\nRisk Level Determination\n66\n***https://www.ready.gov/business/planning/risk-assessment\n"
}