{
  "filename": "Module 1 - Application and Network Analysis - full.pptx",
  "text": "CEN 3078 Computer Security\nModule 1 – Application and Network Analysis\n\n2\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\n3\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nModel of Internet Layers for User/Device Communications\n4\nTCP/IP Communication\n5\nTCP/IP Communication (2)\n6\nDiverse Computing and Data Deluge Enabling New Cybersecurity Challenges\n7\nVirtual Machines in Today’s Computing\n\nWith Virtualization\nWithout Virtualization\n8\n9\nIdentifying Types of Threats\nMalware: MALicious softWARE\nSecurity breaches\nDoS: Denial of Service attacks\nWeb attacks\nSession hijacking\nInsider threats\nDNS poisoning\nNew attacks: Doxing\n\n\n10\nMalware\nSoftware with a malicious purpose\nViruses\nTrojan horses \nSpyware\nLogic bombs\n11\nMalware (cont.)\nViruses\nOne of the two most common types of malware\nDesigned to replicate and spread\nUsually spreads through email\nUses system resources, causing network slowdowns or stoppage\n\n\n12\nMalware (cont.)\nTrojan Horses\nThe other most common type of malware\nNamed after the wooden horse of ancient history\nAppears benign but secretly downloads malware onto a computer from within\n\n13\nMalware (cont.)\nSpyware\nA rapidly growing type of malware\nCookies\nKey loggers\nLogic Bombs\nLay dormant until some logical condition is met, often a specific date\n\n\n14\nTypes of Ethical Hackers\nWhite Hat Hacker\nDo not intend to harm the system or organization but they so, officially to penetrate and locate the vulnerabilities, providing to fix them and ensure safety\nBlack Hat Hacker\nThey are non-ethical hackers performing hacking to fulfill their selfish intentions to collect monetary benefits\nGrey Hat Hacker\nCombination of white and black – they hack without any malicious intent for fun; don’t use approval from a targeted organization and publicly disclose any vulnerability\n\n\n\n\n15\nBasic Security Terminology\nDevices:\nFirewall\nFilters network traffic\nProxy server\nDisguises IP address of internal host\nIntrusion Detection System (IDS)\nMonitors traffic, looking for attempted attacks\nActivities:\nAuthentication\nAuditing\n16\nExercise: Act during an Intrusion\nSuppose you observe that your PC is responding very slowly to information requests from the net. And then you further observe that your network gateway shows high levels of network activity, even though you have closed your e-mail client, Web browser, and other programs that access the net. \n\nWhat types of malware could cause these symptoms? \nHow might the malware have gained access to your system? \nWhat steps can you take to check whether this has occurred? \nIf you do identify malware on your PC, how can you restore it to safe operation?\n17\nIn-Class Exercise: Act during an Intrusion\nWhat types of malware could cause these symptoms? \nVirus, Worm\nHow might the malware have gained access to your system? \nPhishing attacks using malicious email messages that activate the virus or worms by using a web link pointing to a malware download or carrying malicious attachments\nWhat steps can you take to check whether this has occurred? \nRefer to your anti-virus software logs\nUse a traffic network analyzer, like Wireshark, and scan the network traffic for a period of time to possibly determine the type of traffic being generated by the PC, the destination, and also the service that is generating that traffic\n18\nIn-Class Exercise: Act during an Intrusion\n\nd) If you do identify malware on your PC, how can you restore it to safe operation?\nIsolate the machine from any network connections\nAttempt to create a backup of the data, although the backup will contain infected files, at least data will be saved for future cleaning\nIf possible, completely rebuild the system and recover the data from the most recent backup that is considered free from malware\nIf no backups are available then try to clean the system using an anti-virus package or other data recovery tools\nMoral: Have a plan and know your Risks; Consider Cyber Insurance purchase and follow Incident Response best practices…\nCyber Security Definition\nNIST 7298 Report defines the term cybersecurity as follows:\n“Measures and controls that ensure confidentiality, integrity, and availability of information system assets including hardware, software, firmware, and information being processed, stored, and communicated.”\n\n\n19\n1. What assets do we need to protect?\n2. How are those assets threatened?\n3. What can we do to counter those threats?\nNIST standard FIPS 199 (Standards for Security Categorization of Federal Information and Information Systems) \nKey Security Concepts\n20\nRelated CIA Triad Definitions – from Information Assurance Perspective\nConfidentiality: This term covers two related concepts:\nData confidentiality: Assures that private or confidential information is not made available or disclosed to unauthorized individuals\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nIntegrity: This term covers two related concepts:\nData integrity: Assures that information and programs are changed only in a specified and authorized manner\nSystem integrity: Assures that a system performs its intended function in an unimpaired manner, free from deliberate or inadvertent unauthorized manipulation of the system\nAvailability: Assures that systems work promptly and service is not denied to authorized users\n\n21\nApplication Security vs. Network Security\n22\nApplication Security\n\n\nPreservation of confidentiality, integrity, and availability of application information\nOther properties such as authenticity, accountability, non-repudiation, and reliability can also be involved\nNetwork Security\n\n\nProtection  of networks and their services from unauthorized modification, destruction, or disclosure \n\nProvision of assurance that the network performs its critical function correctly and that there are no harmful side effects\nOther Essential Definitions\nAuthenticity:  The property of being genuine and being able to be verified and trusted; confidence in the validity of a transmission, a message, or message originator\nThis means verifying that users are who they say they are and that each input arriving at the system came from a trusted source\n\nNon-Repudiation: Assurance that the sender of information is provided with proof of delivery and the recipient is provided with proof of the sender’s identity, so neither can later deny having processed the information (e.g., digital signatures that help one to not deny validity)\n\nAccountability:  The security goal that generates the requirement for actions of an entity to be traced uniquely to that entity\nThis supports non-repudiation, deterrence, fault isolation, intrusion detection and prevention, and after-action recovery and legal action\nBecause truly secure systems are not yet an achievable goal, we must be able to trace a security breach to a responsible party\nSystems must keep records of their activities to permit later forensic analysis to trace security breaches or to aid in transaction disputes\n\n23\nSecurity Concepts and Relationships\u000b(from RFC 2828, Internet Security Glossary)\n24\nSecurity Concepts and Relationships\u000b(from RFC 2828, Internet Security Glossary)\n25\nAdversary (threat agent)\nIndividual, group, organization, or government that conducts or has the intent to conduct detrimental activities\u000b\nAttack\nAny kind of malicious activity that attempts to collect, disrupt, deny, degrade, or destroy information system resources or the information itself\n\nCountermeasure\nA device or techniques that has as its objective the impairment of the operational effectiveness of undesirable or adversarial activity\nAims to prevent espionage, sabotage, theft, or unauthorized access to or use of sensitive information or information systems\n\nRisk\nA measure of the extent to which an entity is threatened by a potential circumstance or event, and typically a function of: (i) the adverse impacts that would arise if the circumstance or event occurs; and (ii) the likelihood of occurrence\nSecurity Concepts and Relationships (2)\u000b(from RFC 2828, Internet Security Glossary)\n26\nSecurity Policy\nA set of criteria for the provision of security services; It defines and constrains the activities of a data processing facility in order to maintain a condition of security for systems and data.\n\nSystem Resource (Asset – Hardware, Software, Data, Network)\nA major application, general support system, high impact program, physical plant, mission critical system, personnel, equipment, or a logically related group of systems\n\nThreat\nAny circumstance or event with the potential to adversely impact/harm: organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, or the Nation through an information system – via unauthorized access, destruction, disclosure, modification of information, and/or denial of service\n\nVulnerability\nFlaw or weakness within: an information system, system security procedures, internal controls, or implementation that could be exploited or triggered by a threat source\n\n\nBasically, a threat is a possible danger that might exploit a vulnerability…\nVulnerabilities, Threats and Attacks\n27\nCategories of vulnerabilities\nCorrupted (loss of integrity)\nLeaky (loss of confidentiality)\nUnavailable or very slow (loss of availability)\n\nThreats\nCapable of exploiting vulnerabilities\nRepresent potential security harm to an asset\n\nAttacks (threats carried out)\nPassive – attempt to learn or make use of information from the system that does not affect system resources\nActive – attempt to alter system resources or affect their operation\nInsider – initiated by an entity inside the security parameter\nOutsider – initiated from outside the perimeter\n\n\n\nLevels of Impact\n28\n(i) organization functions are noticeably reduced; (ii) minor damage to assets; (iii) minor financial loss; or (iv) minor harm to individuals\n(i) organization functions are significantly reduced; (ii) significant assets damage; (iii) significant financial loss; or (iv) significant but not life-threatening individuals harm\n(i) organization functions are severely disrupted; (ii) major damage to assets; (iii) catastrophic financial loss; or (iv) individual loss of life or life-threatening injuries\nSome Survey Findings…\nThe chief impediment to implementing cloud services was security, listed by 85% of federal IT managers\nSource: MeriTalk Cloud Computing Exchange\n67% of IT professionals say their organization is very vulnerable because cloud ports and firewalls are not adequately secured\nSource: Ponemon Institute\n“…human factors, is the biggest contributor responsible for 50 to 80 percent of network device outages”\nSource: Juniper Networks Whitepaper\n\n29\nIn-Class Exercise:\u000bHow to Secure Linux OS?\nTo avoid malicious compromise of system resources, following issues need to be addressed:\nUse strong passwords – lock account if multiple login failures\nInstall only the required software packages\nDo you need Apache?\nSetup access lists for services (i.e., host firewall)\nRegularly patch the OS \nCheck listening ports and verify if those are required\nUse “netstat” or even an Intrusion Detection System (IDS) for monitoring\nRun only required system services\nUse “chkconfig” to list all services started at bootup\nAvoid telnet, rlogin and rsh – use scp/sftp instead \nSecure remote access\nSecure NFS if sharing files over network\n\nFor more details - http://www.puschitz.com/SecuringLinux.shtml\n\n30\n31\nOnline Security Resources\nCERT\nwww.cert.org\nMicrosoft Security Response Center \nhttps://www.microsoft.com/en-us/msrc?rtc=1\nF-Secure\nwww.f-secure.com\nSANS\nwww.sans.org \n\n\n\nCertification List\n(One letter grade) Certificate of Cloud Security Knowledge (CCSK) https://cloudsecurityalliance.org/education/ccsk/ \n(Two letter grade) ISC2 Certified Cloud Security Professional (CCSP) https://www.isc2.org/certifications/ccsp \n(One letter grade) ISC2 Certified in Cybersecurity (CC) https://www.isc2.org/certifications/cc \n(Two letter grade) ISC2 Systems Security Certified Practitioner (SSCP) https://www.isc2.org/certifications/sscp \n(Two letter grade) CompTIA Security+  https://www.comptia.org/certifications/security \n\nThreats on Assets\n33\nAn online drive is compromised\nAfter a successful attack (e.g., Sony Hack)\nAn unauthorized copy of software is made - or -\nLicenses are used without permission\nImportance of Cybersecurity for Manufacturers\nManufacturing businesses are increasing online for operations\nWeb, Cloud Computing, Internet-of-Things, Big Data\nManufacturers are unfortunately a frequent target of hackers and attackers\nAccording to a report from the U.S. Department for Homeland Security, manufacturing is the second highest industry with the most reported cyber attacks, only subsequent to the energy sector\nAccording to a report by NTT Security, the manufacturing industry was the most heavily targeted industry during Q2 2017, accounting for 34% of all documented attack activity\nA Kaspersky Lab Survey of IT managers published in Virus News also found that “21 percent of manufacturers suffered a loss of intellectual property (IP) within the past year” \n34\nhttps://www.nist.gov/blogs/manufacturing-innovation-blog/cybersecurity-protecting-manufacturing-technology-and-innovation \nIn-Class Exercise: \u000bCreate a survey for a small-business company\n35\n\nCreate a survey questionnaire that will help a cybersecurity expert to assist a manufacturing/utility enterprise in becoming aware of their current cyber security posture and help them in:\nDefending their company’s vital data and information\nPreventing theft or damage to company infrastructure, equipment and systems\nAvoiding major disruptions to operations and the delivery of products\nProtecting employee’s personal information\nShielding the company from negative publicity\nPlanning IT budgets and policies with adequate cyber incident response\n\nDiscuss potential improvements in cyber attack threat detection and mitigation strategies that result in benefits in terms of: \nincreased productivity, cost savings and reduced risk\nSmall Business Response Exercise\nQ1) Important assets in your enterprise that are networked internally or with an external site\na) Do you use industrial equipment that is connected to the Internet? Yes  /  No\nb) Are there machines connected to computers with industry-standard/paid software licenses? Yes  /  No\nc) Do you store and share business-related data using cloud platforms? Yes  /  No\nd) Do you operate a private data center/server with network equipment? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q1:\n\n36\nAssume you are speaking to a small business enterprise \n- <<Name>>\nSmall Business Response Exercise (2)\nQ2) Potential cyber attack threats and the risks associated with compromise of valuable assets\na) Are you concerned about loss of data confidentiality due to undesired information exposure? Yes  /  No\nb) Are you concerned about data integrity because of data corruption by human/machine? Yes  /  No\nc) Are you concerned of loss of services or infrastructure that makes data inaccessible? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q2:\n\n37\nSmall Business Response Exercise (3)\nQ3) Solutions adopted to address cyber security threats and the risks associated with compromise of valuable assets\na) Do you use commercial or open-source software or network appliances for cyber security? Yes  /  No\nb) Do you manage network firewalls or role-based access control policies? Yes  /  No\nc) Do you have a process to monitor and prevent potential cyber intrusion detection? Yes  /  No\nd) Do you need the cyber security solutions to be compliant for external security audits? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q3:\n\n\n38\nSmall Business Response Exercise (4)\nQ4) Cyber security posture and potential of impact limits your workers day-to-day productivity\na) Do you have a cyber security posture related design document? Yes  /  No\nb) Do you have a budget allocated for cyber security related business cost? Yes  /  No\nc) Are you satisfied with the effort and/or $$ on cyber security? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q4:\n\n\n39\nCybersecurity Challenges\n40\nCybersecurity is not as simple as it might first appear to the novice\nSelf-explanatory one-word labels: confidentiality, authentication, nonrepudiation, and integrity; BUT mechanisms to meet those requirements can be quite complex, and understanding them may involve rather subtle reasoning\n\nIn developing a particular security mechanism or algorithm, one must always consider potential attacks on those security features\nIn many cases, successful attacks are designed by looking at the problem in a completely different way, therefore exploiting an unexpected weakness in the mechanism\n\nProcedures to provide security mechanism are driven by user requirements\nTypically, a security mechanism complexity depends on user requirements; greater the impact of threats, greater is the need for elaborate security mechanisms\n\n\n\n\n\n\nCybersecurity Challenges (2)\n41\nPhysical and logical placement of security mechanisms needs to be determined\nPhysical placement (e.g., at what points in a network are certain security mechanisms needed) \nLogical placement (e.g., at what layer or layers of an architecture such as TCP/IP should mechanisms be placed)\n\nSecurity mechanisms typically involve more than a particular algorithm or protocol and also require that participants be in possession of some secret information which raises questions about the creation, distribution, and protection of that secret information\nThere may also be a reliance on communications protocols whose behavior may complicate the task of developing the security mechanism\nFor example, if the proper functioning of the security mechanism requires setting time limits on the transit time of a message from sender to receiver, then any protocol or network that introduces variable, unpredictable delays may render such time limits meaningless\n\n\n\n\n\n\nCybersecurity Challenges (3)\n42\nAttackers only need to find a single weakness, while the designer must find and eliminate all weaknesses to achieve perfect security\nIt is a battle of wits between a perpetrator who tries to find holes, and the designer or administrator who tries to close them\n\nSecurity is still too often an afterthought to be incorporated into a system after the design is complete, rather than being an integral part of the design process\nThere is a natural tendency on the part of users and system managers to perceive little benefit from security investment until a security failure occurs\nUsers view strong security as an impediment to efficient and user-friendly operation of an information system or use of information\n\nSecurity requires regular and constant monitoring\nWhat to monitor – raw or aggregate, How much to monitor – metrics, How frequent – sampling rates?\n\n\n\n\n\n\n43\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\n44\nPassive and Active Attacks\n\nPassive Attack\nActive Attack\n\nAttempts to learn or make use of information from the system but does not affect system resources\nHard to detect (no alteration)\nEasy to stop\nEavesdropping on, or monitoring of, transmissions\nGoal of attacker is to obtain information that is being transmitted\nTwo types:\nRelease of message contents\nTraffic analysis\n\nAttempts to alter system resources or affect their operation\nHard to stop\nEasy to detect (application impact)\nInvolve some modification of the data stream or the creation of a false stream\nFour categories:\nReplay\nMasquerade\nModification of messages\nDenial of service\nPassive Attack – Interception\u000b(Sniffing)\n45\nPacket sniffing describes the process of capturing live data as they flow across a network\nPassive Attack – Traffic Analysis\u000b(Sniffing)\n46\nObserve traffic pattern\nActive Attack – Interruption\u000b(Spoofing)\n47\nBlock delivery of message\n\nPacket spoofing occurs when critical information in the packet is forged by an attacker\nActive Attack – Fabrication\u000b(Spoofing)\n48\nFabricate message\n\nE.g., TCP session hijacking, DNS cache poisoning\nActive Attack – Replay\u000b(Sniffing + Spoofing)\n49\nActive Attack – Modification\u000b(Sniffing + Spoofing)\n50\n\n\n\nModify message\nTCP/IP Communication (Recall)\n51\nSocket Programming – Sending packets\n52\nTCP – connection-oriented transport protocol (error-free)\nUDP – connectionless transport protocol (for time-sensitive communication)\nPort Number – Route information to particular application process (some numbers are reserved e.g., port 80 for web servers)\nUDP Client Example – sending packets using Python; and use Netcat program to test the server\n\n\n\n\n\n\n\n\n\n\nHow packets are received?\n53\nNIC (Network Interface Card) is a physical or logical link between a machine and a network\n\nEach NIC has a MAC address\n\nEvery NIC on the network will hear all the frames on the wire\n\nNIC checks the destination address for every packet, if the address matches the card’s MAC address, it is further copied into a buffer in the kernel\n\n\n\n\n\n\n\nApplication\nLAN (Layer 2)\nSocket System Calls\nNIC\nUpper layer processing starting with IP\nOS control starts\nSniffing and Spoofing - Related Concepts\n54\nPromiscuous Mode - NIC passes every frame received from the network to the kernel; requires root or other elevated privilege to enable\n\nRaw Sockets – a special type of socket that allows a sniffing program to capture all packets flowing on the network cable, regardless of destination IP address or port number; used to implement spoofing\n\nBSD Packet Filter (BPF) – Unix utility for packet filtering at the lower level; a user space program to attach a filter to a socket; Kernel can be made to discard unwanted packets as early as possible by setting filters at different places along a captured packet’s traverse path\n\npcap API – a packet capture API used to implement sniffing using a platform independent interface – allows portable access to operating system’s packet capture facility; libpcap in Unix (from TCPdump) and WinPcap in Windows\nWireshark tool is popular to capture packets and examine contents (without coding)\n\nScapy – built on top of libpcap; commonly used for productivity (for performance purposes, better to use C); Hybrid Approach also works where Scapy is used to construct packets, and use C to slightly modify packets and then send packets\nUse Scapy for coding packet manipulations: packet parsing, packet sending and receiving, packet sniffing, packet spoofing, adding new protocols, etc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSnort, Mysql\nHoney Pot - Sniffing\nHacker Story -Kevin Mitnick with SDSC  \nAttack Surfaces\n56\nAttack Surface Categories\n57\nAttack Surface Analysis\n58\nAn attack surface analysis is a useful technique for assessing the scale and severity of threats to a system\n\nA systematic analysis of points of vulnerability makes developers and security analysts aware of where security mechanisms are required\nUse Decomposition to document components, applications and their infrastructure  develop data flow diagrams along with privilege boundaries  ensure proper controls are in place for any data crossing boundaries \n\nOnce an attack surface is defined, designers may be able to find ways to make the surface smaller, thus making the task of the adversary more difficult\nIgnore “high-risk, low-reward” cases\n\nThe attack surface also provides guidance on setting priorities for testing, strengthening security measures, or modifying the service or application\nDetermine the layers of security you need based on the threat, don’t forget they impact performance\n\n\n\n\n\n\n\nApplying all possible security tools strengths security at expense of the performance \n59\nThere is need to bridge the gaps in the information management and security/compliance needs, while also maintaining satisfactory application performance…\nBy 2020, $101.6 billion will be spent in cyber security, to build high walls and deep moats\nhttp://fortune.com/2016/10/12/cybersecurity-global-spending/\nAttack Surface and Defense Depth\n60\nAttacks in a Cloud Computing Environment\nThree actors involved; six types of attacks possible\nThe user can be attacked by:\nService  SSL certificate spoofing, attacks on browser caches, or phishing attacks\nThe cloud infrastructure  attacks that either originates at the cloud or spoofs to originate from the cloud infrastructure\nThe service can be attacked by:\n A user  buffer overflow, SQL injection, and privilege escalation are the common types of attacks\nThe cloud infrastructure  the most serious line of attack; Limiting access to resources, privilege-related attacks, data distortion, injecting additional operations\nThe cloud infrastructure can be attacked by:\nA user  targets the cloud control system\nA service  requesting an excessive amount of resources and causing the exhaustion of the resources\n61\nThreat Modeling\n62\nThreat model - a framework which details internal and external vulnerabilities, as well as objectives and countermeasures\n\nFive major threat modeling steps:\n Defining security requirements\n Creating an application diagram \n Identifying threats \n Mitigating threats\n Validating that threats have been mitigated \n\n\nThreat Models\n63\nMicrosoft STRIDE\nhttps://www.microsoft.com/en-us/securityengineering/sdl/threatmodeling\n\n\nFundamental Security Design Principles\n64\nDespite years of research and development, it has not been possible to develop security design and implementation techniques that systematically exclude security flaws and prevent all unauthorized actions\nIn the absence of such foolproof techniques, it is useful to have a set of widely agreed design principles that can guide the development of protection mechanisms [NSA/DHS Proposed]\nSecurity Design Principles\nEconomy of mechanism\nDesign of security measures embodied in both hardware and software should be as simple and small as possible\nThe motivation for this principle is that - small design is easier to test and verify thoroughly; complexity complicates management\nFail-safe defaults\nAccess decisions should be based on permission rather than exclusion\nDefault situation is lack of access, and the protection scheme identifies conditions under which access is permitted\nComplete mediation\nEvery access must be checked against the access control mechanism\nSystems should not rely on access decisions retrieved from a cache\nOpen design\nDesign of a security mechanism should be open rather than secret\nFor example, although encryption keys must be secret, encryption algorithms should be open to public scrutiny\n\n\n\n\n\n65\nSecurity Design Principles (2)\nSeparation of privilege\nA practice in which multiple privilege attributes are required to achieve access to a restricted resource\nE.g., multifactor user authentication, which requires a password and a smart device, to authorize a user\nLeast privilege\nEvery process and every user of the system should operate using the least set of privileges necessary to perform the task\nE.g., use of this principle can be seen in role-based access control\nLeast common mechanism\nDesign should minimize the functions shared by different users, providing mutual security\nThis principle helps reduce the number of unintended communication paths\nPsychological acceptability\nSecurity mechanisms should not interfere unduly with the work of users, while at the same time meeting the needs of those who authorize access\nIf security mechanisms hinder the usability or accessibility of resources, users may opt to turn off those mechanisms\n\n\n\n\n\n66\nSecurity Design Principles (3)\nIsolation\nPublic access systems should be isolated from critical resources (data, processes, etc.) to prevent disclosure or tampering\nIn cases where the sensitivity or criticality of the information is high, limit the number of systems on which that data are stored \nEncapsulation\nA specific form of isolation based on object-oriented functionality\nProtection by encapsulating a collection of procedures and data objects so that they may be called only at designated domain entry points \nModularity\nDevelopment of security functions as separate, protected modules and use of a modular architecture for mechanism design and practice\nLayering\nUse of multiple, overlapping protection approaches addressing the people, technology, and operational aspects of information systems\nLeast astonishment\nA program or user interface should always respond in the way that is least likely to astonish the user\nFor example, the mechanism for authorization should be transparent enough to a user that the user has a good intuitive understanding of the security goals\n\n\n\n\n\n67\nOpen Science is also vulnerable to cyber attacks!\n68\nOpen Science Cyber Risk Profile - http://trustedci.github.io/OSCRP/OSCRP.html \nThreat Model Example – Bioinformatics Workflow\nSoyKB: Distributed Computing\n69\n70\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nClasses of Intruders – Cyber Criminals\n71\nHackers/Crackers: Individuals or members of an organized crime group with a goal of financial reward\nVerizon found that 92% of the breaches they investigated were by outsiders, with 14% by insiders, and with some breaches involving both outsiders and insiders\nInsiders were responsible for a small number of very large dataset compromises\nTheir activities may include: \nIdentity theft\nTheft of financial credentials\nCorporate espionage\nData theft\nData ransoming\nTypically they are young, often Eastern European, Russian, or southeast Asian hackers, who do business on the Web\nThey meet in underground forums (e.g., DarkMarket.org and theftservices.com) to trade tips and data and coordinate attacks\n\n\n\n\n\n\nClasses of Intruders – Activists\n72\nAre either individuals, usually working as insiders, or members of a larger group of outsider attackers, who are motivated by social or political causes\n\nAim of their attacks is often to promote and publicize their cause typically through:\nWebsite defacement\nDenial of service attacks \nTheft and distribution of data that results in negative publicity or compromise of their targets (e.g., Edward Snowden, Chelsea Manning)\n\nAlso know as Hacktivists - Skill level is often quite low sometimes (i.e., script-kiddies) but there are large skilled groups \n\t\t(e.g., Anonymous Group, LulzSec)\n\n\n\n\n\n\n\nExamples of Intrusion\n73\nNIST SP 800-61 (Computer Security Incident Handling Guide) List:\nRemote root compromise\nWeb server defacement\nGuessing/cracking passwords\nCopying databases containing credit card numbers\nViewing sensitive data without authorization\nRunning a packet sniffer\nDistributing pirated software\nUsing an unsecured device to access internal network\nImpersonating an executive to get information\nUsing an unattended workstation\n…\n\n\n\n\n\n\n\nIntruder Behavior\n74\nThe techniques and behavior patterns of intruders are constantly shifting, to exploit newly discovered weaknesses and to evade detection and countermeasures\nE.g., they start with a phishing attack that results in the installation of malware that steals login credentials that eventually results in the compromise of a Point-of-Sale terminal\n\n\n\n\n\nDefinitions\n75\nSecurity Intrusion: \nUnauthorized act of bypassing the security mechanisms of a system\n\nIntrusion Detection: \nA hardware or software function that gathers and analyzes information from various areas within a computer or a network to identify possible security intrusions\n\nIntrusion Detection Systems (IDSs) / Intrusion Prevention Systems (IPSs): \nDesigned to aid countering intrusion threats and are reasonably effective against known, less sophisticated attacks (e.g., large-scale email scams)\nThey may not be effective against the more sophisticated, targeted attacks by some criminal or state-sponsored intruders (e.g., new, zero-day exploits)\nThey are part of a defense-in-depth strategy that may also include encryption of sensitive information, detailed audit trails, strong authentication and authorization controls, and active management of application and network security\n\n\n\n\n\n\nIDS vs IPS\n76\nIntrusion Detection System\n77\nHost-based IDS (HIDS)\nMonitors the characteristics of a single host and its users for suspicious activity\nNetwork-based IDS (NIDS)\nMonitors network traffic and analyzes network, transport, and application protocols to identify suspicious activity\nDistributed or hybrid IDS\nCombines information from a number of sensors, often both host and network based, in a central analyzer and user interface that is able to better identify and respond to intrusion activity\n\nAnalysis Approaches\n78\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nAnomaly detection\nSignature/Heuristic detection\nInvolves the collection of data relating to the behavior of legitimate users over a period of time\nCurrent observed behavior is analyzed to determine whether this behavior is that of a legitimate user or that of an intruder\nCan detect unknown, zero-day attacks, as it starts with known good behavior and identifies anomalies to it – but false alarms are common!\nUses a set of known malicious data patterns or attack rules that are compared with current behavior\nAlso known as misuse detection\nCan only identify known attacks for which it has patterns or rules\nAnomaly Detection Classification Approaches\n79\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nTwo key issues that affect the relative performance of these alternatives are: (i) the efficiency/effectiveness, and (ii) cost of the detection process\nMachine Learning Approaches Proposed for an IDS\n80\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nBayesian networks:  Encode probabilistic relationships among observed metrics\n\nMarkov models:  Develop a model with sets of states, some possibly hidden, interconnected by transition probabilities\n\nNeural networks:  Simulate human brain operation with neurons and synapse between them, that classify observed data\n\nFuzzy logic:  Uses fuzzy set theory where reasoning is approximate, and can accommodate uncertainty\n\nGenetic algorithms:  Uses techniques inspired by evolutionary biology, including inheritance, mutation, selection and recombination, to develop classification rules\n\nClustering and outlier detection:  Group the observed data into clusters based on some similarity or distance measure, and then identify subsequent data as either belonging to a cluster or as an outlier\n\n\n\n\n\nNetwork Security Tools\nWireshark - monitors all information entering and leaving the computer\n\n\nSnort – highly configurable and portable host-based and network-based IDS; detects intrusions into the system and logs them for further examination on servers & networks\nhttp://www.wireshark.org \n\n\n\n\n\nhttp://www.snort.org \n81\n82\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nCyber Crime and Forensic Evidence\n\nCybercrime, is a term used broadly to describe criminal activity in which computers or computer networks are a tool, a target, or a place of criminal activity\n\nForensic Evidence includes anything used in court to prove the validity or falsity of a statement\nCannot be “Hearsay”  (E.g. monitor 1 or 2 days and point fingers at attack sources)\nRoutine monitoring is hence vital\nPromotes custody of regular records of cyber activity\nHas to present information beyond reasonable doubt\n83\nTypes of Cyber Crime\u000b(as per US Department of Justice categorization)\n84\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nIntellectual Property Infringement\n85\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\n\nIntellectual property: Any intangible asset that consists of human knowledge and ideas\nExamples include software, data, novels, sound recordings, the design of a new type of mousetrap, or a cure for a disease\n\nThere are three main types of intellectual property for which legal protection is available:\nCopyrights\nTrademarks\npatents\nCopyright\n86\nMinimum human supervision\nRecover from crashes and reinitializations\n\nProtects tangible or fixed expression of an idea but not the idea itself\n\nCreator can claim and file copyright at a national government copyright office if:\nProposed work is original\nCreator has put original idea in concrete form\n\nPatent\n87\nMinimum human supervision\nRecover from crashes and reinitializations\nGrant a property right to the inventor\u000b\n“The right to exclude others from making, using, offering for sale, or selling” the invention in the United States or “importing” the invention into the United States\nAn example of a patent from the computer security realm is the RSA public-key cryptosystem; from the time it was granted in 1983 until the patent expired in 2000, the patent holder, RSA Security, was entitled to receive a fee for each implementation of RSA\n\nTypes:\nTrademark\n88\nMinimum human supervision\nA word, name, symbol, or device \n\nUsed in trade with goods\n\nIndicates source of goods \n\nDistinguishes them from goods of others\n\nTrademark rights may be used to:\nPrevent others from using a confusingly similar mark\nBut not to prevent others from making the same goods or from selling the same goods or services under a clearly different mark\n\nPrivacy\n89\nMinimum human supervision\nOverlaps with computer security\n\nDramatic increase in scale of information collected and stored\nData-intensive research, Modeling & Simulation, IoT, Social Networks\n\nMotivated by law enforcement, national security, economic incentives\n\nIndividuals have become increasingly aware of access and use of personal information and private details about their lives\n\nConcerns about extent of privacy compromise have led to a variety of legal and technical approaches to reinforcing privacy rights\n\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nPrivacy Protection\n90\nMinimum human supervision\nBoth policy and technical approaches are needed to protect privacy\n\nIn terms of technical approaches, the requirements for privacy protection for data stored on information systems can be addresses in part using the technical mechanisms developed for database security\n\nWith regard to social media sites, technical controls include:\nThe provision of suitable privacy settings to manage who can view data on individuals\nNotification when one individual is referenced or tagged in another’s content\nAlthough social media sites include some form of these controls, they are constantly changing, causing frustration for users who are trying to keep up with these mechanisms\n\nAnother approach for managing privacy concerns in big data analysis is to anonymize the data, removing any personally identifying information before release to researchers or other organizations for analysis\n\nData Privacy\n91\nMinimum human supervision\nIn terms of policy, guidelines are needed to manage the use and reuse of big data, ensuring suitable constraints are imposed in order to preserve privacy:\n\nConsent\nEnsuring participants can make informed decisions about their participation in the research\nPrivacy and confidentiality\nPrivacy is the control that individuals have over who can access their personal information\nConfidentiality is the principle that only authorized persons should have access to information\nOwnership and authorship\nAddresses who has responsibility for the data, and at what point does an individual give up their right to control their personal data\nData sharing – assessing the social benefits of research\nThe social benefits that result from data matching and reuse of data from one source or research project in another\nGovernance and custodianship\nOversight and implementation of the management, organization, access, and preservation of digital data\nEthical Issues\n92\nMinimum human supervision\nEthics: “A system of moral principles that relates to the benefits and harms of particular actions, and to the rightness and wrongness of motives and ends of those actions”\n\nMany potential misuses and abuses of information and electronic communication that create privacy and security problems\n\nBasic ethical principles developed by civilizations apply\n\nUnique considerations surrounding computers and information systems\n\nScale of activities not possible before\n\nCreation of new types of entities for which no agreed ethical rules have previously been formed\n\nEthical Hacking\n93\nMinimum human supervision\n\nEthical hackers learn and perform hacking in a professional manner, based on the direction of the client, and later, present a maturity scorecard highlighting their overall risk and vulnerabilities and suggestions to improve\n\nNew worms, malware, viruses, and ransomware are multiplying every day and creating a need for ethical hacking services to safeguard the networks of businesses, government agencies or defense\n\nAn Ethical Hacker answers the following questions:\nWhat kind of vulnerabilities does an attacker see?\nWhat information or system would a hacker most want access?\nWhat can an attacker do with the information?\nHow many people notice the attempted hack?\nWhat is the best way to fix the vulnerability?\n\nhttps://www.eccouncil.org/ethical-hacking/\n"
}