{
  "filename": "Module 3 - Defense Architectures and Design - Part 4.pptx",
  "text": "CEN 3078 Computer Security\nModule 3 – Defense Architectures and Design\n\n2\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\n3\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\nAccess Control\n4\nProcess by which use of system resources is regulated according to a security policy and is permitted only by authorized entities (users, programs, processes, or other systems) according to that policy\n\n\n\n\n\nAccess Control Security Requirements\n5\nAccess Control Policies\n6\nDiscretionary access control (DAC)\nControls access based on the identity of the requestor and on access rules (authorizations) stating what requestors are (or are not) allowed to do\n\nMandatory access control (MAC)\nControls access based on comparing security labels with security clearances \nAn entity that has clearance to access a resource may not, just by its own volition, enable another entity to access that resource\nRole-based access control (RBAC)\nControls access based on the roles that users have within the system and on rules stating what accesses are allowed to users in given roles\n\nAttribute-based access control (ABAC)\nControls access based on attributes of the user, the resource to be accessed, and current environmental conditions\n\nThese four policies are not mutually exclusive; an access control mechanism can employ two or even all three of these policies to cover different classes of system resources\nSubjects, Objects, and Access Rights\n7\nDiscretionary Access Control (DAC) \n8\n\n\n\n\n\n\nScheme in which an entity may be granted access rights that permit the entity, by its own violation, to enable another entity to access some resource\n\nOften provided using an access matrix\nOne dimension consists of identified subjects that may attempt data access to the resources\nThe other dimension lists the objects that may be accessed\n\nEach entry in the matrix indicates the access rights of a particular subject for a particular object\n\n\n\n\n\n\n\nAccess Control Structures Example\n9\n\n\n\n\n\n\nAccess Matrix\nUser A owns files 1 and 3 and has read and write access rights to those\nfiles. User B has read access rights to file 1, and so on.\nAccess Control Lists\n10\n\n\n\n\n\n\nThe access matrix may be decomposed by columns, yielding access control lists (ACLs)\nFor each object, an ACL lists users and their permitted access rights. The ACL may contain a default, or public, entry. This allows users that are not explicitly listed as having special rights to have a default set of rights. The default set of rights should always follow the rule of least privilege or read-only access, whichever is applicable. Elements of the list may include individual users as well as groups of users.\nExtended Access Control Matrix\n11\n\n\n\n\n\nTo represent the protection state, we extend the universe of objects in the access control matrix to include the following:\nProcesses:  Access rights include the ability to delete a process, stop (block), and wake up a process\nDevices:  Access rights include the ability to read/write the device, to control its operation (e.g., a disk seek), and to block/unblock the device for use\nMemory locations or regions:  Access rights include the ability to read/write certain regions of memory that are protected such that the default is to disallow access\nSubjects: Access rights with respect to a subject have to do with the ability to grantor delete access rights of that subject to other objects, as explained subsequently\nRole-Based Access Control\n12\n\n\n\n\n\nTraditional DAC systems define the access rights of individual users and groups of users\n\nIn contrast, RBAC is based on the roles that users assume in a system rather than the user’s identity\nTypically, RBAC models define a role as a job function within an organization\nRBAC systems assign access rights to roles instead of individual users\nIn turn, users are assigned to different roles, either statically or dynamically, according to their responsibilities\n\nUsers, Roles and Resources\nAccess Control Matrix in RBAC\n13\n\n\n\n\n\nRBAC Models\n14\n\n\n\n\n\nBest Practice: Auth0\nAttribute-Based Access Control\n15\n\n\n\n\n\nABAC Model Attributes\n16\n\n\n\n\n\nABAC Scenario\n17\n\n\n\n\n\nIt is clear from the logical architecture that there are four independent sources of information used for the access control decision. The system designer can decide which attributes are important for access control with respect to subjects, objects, and environmental conditions. The system designer or other authority can then define access control policies, in the form of rules, for any desired combination of attributes of subject, object, and environmental conditions.\nABAC Distinguishable Characteristics\n18\n\n\n\n\n\nApply ABAC if\nYou’re in a large organization with many users\nYou want deep, specific access control capabilities\nYou have time to invest in a model that goes the distance\nYou need to ensure privacy and security compliance\nEnterprise-wide Access Control \n19\n\n\n\n\n\n20\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\nIdentity Federation\n21\n\n\n\n\n\nTerm used to describe the technology, standards, policies, and processes that allow an organization to trust digital identities, identity attributes, and credentials created and issued by another organization\n\nAddresses two questions:\nHow do you trust identities of individuals from external organizations who need access to your systems\nHow do you vouch for identities of individuals in your organization when they need to collaborate with external organizations\n\n\n\n\n\n\n\n\nIdentity Information Exchange Approaches\n22\n\n\n\n\n\nOAuth 2.0 Intro.\nOAuth 2 is an authorization framework that enables applications — such as Facebook, GitHub, and DigitalOcean — to obtain limited access to user accounts on an HTTP service. \nIt works by delegating user authentication to the service that hosts a user account and authorizing third-party applications to access that user account. \nOAuth 2 provides authorization flows for web and desktop applications, as well as mobile devices.\nOAuth Roles\nOAuth defines four roles:\nResource Owner: The resource owner is the user who authorizes an application to access their account. The application’s access to the user’s account is limited to the scope of the authorization granted (e.g. read or write access)\nClient: The client is the application that wants to access the user’s account. Before it may do so, it must be authorized by the user, and the authorization must be validated by the API.\nResource Server: The resource server hosts the protected user accounts.\nAuthorization Server: The authorization server verifies the identity of the user then issues access tokens to the application.\n\nOAuth Steps\nOAuth service steps\nApplication Registration\nApplication Name\nApplication Website\nRedirect URI or Callback URL\nAuthorization Grant – Various Types\nAuthorization Code: used with server-side Applications\nClient Credentials: used with Applications that have API access\nDevice Code: used for devices that lack browsers or have input limitations\n\nMost used Grant Type: Authorization Code\n28\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\nLightweight and Flexible Security for IoT-based Smart City Applications\nRecreated disaster scenes of tornado damages (in Joplin, MO 2011) at the: (a) Joplin High School; (b) Joplin Hospital\n29\nLightweight and Flexible Security for IoT-based Smart City Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\nB. Mukherjee, S. Wang, W. Lu, R. Neupane, D. Dunn, Y. Ren, Q. Su, P. Calyam, “Flexible IoT Security Middleware for End-to-End Cloud-Fog Communication”, Elsevier Future Generation Computer Systems (FGCS) – Special Issue on Internet of Things (IoT): Operating System, Applications and Protocols Design, and Validation Techniques, 2018.\n30\nResource-aware IoT Security Middleware for\u000bEnd-to-End Cloud-Fog Communication\n31\nGateway-hosted middleware stores and tracks sessions, certificates or keys between the fog and cloud entities\nDecouples services and protocols for end-to-end security using static pre-shared keys for quick encryption setup\nSelection of security protocols to be used based on resource-awareness\n"
}