{
  "filename": "Module 2 - Application and Network Attacks - full.pptx",
  "text": "CEN 3078 Computer Security\nModule 2 – Application and Network Attacks\n\n\n2\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \n3\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nTCP Protocol\n4\nTransmission Control Protocol (TCP) is a core protocol of the Internet protocol suite\nSits on the top of the IP layer; transport layer\nProvide host-to-host communication services for applications\nTwo transport Layer protocols\nTCP: provides a reliable and ordered communication channel between applications\nUDP: lightweight protocol with lower overhead and can be used for applications that do not require reliability or communication order \nTCP Client Program \n5\nTCP Server Program\nStep 1 : Create a socket. Same as Client Program.\n\nStep 2 : Bind to a port number. An application that communicates with others over the network needs to register a port number on its host computer. When the packet arrives, the operating system knows which application is the receiver based on the port number. The server needs to tell the OS which port it is using. This is done via the bind() system call\n6\nTCP Server Program\nStep 3 : Listen for connections. \nAfter the socket is  set up, TCP programs call listen() to wait for connections\nIt tells the system that it is ready to receive connection requests. \nOnce a connection request is received, the operating system will go through the 3-way handshake to establish the connection \nThe established connection is placed in the queue, waiting for the application to take it. The second argument gives the number of connection that can be stored in the queue\n\n7\nTCP Server Program\nStep 4 : Accept a connection request\nAfter the connection is established, an application needs to “accept” the connection before being able to access it. The accept() system call extracts the first connection request from the queue, creates a new socket, and returns the file descriptor referring to the socket\n\nStep 5 : Send and Receive data\nOnce a connection is established and accepted, both sides can send and receive data using this new socket\n\n\n\n8\nTCP Server Program\nfork() system call creates a new process by duplicating the calling process \nOn success, the process ID of the child process is returned in the parent process and 0 in the child process\nLine ① and Line ② executes child and parent process respectively\nTo accept multiple connections :\n9\nWhile loop is a connection queue – waits if there are no connections, and then if they arrive, they are processed one by one\nData Transmission\nOnce a connection is established, OS allocates two buffers at each end, one for sending data (send buffer) and receiving buffer (receive buffer)\n\nWhen an application needs to send data out, it places data into the TCP send buffer\n\n10\nTiming of ~200ms is used to fill the send buffer – max size of a packet you can send to Layer 2\nData Transmission\nEach octet in the send buffer has a sequence number field in the header which indicates the sequence of the packets\nAt the receiver end, these sequence numbers are used to place data in the right position inside receive buffer\n\nOnce data is placed in the receive buffer, they are merged into a single data stream\n\nApplications read from the receive buffer - If no data is available, it typically gets blocked; It gets unblocked when there is enough data to read\n\nThe receiver informs the sender about receiving of data using acknowledgement packets\n\n11\nTCP Header\nTCP Segment: TCP Header + Data. \n\nSource and Destination port (16 bits each): Specify port numbers of the sender and the receiver.\n\nSequence number (32 bits) : Specifies the sequence number of the first octet in the TCP segment. If SYN bit is set, it is the initial sequence number.\nAcknowledgement number (32 bits): Contains the value of the next sequence number expected by the sender of this segment. Valid only if ACK bit is set.\n12\nTCP Header\nHeader length (4 bits): Length of TCP header is measured by the number of 32-bit words in the header, so we multiply by 4 to get number of octets in the header.\nReserved (6 bits): This field is not used.\nCode bits (6 bits): There are six code bits, including SYN,FIN,ACK,RST,PSH and URG.\nWindow (16 bits): Window advertisement to specify the number of octets that the sender of this TCP segment is willing to accept. The purpose of this field is for flow control.\nChecksum (16 bits): The checksum is calculated using part of IP header, TCP header and TCP data.\nUrgent Pointer (16 bits): If the URG code bit is set, the first part of the data contains urgent data (do not consume sequence numbers). The urgent pointer specifies where the urgent data ends and the normal TCP data starts. Urgent data is for priority purposes as they do not wait in line in the receive buffer, and will be delivered to the applications immediately.\nOptions (0-320 bits, divisible by 32): TCP segments can carry a variable length of options which provide a way to deal with the limitations of the original header.\n13\n14\nAt the heart of TCP is the sliding window algorithm, but it needs to address:\nConnections from many different hosts with - different RTT, different capacity at destination, long delays in network that affects order, different network capacity (i.e., congestion) \nFlow control: keep sender from overrunning receiver\nCongestion control: keep sender from overrunning network\nMaintaining Order & Reliability\n15\nFlow and Congestion Control\nBased on flow condition, Window size is changed\nSender capacity (buffer limitation) or Network congestion (packet drop)\n\nSliding window + flow control\nSequenceNum, Acknowledgment, AdvertisedWindow\nSequenceNum: sequence # of the first byte\nReceiver sends AdvertisedWindow based on available capacity\n\nWindow size is less than or equal to the minimum of AdvertisedWindow and CongestionWindow\n\nTCP 3-way Handshake Protocol\nSYN Packet: \nThe client sends a special packet called SYN packet to the server using a randomly generated number x as its sequence number\n\nSYN-ACK Packet:\nOn receiving it, the server sends a reply packet using its own randomly generated number y as its sequence number\n\nACK Packet\nClient sends out ACK packet to conclude the handshake\n16\nKernel establishes send and receive buffer on both sides\nTCP 3-way Handshake Protocol\nWhen the server receives the initial SYN packet, it uses TCB (Transmission Control Block) to store the information about the connection\nThis is called half-open connection as only client-server connection is confirmed\nThe server stores the TCB in a queue that is only for the half-open connection\nAfter the server gets ACK packet, it will take this TCB out of the queue and store in a different place\nIf ACK doesn’t arrive, the server will resend SYN+ACK packet; The TCB will eventually be discarded after a certain time period\n17\nTCP 3-way Handshake Protocol\nSYN Packet: \nThe client sends a special packet called SYN packet to the server using a randomly generated number x as its sequence number\n\nSYN-ACK Packet:\nOn receiving it, the server sends a reply packet using its own randomly generated number y as its sequence number\n\nACK Packet\nClient sends out ACK packet to conclude the handshake\n18\nKernel establishes send and receive buffer on both sides\nTCP 3-way Handshake Protocol\nWhen the server receives the initial SYN packet, it uses TCB (Transmission Control Block) to store the information about the connection\nThis is called half-open connection as only client-server connection is confirmed\nThe server stores the TCB in a queue that is only for the half-open connection\nAfter the server gets ACK packet, it will take this TCB out of the queue and store in a different place\nIf ACK doesn’t arrive, the server will resend SYN+ACK packet; The TCB will eventually be discarded after a certain time period\n19\n20\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \n21\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\n22\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nSYN Flooding Attack\nIdea : To fill the queue storing the half-open connections so that there will be no space to store TCB for any new half-open connection, basically the server cannot accept any new SYN packets.\n\nSteps to achieve this : Continuously send a lot of SYN packets to the server. This consumes the space in the queue by inserting the TCB record\nDo not finish the 3rd step of handshake as it will dequeue the TCB record\nWhen flooding the server with SYN packets, attackers use random source IP addresses; otherwise the attacks may be blocked by the firewalls…\n23\nLaunching SYN Flooding Attack \u000b– Before Attacking\nTCP States\nLISTEN: waiting for TCP connection.\nESTABLISHED: completed 3-way handshake\nSYN_RECV: half-open connections\n\nCheck the TCP states\n24\nSYN Flooding Attack – Launch the Attack\nTurn off the SYN Cookie countermeasure:\n   $sudo sysctl -w net.ipv4.tcp_syncookies=0\nLaunch the attack using netwox\nResult\nTargeting telnet server port 23 with SYN packets\n25\nNOTE: In your SEED Lab-2, you will use Scapy for launching a SYN Flooding attack\nNote ssh at server port 22 will still work, but not telnet\nSYN Flooding Attack - Results\nUsing netstat command, we can see that there are a large number of half-open connections on port 23 with random source IPs\nUsing top command, we can see that CPU usage is not high on the server machine. The server is alive and can perform other functions normally, but cannot accept telnet connections only\n\n\n\n26\nCountermeasures: SYN Cookies\nAfter a server receives a SYN packet, it calculates a keyed hash (H) from the information in the packet using a secret key that is only known to the server\nThis hash (H) is sent to the client as the initial sequence number from the server. H is called SYN cookie\nThe server will not store the half-open connection in its queue when SYN Cookie kicks-in after a certain number of SYN packets are received; instead information is put in the packet to see if it is a real connection to get information back\nIf the client is an attacker, H will not reach the attacker\nIf the client is not an attacker, it sends H+1 in the acknowledgement field\nThe server checks if the number in the acknowledgement field is valid or not by recalculating the cookie\n27\n28\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Reset Attack\nTo disconnect a TCP connection gracefully :\n\nA sends out a “FIN” packet to B\nB replies with an “ACK” packet. This closes the A-to-B communication\nNow, B sends a “FIN” packet to A and A replies with “ACK”\n\nUsing Reset flag (another way to terminate connection between A & B in abnormal/urgent situations) :\n\nOne of the parties sends RST packet to immediately break the connection\n29\nTCP Reset Attack\nGoal: To break up a TCP connection between A and B\n\nSpoofed RST Packet: The following fields need to be set correctly:\nSource IP address, Source Port, Destination IP address, Destination Port (i.e., 4-Tuple to identify a TCP connection) \nSequence number (within the receiver’s window)\n30\nFun fact: This tampering technique can be used by a firewall or abused by a malicious attacker to interrupt Internet connections.\nThe Great Firewall of China, and Iranian Internet censors are known to use TCP reset attacks to interfere with and block connections as a major method to carry out Internet censorship.\n31\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nMaintaining user/server state: cookies\nRecall:  HTTP GET/response interaction is stateless\nno notion of multi-step exchanges of HTTP messages to complete a Web “transaction” \nno need for client/server to track “state” of multi-step exchange\nall HTTP requests are independent of each other\nno need for client/server to “recover” from a partially-completed-but-never-completely-completed transaction\na stateful protocol: client makes two changes to X, or none at all\n\n\ntime\ntime\n\nX\nt’\nQ: what happens if network connection or client crashes at t’ ?\nApplication Layer: 2-32\nMaintaining user/server state: cookies\nWeb sites and client browser  use cookies to maintain some state between transactions\nfour components:\n1) cookie header line of HTTP response message\n2) cookie header line in next HTTP request message\n3) cookie file kept on user’s host, managed by user’s browser\n4) back-end database at Web site\nExample:\nSusan uses browser on laptop, visits specific e-commerce site for first time\nwhen initial HTTP requests arrives at site, site creates: \nunique ID (aka “cookie”)\nentry in backend database for ID\nsubsequent HTTP requests from Susan to this site will contain cookie ID value, allowing site to “identify” Susan\nApplication Layer: 2-33\nMaintaining user/server state: cookies\nclient\nAmazon server\ncookie file\none week later:\nbackend\ndatabase\n\n\ntime\n\ntime\nApplication Layer: 2-34\nHTTP cookies: comments\nWhat cookies can be used for:\nauthorization\nshopping carts\nrecommendations\nuser session state (Web e-mail)\ncookies and privacy:\ncookies permit sites to learn a lot about you on their site.\nthird party persistent cookies (tracking cookies) allow common identity (cookie value) to be tracked across multiple web sites\naside\nChallenge: How to keep state?\nat protocol endpoints: maintain state at sender/receiver over multiple transactions\nin messages: cookies in HTTP messages carry state\nApplication Layer: 2-35\nExample:  displaying a NY Times web page\nnytimes.com\nAdX.com\nNY times page with embedded ad displayed\nnytimes.com (sports)\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nCookies: tracking a user’s browsing behavior\nCookies: tracking a user’s browsing behavior\nnytimes.com\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nsocks.com\n7493: socks.com, 2/16/22\n\nAdX:\ntracks my web browsing over sites with AdX ads\ncan return targeted ads based on browsing history\nCookies: tracking a user’s browsing behavior (one day later)\nnytimes.com (arts)\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nsocks.com\n7493: socks.com, 2/16/22\n\n\n1634: arts, 2/17/22\n7493: NY Times arts, 2/15/22\nReturned ad for socks!\n GDPR (EU General Data Protection Regulation) and cookies\n“Natural persons may be associated with online identifiers […] such as internet protocol addresses, cookie identifiers or other identifiers […].\nThis may leave traces which, in particular when combined with unique identifiers and other information received by the servers, may be used to create profiles of the natural persons and identify them.”\n\n\nGDPR, recital 30 (May 2018)\n41\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Session Hijacking Attack\nGoal: To inject data in an established connection.\n(This is different from the DoS attack in TCP SYN Flooding or Reset)\n\nSpoofed TCP Packet: The following fields need to be set correctly:\nSource IP address, Source Port, \nDestination IP address, Destination Port\nSequence number (within the receiver’s window)\n\n\n42\nTCP Session Hijacking Attack Examples\nZoom bombing\nDuring the Covid-19 pandemic, the world turned to video conferencing apps like Zoom. These apps became a popular target of session hijackers, even earning the nickname ‘zoom bombing’. There were news reports of session hijackers joining private video sessions, in some cases shouting profanities, hateful language and sharing pornographic images. In response, Zoom introduced greater privacy protections to minimize the risk.\nSlack\nIn 2019, a researcher on a bug bounty platform identified a vulnerability in Slack which allowed attackers to force users into fake session redirects so they could steal their session cookies. This gave attackers access to any data shared within Slack (which for many organizations, can be significant). Slack was quick to respond and patched the vulnerability within 24 hours of the researcher highlighting it.\n\n43\nDefending Against Session Hijacking\nMaking it difficult for attackers to spoof packets\nRandomize source port number\nRandomize initial sequence number \n\nNote: Randomization is NOT effective against local attacks that can sniff packets and determine this information \n\nEncrypting payload\n44\n45\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nDenial-of-Service (DoS) Attack\n46\nA denial of service (DoS) is an action that prevents or impairs the authorized use of networks, systems, or applications by exhausting resources such as central processing units (CPU), memory, bandwidth, and disk space\nA form of attack on the availability of a service; focus is generally on network services that are attacked over their network connection\n\nDoS Attack - Facts\nOne of the most common types of attacks\nAims to prevent users from accessing system\nRequires a minimum of technical skill\nEffective because computers and other systems have physical limitations\nNumber of simultaneous users\nSize of files\nSpeed of data transmission\nAmount of data stored\n\n47\nCommon Tools Used for DoS Attacks\n48\nLow Orbit Ion Cannon (LOIC)\nCommon Tools Used for DoS Attacks\n49\nHigh Orbit Ion Cannon (HOIC)\nDenial-of-Service (DoS) Attack Categories\n50\nClassic DoS Attacks\nFlooding ping command\nAim of this attack is to overwhelm the capacity of the network connection to the target organization\nTraffic can be handled by higher capacity links on the path, but packets are discarded as capacity decreases\nSource of the attack is clearly identified (e.g., in ICMP echo request) unless a spoofed address is used - attacker might use a large company’s Web server to target a medium-sized company with a lower-capacity network connection\nNetwork performance is noticeably affected\nDefense: Load balancers, firewalls\n\n\n51\nFlooding Attacks\nClassified based on network protocol used\nIntent is to overload the network capacity on some link to a server\nVirtually any type of network packet can be used\n\n\n\n52\nDistributed DoS (DDoS) Attacks\nUse of multiple systems to generate flooding attacks\nAttacker uses a flaw in operating system or in a common application to gain access and installs their zombie program on it \nLarge collections of such systems under the control of one attacker’s control can be created, forming a botnet\n\n\n53\nHypertext Transfer Protocol (HTTP) Based Attacks\n54\nHTTP flood attack\nAttack that bombards Web servers with HTTP requests\nConsumes considerable resources\nSpidering - Bots start from a given HTTP link and follow all links on the provided Web site in a recursive way \nSlowloris attack\nAttempts to monopolize a server’s multi-threading by sending HTTP requests that never complete\nEventually consumes Web server’s connection capacity\nUtilizes legitimate HTTP traffic\nExisting intrusion detection and prevention solutions that rely on signatures to detect attacks will generally not recognize Slowloris\nRate limiting number of host connections can help defend or delayed binding can be done by a load balancer to ensure web server or proxy will not see incomplete requests\n\n\n\n\nDNS Reflection Attack\nReflector attack establishes a self-contained loop between the intermediary and the target system; Both systems act as reflectors\nMost reflector attacks can be prevented through network-based and host-based firewall rulesets that reject suspicious combinations of source and destination ports\n\n\n55\nNormal DNS Operation\nDNS Operation under Attack\nThe DNS client sends a query from its UDP port 1792 to the server’s DNS port 53 to obtain the IP address of a domain name. The DNS server sends a UDP response packet including the IP address. \nThe attacker sends a query to the DNS server with a spoofed IP source address of j.k.l.m; this is the IP address of the target. The attacker uses port 7, which is usually associated with echo, a reflector service. The DNS server then sends a response to the victim of the attack, j.k.l.m, addressed to port 7. If the victim is offering the echo service, it may create a packet that echoes the received data back to the DNS server. This can cause a loop between the DNS server and the victim.\nAmplification Attacks\n56\nThey are a variant of reflector attacks and also involve sending a packet with a spoofed source address for the target system to intermediaries\nThey differ in generating multiple response packets for each original packet sent; this can be achieved by directing the original request to the broadcast address for some network; as a result, all hosts on that network can potentially respond to the request, generating a flood of responses to a victim (spoofed) IP address\nIt is only necessary to use a service handled by large numbers of hosts on the intermediate network; the well-known Smurf DoS program used ping flood mechanism using ICMP echo request packets\nThe best additional defense against this form of attack is to not allow directed broadcasts to be routed into a network from outside\n\n\nAmplification Attacks cont.\n57\nSmurf Attack\nDNS Amplification Attack\n58\nUse packets directed at a legitimate DNS server as the intermediary system\n\nAttacker creates a series of DNS requests containing the spoofed source address of the target system\n\nExploit DNS behavior to convert a small request to a much larger response (amplification)\n\nTarget is flooded with responses\n\nBasic defense against this attack is to prevent the use of spoofed source addresses\n\n\n\n\n\nAnother way to category DDoS\nVolume Based Attacks\u000bIncludes UDP floods, ICMP floods, and other spoofed-packet floods. The attack’s goal is to saturate the bandwidth of the attacked site, and magnitude is measured in bits per second (Bps).\nProtocol Attacks \u000bIncludes SYN floods, fragmented packet attacks, Ping of Death, Smurf DDoS, and more. This type of attack consumes actual server resources, or those of intermediate communication equipment, such as firewalls and load balancers, and is measured in packets per second (Pps).\nApplication Layer Attacks \u000bIncludes HTTP Based Attacks, attacks that target Apache, Windows, or OpenBSD vulnerabilities, and more. Comprised of seemingly legitimate and innocent requests, these attacks aim to crash the web server, and the magnitude is measured in Requests per second (Rps).\n\n59\nReal-World Examples of DoS Attacks\nGoogle Attack\nAWS (Amazon Web Services) Attack\nBoston Globe Attack\nMemcache Attacks\nMirai\n\n60\nFour lines of DDoS Attack Defense\n61\nDDoS Attack Prevention\n62\nBlock spoofed source addresses\nOn routers as close to source as possible\nFilters may be used to ensure path back to the claimed source address is the one being used by the current packet\nFilters must be applied to traffic before it leaves the ISP’s network or at the point of entry to their network\nUse modified TCP connection handling code\nCryptographically encode critical information in a cookie that is sent as the server’s initial sequence number\nLegitimate client responds with an ACK packet containing the incremented sequence number cookie\nDrop an entry for an incomplete connection from the TCP connections table when it overflows\n\n\n\n\n\n\nDDoS Attack Prevention (2)\n63\nBlock IP directed broadcasts\n\nBlock suspicious services and combinations\n\nManage application attacks with a form of graphical puzzle (captcha) to distinguish legitimate human requests\n\nGood general system security practices\n\nUse mirrored and replicated servers when high-performance and reliability is required\n\n\n\n\n\nResponding to DoS Attacks\n64\nAntispoofing, directed broadcast, and rate limiting filters should have been implemented \n\nIdeally have network monitors and IDS to detect and notify abnormal traffic patterns\n\n\n\n\n\n\n\nResponding to DoS Attacks\n65\nIdentify type of attack\nCapture and analyze packets \nDesign filters to block attack traffic upstream\nOr identify and correct system/application bug\nHave ISP trace packet flow back to source\nMay be difficult and time consuming\nNecessary if planning legal action\nImplement contingency plan\nSwitch to alternate backup servers\nCommission new servers at a new site with new addresses\nUpdate incident response plan\nAnalyze the attack and the response for future handling\n\n\n\n\n\nMoving Target Defense\n66\nMoving target defense (MTD) is the concept of controlling change across multiple systems by moving around VMs hosting services \nMTD focuses on enabling safe operation in a compromised environment, rather than trying to create a perfectly secure environment\n\n\n\n\n\n\n\nMTD System Model\nMalicious and regular users accessing the services hosted by a target VM\nAuthentication server to direct users to entitled services in VMs\nOpen flow controller to detect attack, run MTD logic, and perform migration\nOnly regular users redirected to new VM\n\n67\nMTD Controller Architecture\n68\nThree Big Questions\nWhere to move?\nFinding the optimal candidate VM to migrate\nIdentifying the most pertinent VM selection factors and their relative importance to create migration logic\nPeriodic/on-demand information collection\nWhen to move?\nFinding the optimal frequency of movement\nNot too frequent as migration incurs cost, and not too seldom as increases probability of getting attacked\nHow to move?\nMostly pertains to implementation issues\nProactive/reactive migration execution\nRuntime migration or file copy\nRedirection of regular users\n69\nHow to Defend Against DoS Attacks – On your own?\nIn addition to previously mentioned methods…\nConfigure your firewall to \nFilter out incoming ICMP packets\nDisallow any incoming traffic\nUse tools such as NetStat and others\nDisallow traffic not originating within the network\nDisable all IP broadcasts\nFilter for external and internal IP addresses\nKeep AV signatures, OS, and software patches current\nHave an Acceptable Use Policy\n\n\n\nSummary\nDoS attacks are among the most common attacks on the Internet\nDoS attacks are unsophisticated\nDoS attacks can have devastating effects\nYour task is constant vigilance and protection strategy\n\n72\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nInteracting with Database in Web Application\nA typical web application consists of three major components:\n\n\n\n\n\n\n\n\n\n\nSQL (Structured Query Language) Injection attacks can cause damage to the database\nAs we notice in the figure, the users do not directly interact with the database but through a web server; If this channel is not implemented properly, malicious users can attack the database\n\n73\nGetting Data from User\nThis example shows a form where users can type their data; Once the submit button is clicked, an HTTP request will be sent out with the data attached\n\n\n\nThe HTML source of the above form is given below: \n\n\n\n\nRequest generated is:\n\n\n\n\n\n\n\n\n74\nGetting Data from User\nThe request shown is an HTTP GET request, because the method field in the HTML code specified the get type\nIn GET requests, parameters are attached after the question mark in the URL\nEach parameter has a name=value pair and are separated by “&”\nIn the case of HTTPS, the format would be similar but the data will be encrypted\nOnce this request reached the target PHP script the parameters inside the HTTP request will be saved to an array $_GET or $_POST; The following example shows a PHP script getting data from a GET request:\n\n\n\n\n\n\n\n\n\n\n\n75\nHow Web Applications Interact with Database\nConnecting to MySQL Database\nPHP program connects to the database server before conducting query on database \nCode shown below uses new mysqli(…) along with its 4 arguments to create the database connection\n\n\n\n\n\n\n\n\n\n\n76\nMySQLi extension allows PHP programs to access the functionality provided by MySQL 4.1 and above\nHow Web Applications Interact with a Database?\nConstruct the query string and then send it to the database for execution\nData typed in form, eventually become part of the SQL string executed by database\nThe channel between user and database creates a new attack surface for the database – this channel needs protection\n\n\n\n\n\n\n\n\n\n\n77\nLaunching SQL Injection Attacks\nEverything provided by user will become part of the SQL statement (user data is mixed with web application code and given to the database); Is it possible for a user to change the meaning of the SQL statement?\nThe intention of the web app developer by the following is for the user to provide some data for the blank areas:\n\n\n\n\nAssume that a user inputs a random string in the password entry and types “EID5002’#” in the eid entry; The SQL statement will become the following: \n78\nUser is taking help of some special characters (e.g., # which will comment remainder of query i.e., the password check) to change the meaning of the SQL statement\nLaunching SQL Injection Attacks\nEverything from the # sign to the end of line is considered as comment; The SQL statement will be equivalent to the following:\n\n\n\nThe above statement will return the name, salary and SSN of the employee whose EID is EID5002 even though the user doesn’t know the employee’s password; This is a security breach\nLet’s see if a user can get all the records from the database assuming that we don’t know all the EID’s in the database\nWe need to create a predicate for WHERE clause so that it is true for all records (i.e., ‘a’ is dummy that would not have any match, BUT we can add a true condition like “OR 1 =1” to match all the records)\n79\nLaunching SQL Injection Attacks using cURL\n\nMore convenient to use a command-line tool to launch attacks\nEasier to automate attacks without a graphic user interface\nUsing cURL, we can send out a form from a command-line, instead of from a web page as follows:\n\n\nThe above command will not work; In an HTTP request, special characters are in the attached data needs to be encoded (with %20) or they maybe mis-interpreted\nIn the above URL we need to encode the apostrophe, whitespace and the # sign and the resulting cURL command is as shown below:\n\n80\nModify Database\n\n\nConsider the form created for changing passwords; It asks users to fill in three pieces of information, EID, old password and new password\n\nWhen Submit button is clicked, an HTTP POST request will be sent to the server-side script changepasswd.php, which uses an UPDATE statement to change the user’s password\n\n81\nIf the statement is UPDATE or INSERT INTO, we will have chance to change the database\nModify Database\n\nLet us assume that Alice (EID5000) is not satisfied with the salary she gets; She would like to increase her own salary using the SQL injection vulnerability; She would type her own EID and old password. The following will be typed into the “New Password” box:\n\n\nBy typing the above string in “New Password” box, we get the UPDATE statement to SET one more attribute for us, the salary attribute; The SQL statement will now look as follows:\n\n\n\nWhat if Alice doesn’t like Bob and would like to reduce Bob’s salary to 0, but she only knows Bob’s EID (eid5001), not his password; How can she execute the attack?\n82\nDue to SQL injection vulnerability, attackers can change other attributes (e.g., salary)\nMultiple SQL Statements\n\nDamages that can be caused are bounded because we cannot change everything in the existing SQL statement\nIt will be more dangerous if we can cause the database to execute an arbitrary SQL statement\nTo append a new SQL statement “DROP DATABASE dbtest” to the existing SQL statement to delete the entire dbtest database, we can type the following in the EID box\n\nThe resulting SQL statement is equivalent to the following, where we have successfully appended a new SQL statement to the existing SQL statement string\n\n\nThe above attack doesn’t work against MySQL, because in PHP’s mysqli extension, the mysqli::query() API doesn’t allow multiple queries to run in the database server\n \n\n\n\n\n83\nMultiple SQL Statements\nThe code below tries to execute two SQL statements using the $mysqli->query() API\n\n\n\n\n\n\nWhen we run the code, we get the following error message:\n\n\n\n\nIf we do want to run multiple SQL statements, we can use $mysqli -> multi_query() [not recommended for security purposes]\n\n\n84\nSQL Injection Humor\n85\nThe Fundamental Cause\nMixing data and code together is the cause of several types of vulnerabilities and attacks including SQL Injection attack, XSS attack, attacks on the system() function and format string attacks\n\n86\nCross-Site Scripting\nSQL Injection\nShell Script Injection\nCountermeasures: Filtering and Encoding Data\nBefore mixing user-provided data with code, inspect the data; Filter out any character that may be interpreted as code\nSpecial characters are commonly used in SQL Injection attacks; To get rid of them, encode them\nEncoding a special character tells parser to treat the encoded character as data and not as code; This can be seen in the following example\n\n\nPHP’s mysqli extension has a built-in method called mysqli::real_escape_string(); It can be used to encode the characters that have special meanings in SQL\nThe following code snippet shows how to use this API \n\n\n87\nThe filtering or escaping approach doesn’t address the fundamental cause of the problem; Data and code are still mixed together\nCountermeasures: Prepared Statement\nFundament cause of SQL injection: mixing data and code\nFundament solution: separate data and code\nMain Idea: Sending code and data in separate channels to the database server; This way the database server knows not to retrieve any code from the data channel\nHow: using prepared statement\nPrepared Statement: \nIt is an optimized feature that provides improved performance if the same or similar SQL statement needs to be executed repeatedly\nUsing prepared statements, we send an SQL statement template to the database, with certain values called parameters left unspecified\nThe database parses, compiles and performs query optimization on the SQL statement template and stores the result without executing it; We later bind data to the prepared statement\n\n88\nCountermeasures: Prepared Statement\nThe vulnerable version: code and data are mixed together\n\n\nUsing prepared statements, we separate code and data \nSend code\nSend data\nStart execution\n89\nWhy Are Prepared Statements Secure?\nTrusted code is sent via a code channel\nUntrusted user-provided data is sent via data channel\nDatabase clearly knows the boundary between code and data\nData received from the data channel is not parsed\nAttacker can hide code in data, but the code will never be treated as code, so it will never be attacked\n\n90\n91\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nThe Cross-Site Scripting Attack\nIn XSS, an attacker injects malicious code to the victim’s browser via the target website\nWhen code comes from a website, it is considered as trusted with respect to the website, so it can access and change the content on the pages, read cookies belonging to the website and sending out requests on behalf of the user\n\nBasically, code can do whatever the user can do inside the session\nTypes: \nNon-persistent (Reflected) XSS Attack\nPersistent (Stored) XSS Attack\n\n\n92\nSamy Computer Worm\nSamy is a cross-site scripting worm that was designed to propagate across the social networking site MySpace by Samy Kamkar\n\nWithin just 20 hours of its October 4, 2005 release, over one million users had run the payload making Samy the fastest-spreading virus of all time\n93\nClinton-Obama Campaigns XSS Attack\nFinnish security researcher Harry Sintonen published an example of a cross-site scripting vulnerability on votehillary.org\nSintonen's example submits a POST request to the Vote Hillary website and injects an iframe, causing the site to display the contents of Barack Obama's website\n94\nBBC XSS Attack\nA cyber-attack on Twitter platform Tweetdeck infiltrated several accounts, and re-tweeted garbled code\nThe BBC's main Twitter account fell foul of the attack, re-tweeting incomprehensible code\n95\nNon-persistent (Reflected) XSS Attack\nMany websites take input from the user, conduct some activities and then send response to the user in a web page, with the original user input included on the response (i.e., the user input is reflected back)\nE.g., Google search will give back your input and results\nIf a website with a reflective behaviour takes user inputs, then:\nAttackers can put JavaScript code in the input, so when the input is reflected back, the JavaScript code will be injected into the web page from the website\n96\nNon-persistent (Reflected) XSS Attack\nAssume a vulnerable service on website : http://www.example.com/search?input=word, where word is provided by the users\n\nNow the attacker sends the following URL to the victim and tricks him to click the link: http://www.example.com/search?input=<script>alert(“attack”);</script>\n\nOnce the victim clicks on this link, an HTTP GET request will be sent to the www.example.com web server, which returns a page containing the search result, with the original input in the page\nThe input here is a JavaScript code which runs and gives a pop-up message on the victim’s browser\n97\nPersistent (Stored) XSS Attack\nAttackers directly send their data to a target website/server which stores the data in a persistent storage\nIf the website later sends the stored data to other users, it creates a channel between the users and the attackers\n\nExample: User profile in a social network is a channel as it is set by one user and viewed by another\n98\nPersistent (Stored) XSS Attack\nThese channels are supposed to be data channels\nBut data provided by users can contain HTML markups and JavaScript code\nIf the input is not sanitized properly by the website, it is sent to other users’ browsers through the channel and gets executed by the browsers\nBrowsers consider it like any other code coming from the website; Therefore, the code is given the same privileges as that from the website\n99\nDamage Caused by XSS\nWeb defacing: JavaScript code can use DOM (Document Object Model) APIs to access the DOM nodes inside the hosting page; Therefore, the injected JavaScript code can make arbitrary changes to the page\nExample: JavaScript code can change a news article page to something fake or change some pictures on the page\n\n100\nDamage Caused by XSS\n\nSpoofing requests: The injected JavaScript code can send HTTP requests to the server on behalf of the user\n\nStealing information: The injected JavaScript code can also steal victim’s private data including the session cookies, personal data displayed on the web page, data stored locally by the web application\n101\nSelf-Propagation XSS Worm\n102\nWhen an infected profile is viewed by others, the code can further spread – victim is turned into an attacker via a link approach or DOM approach\n\nTo become a real worm, the malicious JavaScript program should be able to propagate itself, i.e. self-propagating cross-site scripting worm\nCountermeasures: The Filter Approach\nRemoves code from user inputs (corrects the mistake of mixing code and data together)\nIt is difficult to implement as there are many ways to embed code other than <script> tag\nUse of open-source libraries that can filter out JavaScript code \nExample: jsoup\n\n103\nCountermeasures: The Encoding Approach\nReplaces HTML markups with alternate representations\nIf data containing JavaScript code is encoded before being sent to the browsers, the embedded JavaScript code will be displayed by browsers, not executed by them\nConverts <script> alert(‘XSS’) </script> to &lt;script&gt;alert(‘XSS’)\n104\nCountermeasures: Using CSP\nHow websites tell browsers which code source is trustworthy is achieved using a security mechanism called Content Security Policy (CSP)\nThis mechanism is specifically designed to defeat XSS and ClickJacking attacks\nCSP has become a standard, which is supported by most browsers nowadays\nCSP not only restricts JavaScript code, it also restricts:\nother page contents, such as limiting where pictures, audio, and video can come from\nwhether a page can be put inside an iframe or not (used for defeating ClickJacking attacks)\n105\nIn-Class Practices\nQuestion 1: In order to implement the classic DoS flood attack, the attacker must generate a sufficiently large volume of packets to exceed the capacity of the link to the target organization. Consider an attack using ICMP echo request (ping) packets that are 500 bytes in size (ignoring framing overhead). How many of these packets per second must the attacker send to flood a target organization using a 0.5-Mbps link? How many per second if the attacker uses a 2-Mbps link? Or a10-Mbps link?\n\nAnswers to Q1\nLet’s have the following parameters: w the bandwidth of the communications channel, and p the minimum number of 500-byte size packets needed to exceed the capacity of the channel. To reach the capacity of the channel (p * 500 * 8) = w, with w expressed in bits, so p = w/4000. Based on it for each case we have:\nw = 0.5 Mbps = 500,000 bits; p = 500000/4000 = 125 packets/second \nw = 2.0 Mbps = 2,000,000 bits; p = 2000000/4000 = 500 packets/second\nw = 10.0 Mbps = 10,000,000 bits; p = 10000000/4000 = 2,500 packets/second\n\nIn-Class Practice\nQuestion 2: Consider a distributed variant of the attack we explore in Problem Q1. Assume the attacker has compromised a number of broadband-connected residential PCs to use as zombie systems. Also assume each such system has an average uplink capacity of 128 kbps. What is the maximum number of 500-byte ICMP echo request (ping) packets a single zombie PC can send per second? How many such zombie systems would the attacker need to flood a target organization using a 0.5-Mbps link? A 2-Mbps link? Or a10-Mbps link? Given reports of botnets composed of many thousands of zombie systems, what can you conclude about their controller’s ability to launch DDoS attacks on multiple such organizations simultaneously? Or on a major organization with multiple, much larger network links than we have considered in these problems?\n\nAnswers to Q2\nLet’s have the following parameters: w the bandwidth of the communications channel, and p the minimum number of 500-byte size packets needed to exceed the capacity of the channel, and z the number of zombies needed to exceed the capacity of the channel. The maximum number of packets a zombie can send is pz = 128,000/4000 =32 pps (packets per second). Based on the results from Q2, the number of required zombies will be z = p/pz = p/32, and for each case we have:\nw = 0.5 Mbps;\t    z = 125pps/32pps = 3,9 (requires 4 zombies)\nw = 2.0 Mbps;     z = 500pps/32pps = 15,6 (requires 16 zombies)\nw = 10.0 Mbps;   z = 2500pps/32pps = 78,1 (requires 79 zombies)\nBased on the results we got above, it suggests that just a few zombies with relatively low capacity communication channel will be able to cause problems to organizations. In the examples above, with corporate bandwidth from 0.5Mbps to 10Mbps, we have a very narrow channel for today’s standards, however the number of zombies required to shut those networks down is small compared with the thousands of zombies that a botnet controller could use. With thousands of zombies conducting flooding DoS attacks, a botnet controller will be able to attack many organizations at the same time or a big organization with multiple links. If the botnet controller manages to increase the size of the packet the attack will be even more effective. \nIn-Class Practices\nQuestion 3: All the information that a server needs to know about a connection is not only contained in the SYN packet, but also in the final ACK packet from the client. Therefore, information-wise, there is no need to allocate a buffer to save the information about half-open connections. If we get rid of this buffer, the SYN flooding attack will not be effective any more. Do you agree with such a statement or not. Please justify your answer.\n\nAnswers to Q3\nBasically, if we get rid of the buffer, we have solved the SYN flooding attack problem, but we will introduce a new and more powerful attack. The attacker can simply send ACK flooding packets, each one causing the server to allocate memory for a full connection, which takes more memory than that for half-open connections.\n\n112\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nThe Heartbleed Bug and Attack\n113\nVulnerability in the OpenSSL library, specifically the Heartbeat protocol in TLS (Transport Layer Security)\nOpenSSL (widely used library for TLS) drives HTTPS that your web browser relies on for online banking, and other secure transactions\nLaunched in 2012 on web servers built on top of OpenSSL\nDisclosed in 2014\nBackground: the Heartbeat Protocol\n114\nTLS/SSL protocols provide a secure channel between two communicating applications\nHeartbeat extension: implement keep-alive feature of TLS\nMaintains secure session without interruption (e.g., from firewall) when client and server are not sending data to each other for a period of time \nHard to initiate and re-establish secure sessions\nSend request packet to receiver and obtain an acknowledgement packet by doing a copy of the payload content based on payload length L\nThe copy caused the vulnerability; attacker can specify larger L\nHeartbleed bug is an implementation flaw in TLS/SSL heartbeat extension\nHow Response Packet is Constructed\n115\nProblem: how much is copied depends on the value contained in the payload length field\n\nWhat if this value is larger than the actual payload size? \n\nAttack Launch\n116\nAttack Results: Some data from the server’s memory also got copied into the response packet, which will be sent out\nAttack Launch\n117\nTo launch a Heartbleed attack, an attacked sends a specially crafted Heartbeat request packet to the victim\nInside this packet, the number put in the payload size field is larger than the actual payload size\nWhen the packet arrives on receiver side, memcpy() will copy more data into the response packet than the request packet (i.e., receiver does a memory dump)\nThe affected memory may store sensitive information, such as passwords, credit card info or other user information\nThis data will be copied into the response packet and sent to the attacker\nBy sending a heartbeat request to a vulnerable remote server, attackers can dump the server’s memory and steal sensitive information\n0x0016 (22 bytes) is placed in the length field, which exactly matches with the actual length of the payload\nWe play with this length field to perform our attack in the next slide\n\n\nLaunch the Heartbleed Attack\n118\nFrom the code snippet we can see that:\nTLS record’s size = 0x0029 (not including the record header), which is the size of the payload in the TLS record\nThe payload contains a Heartbeat request packet, and has its own header (3 bytes) payload (22 bytes) and paddings (16 bytes)\nThe value 0x0016 is the value that exactly matches with the actual payload (22 bytes), so we will not be able to get any additional data from the server\nWe got some secret from the server\n\nLaunch the Heartbleed Attack\n119\nWe increase this value to higher values (e.g. 0x4000 i.e., 16K; much larger than the actual payload size -> 22 bytes) and start getting larger packets back\nThe attack.py program prints out the payload data in the response packet\nIf no user has logged into the server yet before the attack, there will not be much useful data stored in memory\nWhen running the attack multiple times, we may get back different data, because each request packet might be stored at a different memory address\nSimply update your system’s OpenSSL library. The following two commands can be used for it:\n\n\n\nThe following code shows how the OpenSSL library is fixed\n\nFixing the Heartbleed Bug\n120\nFixing the Heartbleed Bug – Use Bounds Checking\n121\nComparing the shown code with the vulnerable version shown earlier, \nAn if statement is added\ns  s3  rrec.length is the total number of bytes in the request packet; this is the actual length and not the one declared in the request packet\nConstant 1  size of type field\nConstant 2  size of length field\nConstant 16  minimum padding length\n\nThe if statement compares whether the declared payload length plus a constant (19) is larger than the actual size of the request packet\nIf larger, the packet is discarded and there will be no reply\nIf attacker send a request packet with larger declared length value, the packet won’t have any effect\nStory: Bounds Checking and Game Design \nCryptojacking\n122\nCryptojacking is the unauthorized use (i.e., hijacking) of someone else’s computer processing power to mine cryptocurrency\n\nHackers do this by either:\nSocial Engineering / Malware: Getting the victim to click on a malicious link (phishing) in an email that loads cryptomining code (malware) on the computer, or \nBrowser-based Attacks: By infecting a website or online ad with JavaScript code that auto-executes once loaded in the victim’s browser (mining will take place as long as browser/tab is open)\n\nEither way, the cryptomining code then works in the background as unsuspecting victims use their computers normally \nSymptoms: overheating of device, high processor usage, slower performance or lags in execution\nLatest Cryptojacking News\n123\nhttps://news.bitcoin.com/cryptojacking-a-rising-threat-to-all-internet-users \nHackers are increasingly turning to cryptojacking because it’s low-risk, low-investment, and an easy way to get steady and large profits…\n\nUnlike other types of malware, like ransomware, where there is no guarantee the fraudsters will get paid, cryptojacking ensures they will make money without calling too much attention…\nhttps://cointelegraph.com/news/browser-based-cryptojacking-is-back-as-attacks-spike-163 \nThe crypto price surge is usually accompanied by a wave of cryptojacking attacks according to research published by cybersecurity firm Symantec…\n\nCryptojacking had previously been in a steep decline from March 2019 due to the shutdown of the mining script maker, CoinHive\n\nIn January 2018, researchers discovered the Smominru cryptomining botnet, which infected more than a half-million machines, mostly in Russia, India, and Taiwan (extracted ~$3.6 million in value within a month)\n\n\nHow Cryptojacking Works\n124\nHackers inject a cryptomining script on a website or in an Ad that is placed on multiple sites\nWhen the victim visits the infected website, or if the malicious Ad pops up in the victim’s browser, the script automatically executes\nNo code is stored on the victim’s computer and no damage is done to computers or victims’ data\n\nInteraction with mining pool\nPrevention of Cryptojacking\n125\nUse VPN to encrypt internet connections and hide IP address\nAwareness and Training to thwart social engineering scams\nInstall an Ad-blocking or anti-cryptomining extension on web browsers\nUse end-point protection that is capable of detecting known crypto miners\nKeep your web filtering tools up to date\nMaintain browser extensions\nUse a mobile device management (MDM) solution to better control what’s on users’ devices\n\nDNS and Attacks\n126\nDNS Hierarchy, Zones, and Servers\n\nDNS Query Process\n\nDNS Attacks: Overview\n\nLocal DNS Cache Poisoning Attack\n\nDefense against DNS spoofing attacks\n\n\n\n\n\n\n\n\n\nDNS Domain Hierarchy\n127\nBelow ROOT, we have Top-Level Domain (TLD). Ex: In www.example.com, the TLD is .com\nThe next level of domain hierarchy is second-level domain which are usually assigned to specific entities such as companies, schools etc.\n\n\nDomain (nameserver) namespace is organized in a hierarchical tree-like structure\nEach node is called a domain, or subdomain.\nThe root of the domain is called ROOT, denoted as ‘ . ‘\n\nInternet Assigned Name Authority (IANA) \nDomain Name System (DNS) is a phonebook of the Internet – enables mapping of domain names to IP addresses of machines \nDNS Zone\n128\nHierarchy tree structure depicts subdomains within example.com domain\nIn this case, there are multiple DNS zones one for each country; the zone keeps records of who the management authority is for each of its subdomains\nFor scalability, you have sub-domains on different name servers\n\nDNS is organized according to zones \n\nA zone groups contiguous domains and subdomains on the domain tree and assign management authority to an entity\nusa.example.com is a domain with subdomains as boston, nyc and chicago; Two zones are created for usa.example.com - First contains usa domain, chicago and boston subdomain and second contains nyc subdomain\nZone vs Domain\n129\nA DNS zone only contains a portion of the DNS data for a domain\nIf a domain is not divided into subdomains, the zone and domain are essentially the same, because the zone contains all the DNS data for the domain\nWhen a domain is big, it is divided into subdomains\nTheir DNS data can still be put in the same zone, so domain and zone are still the same\nBut subdomains can have their own zones\n\nAuthoritative Name Servers\n130\nEach DNS zone has at least one authoritative nameserver that publishes information about the zone\n\nIt provides the original and definitive answers to DNS queries\n\nAn authoritative name server can be a master server (primary) or slave server (secondary)\n\nA master server stores the master copies of all zone records whereas a slave server uses an automatic updating mechanism to maintain an identical copy of the master records\n\n\nDNS ROOT Servers\n131\nThe root zone is called ROOT\n\nThere are 13 authoritative nameservers (DNS root servers) for this zone\n\nThey provide the nameserver information about all top-level domains (TLDs)\n\nhttps://www.internic.net/domain/root.zone\n\nThey are the starting point of DNS queries\n\n13 DNS Root Servers\n132\nThey are the most critical infrastructure on the Internet (they mirror the information by having multiple computers at different places in the world – accessible via anycast) \n\n\nIf you can bring down Root servers, the Internet will be down!\nTop Level Domain (TLD)\n133\nInfrastructure TLD:  .arpa\n\nGeneric TLD (gTLD): .com, .net, \n\nSponsored TLD (sTLD): These domains are proposed and sponsored by private agencies or organizations that establish and enforce rules restricting the eligibility to use the TLD:  .edu, .gov, .mil, .travel, .jobs\n\nCountry Code TLD (ccTLD): .au (Australia), .cn (China), .fr (France)\n\nReserved TLD: .example, .test, .localhost, .invalid\n\n\nDNS Query Process\n134\nDNS Cache\nLocal DNS Files\nRecursive\n.com\nLocal DNS Files\n135\n/etc/host: stores IP addresses for some hostnames. Before machine contacts the local DNS servers, it first looks into this file for the IP address.\n\n\n\n\n/etc/resolv.conf: provide information to the machine’s DNS resolver about the IP address of the local DNS server. The IP address of the local DNS server provided by DHCP is also stored here.\nLocal DNS Server and Iterative Query Process\nThe iterative process starts from the ROOT Server\n\nIf it doesn’t know the IP address, it sends back the IP address of the nameservers of the next level server (.NET server) and then the last level server (example.net) which provides the answer\n136\nEmulating Local DNS Server \u000b(Step 1: Ask ROOT)\nDirectly send the query to one of the 13 root servers\n\nNo answer (the root does not know the answer)\n\nGo ask them!\n\n\n137\nSteps 2-3: Ask .net & example.net servers\nAsk a .net nameservers. \nAsk an example.net nameservers. \nGo ask them!\n\n\nFinally got the answer\n\n138\nDNS cache\nWhen the local DNS server gets information from other DNS servers, it caches the information\n\nEach piece of information in the cache has a time-to-live value, so it will be eventually time out and removed from the cache\n139\nQuestion: How local DNS server get’s root server IP? \nAnswer: The Zone file\nDNS Attacks\nDenial-of-Service Attacks (DoS): When the local DNS servers and the authoritative nameservers do not respond to the DNS queries, the machines cannot retrieve IP addresses which essentially cuts down the communication\n\nDNS Spoofing Attacks: \nPrimary goal: provide a fraudulent IP address to victims, tricking them to communicate with a machine that is different from their intention \nExample: If a user’s intention is to visit a bank’s web site to do online banking, but the IP address obtained through the DNS process is attacker’s machine, the user machine will communicate to the attacker’s web server\n140\nOverview of the Attack Surfaces\n141\nDNS queries involve several packets and thus present a broad attack surface in terms of spoofing (1 – 4 in figure below)\n/etc/hosts file\nwith localhost information\n\nYou can also launch DoS attack at all points – root, local DNS server, TLD server\nDNS Attacks on Compromised Machines\nIf attackers have gained the root privileges on a machine, \nModify /etc/resolv.conf: use malicious DNS server as the machine’s local DNS server and can control the entire DNS process\nModify /etc/hosts: add new records to the file, providing the IP addresses for some selected domains\nFor example, attackers can modify IP address of www.bank32.com which can lead to attacker’s machine\n\n142\nSpoofing DNS Replies (from LAN)\n143\nAttacks on user machines : When the user machine sends out a DNS query to its local DNS server, attacker can immediately send a spoofed reply, using local DNS as its source IP address; Attackers can put any arbitrary IP address in the reply\n\nAttacks on local DNS server : Cache Poisoning attack : When the local DNS server sends out iterative queries to get an answer from the DNS servers on the Internet, attackers can send out spoofed replies to the local DNS server; They get accepted as long as they arrive before the actual replies - This is called DNS cache poisoning\n\nAttacks on Nameservers \u000bof a Particular Domain\nUltraDNS: DNS provider for many major e-commerce companies such as Amazon, Walmart, Expedia\n\nIn 2004, DoS against this UltraDNS provider was launched which suffered an outage for an hour\n144\nAttacks on Nameservers \u000bof a Particular Domain\nDNSPod: In 2009, several DNS servers of a Chinese domain service provider were hit by DDoS\nThe attack was meant to target one particular company (Baofeng.com) which is widely popular video streaming site in China\n\nOn the next day of attack, when DNS responses previously cached by the other servers timed out, Baofeng’s media player on users’ machines could not find the IP addresses of the servers because of the attack\n\nDue to the bug in the media player software, instead of waiting, they continuously sent out DNS queries at a faster rate\n\nDue to massive number of DNS queries, they flooded and congested the network of China Telecom (ISP); It impacted 20 provinces and is described as the worst Internet incident in China\n145\nAttacks on Nameservers of \u000ba Particular Domain\nDyn network: In 2016, multiple DDoS attacks were launched against a major DNS service provider for companies like CNN, BBC, HBO, PayPal etc. The attacks are believed to have been launched through botnet consisting of different IoT devices like IP cameras, baby monitors etc. It caused major Internet services unavailable\n146\n147\nNetwork, IoT, and Cybersecurity Lab \n(EagleCyberHub @ HE 303)\nIs Hiring!!!\n148\nNetwork, IoT, and Cybersecurity Research Lab \u000b\nWe’re the 1st student research lab focus on network and cybersecurity in the computing and software engineering department!!!\nThis research job counts for FGCU service-learning hours!\nWe have tons of network devices and resources (e.g., routers, switches, racks, high-speed network)!!!\nWe even have drones!\nCome and join us! Email your resume now! cqu@fgcu.edu \n"
}