{
  "filename": "Module 1 - Application and Network Analysis - Part 1.pptx",
  "text": "CEN 3078 Computer Security\nModule 1 – Application and Network Analysis\n\n2\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\n3\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nModule-1: Discussion Topics\nNetwork and application layers – security concepts\nNetworking and Computing Today\nCIA Triad\nStandard Definitions\nPassive and Active Attacks \nAttack Surfaces and Attack Trees\nThreat Modeling\nFundamental Security Design Principles\nApplication Case Studies: Manufacturing, Special Education\nPacket sniffing and spoofing\nIntrusion detection systems\nLegal and ethical issues\n\n4\nModel of Internet Layers for User/Device Communications\n5\nTCP/IP Communication\n6\nTCP/IP Communication (2)\n7\nDiverse Computing and Data Deluge Enabling New Cybersecurity Challenges\n8\nVirtual Machines in Today’s Computing\n\nWith Virtualization\nWithout Virtualization\n9\n10\nIdentifying Types of Threats\nMalware: MALicious softWARE\nSecurity breaches\nDoS: Denial of Service attacks\nWeb attacks\nSession hijacking\nInsider threats\nDNS poisoning\nNew attacks: Doxing\n\n\n11\nMalware\nSoftware with a malicious purpose\nViruses\nTrojan horses \nSpyware\nLogic bombs\n12\nMalware (cont.)\nViruses\nOne of the two most common types of malware\nDesigned to replicate and spread\nUsually spreads through email\nUses system resources, causing network slowdowns or stoppage\n\n\n13\nMalware (cont.)\nTrojan Horses\nThe other most common type of malware\nNamed after the wooden horse of ancient history\nAppears benign but secretly downloads malware onto a computer from within\n\n14\nMalware (cont.)\nSpyware\nA rapidly growing type of malware\nCookies\nKey loggers\nLogic Bombs\nLay dormant until some logical condition is met, often a specific date\n\n\n15\nTypes of Ethical Hackers\nWhite Hat Hacker\nDo not intend to harm the system or organization but they so, officially to penetrate and locate the vulnerabilities, providing to fix them and ensure safety\nBlack Hat Hacker\nThey are non-ethical hackers performing hacking to fulfill their selfish intentions to collect monetary benefits\nGrey Hat Hacker\nCombination of white and black – they hack without any malicious intent for fun; don’t use approval from a targeted organization and publicly disclose any vulnerability\n\n\n\n\n16\nBasic Security Terminology\nDevices:\nFirewall\nFilters network traffic\nProxy server\nDisguises IP address of internal host\nIntrusion Detection System (IDS)\nMonitors traffic, looking for attempted attacks\nActivities:\nAuthentication\nAuditing\n17\nExercise: Act during an Intrusion\nSuppose you observe that your PC is responding very slowly to information requests from the net. And then you further observe that your network gateway shows high levels of network activity, even though you have closed your e-mail client, Web browser, and other programs that access the net. \n\nWhat types of malware could cause these symptoms? \nHow might the malware have gained access to your system? \nWhat steps can you take to check whether this has occurred? \nIf you do identify malware on your PC, how can you restore it to safe operation?\n18\nIn-Class Exercise: Act during an Intrusion\nWhat types of malware could cause these symptoms? \nVirus, Worm\nHow might the malware have gained access to your system? \nPhishing attacks using malicious email messages that activate the virus or worms by using a web link pointing to a malware download or carrying malicious attachments\nWhat steps can you take to check whether this has occurred? \nRefer to your anti-virus software logs\nUse a traffic network analyzer, like Wireshark, and scan the network traffic for a period of time to possibly determine the type of traffic being generated by the PC, the destination, and also the service that is generating that traffic\n19\nIn-Class Exercise: Act during an Intrusion\n\nd) If you do identify malware on your PC, how can you restore it to safe operation?\nIsolate the machine from any network connections\nAttempt to create a backup of the data, although the backup will contain infected files, at least data will be saved for future cleaning\nIf possible, completely rebuild the system and recover the data from the most recent backup that is considered free from malware\nIf no backups are available then try to clean the system using an anti-virus package or other data recovery tools\nMoral: Have a plan and know your Risks; Consider Cyber Insurance purchase and follow Incident Response best practices…\nCyber Security Definition\nNIST 7298 Report defines the term cybersecurity as follows:\n“Measures and controls that ensure confidentiality, integrity, and availability of information system assets including hardware, software, firmware, and information being processed, stored, and communicated.”\n\n\n20\n1. What assets do we need to protect?\n2. How are those assets threatened?\n3. What can we do to counter those threats?\nNIST standard FIPS 199 (Standards for Security Categorization of Federal Information and Information Systems) \nKey Security Concepts\n21\nRelated CIA Triad Definitions – from Information Assurance Perspective\nConfidentiality: This term covers two related concepts:\nData confidentiality: Assures that private or confidential information is not made available or disclosed to unauthorized individuals\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nIntegrity: This term covers two related concepts:\nData integrity: Assures that information and programs are changed only in a specified and authorized manner\nSystem integrity: Assures that a system performs its intended function in an unimpaired manner, free from deliberate or inadvertent unauthorized manipulation of the system\nAvailability: Assures that systems work promptly and service is not denied to authorized users\n\n22\nApplication Security vs. Network Security\n23\nApplication Security\n\n\nPreservation of confidentiality, integrity, and availability of application information\nOther properties such as authenticity, accountability, non-repudiation, and reliability can also be involved\nNetwork Security\n\n\nProtection  of networks and their services from unauthorized modification, destruction, or disclosure \n\nProvision of assurance that the network performs its critical function correctly and that there are no harmful side effects\nOther Essential Definitions\nAuthenticity:  The property of being genuine and being able to be verified and trusted; confidence in the validity of a transmission, a message, or message originator\nThis means verifying that users are who they say they are and that each input arriving at the system came from a trusted source\n\nNon-Repudiation: Assurance that the sender of information is provided with proof of delivery and the recipient is provided with proof of the sender’s identity, so neither can later deny having processed the information (e.g., digital signatures that help one to not deny validity)\n\nAccountability:  The security goal that generates the requirement for actions of an entity to be traced uniquely to that entity\nThis supports non-repudiation, deterrence, fault isolation, intrusion detection and prevention, and after-action recovery and legal action\nBecause truly secure systems are not yet an achievable goal, we must be able to trace a security breach to a responsible party\nSystems must keep records of their activities to permit later forensic analysis to trace security breaches or to aid in transaction disputes\n\n24\nSecurity Concepts and Relationships\u000b(from RFC 2828, Internet Security Glossary)\n25\nSecurity Concepts and Relationships\u000b(from RFC 2828, Internet Security Glossary)\n26\nAdversary (threat agent)\nIndividual, group, organization, or government that conducts or has the intent to conduct detrimental activities\u000b\nAttack\nAny kind of malicious activity that attempts to collect, disrupt, deny, degrade, or destroy information system resources or the information itself\n\nCountermeasure\nA device or techniques that has as its objective the impairment of the operational effectiveness of undesirable or adversarial activity\nAims to prevent espionage, sabotage, theft, or unauthorized access to or use of sensitive information or information systems\n\nRisk\nA measure of the extent to which an entity is threatened by a potential circumstance or event, and typically a function of: (i) the adverse impacts that would arise if the circumstance or event occurs; and (ii) the likelihood of occurrence\nSecurity Concepts and Relationships (2)\u000b(from RFC 2828, Internet Security Glossary)\n27\nSecurity Policy\nA set of criteria for the provision of security services; It defines and constrains the activities of a data processing facility in order to maintain a condition of security for systems and data.\n\nSystem Resource (Asset – Hardware, Software, Data, Network)\nA major application, general support system, high impact program, physical plant, mission critical system, personnel, equipment, or a logically related group of systems\n\nThreat\nAny circumstance or event with the potential to adversely impact/harm: organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, or the Nation through an information system – via unauthorized access, destruction, disclosure, modification of information, and/or denial of service\n\nVulnerability\nFlaw or weakness within: an information system, system security procedures, internal controls, or implementation that could be exploited or triggered by a threat source\n\n\nBasically, a threat is a possible danger that might exploit a vulnerability…\nVulnerabilities, Threats and Attacks\n28\nCategories of vulnerabilities\nCorrupted (loss of integrity)\nLeaky (loss of confidentiality)\nUnavailable or very slow (loss of availability)\n\nThreats\nCapable of exploiting vulnerabilities\nRepresent potential security harm to an asset\n\nAttacks (threats carried out)\nPassive – attempt to learn or make use of information from the system that does not affect system resources\nActive – attempt to alter system resources or affect their operation\nInsider – initiated by an entity inside the security parameter\nOutsider – initiated from outside the perimeter\n\n\n\nLevels of Impact\n29\n(i) organization functions are noticeably reduced; (ii) minor damage to assets; (iii) minor financial loss; or (iv) minor harm to individuals\n(i) organization functions are significantly reduced; (ii) significant assets damage; (iii) significant financial loss; or (iv) significant but not life-threatening individuals harm\n(i) organization functions are severely disrupted; (ii) major damage to assets; (iii) catastrophic financial loss; or (iv) individual loss of life or life-threatening injuries\nSome Survey Findings…\nThe chief impediment to implementing cloud services was security, listed by 85% of federal IT managers\nSource: MeriTalk Cloud Computing Exchange\n67% of IT professionals say their organization is very vulnerable because cloud ports and firewalls are not adequately secured\nSource: Ponemon Institute\n“…human factors, is the biggest contributor responsible for 50 to 80 percent of network device outages”\nSource: Juniper Networks Whitepaper\n\n30\nIn-Class Exercise:\u000bHow to Secure Linux OS?\nTo avoid malicious compromise of system resources, following issues need to be addressed:\nUse strong passwords – lock account if multiple login failures\nInstall only the required software packages\nDo you need Apache?\nSetup access lists for services (i.e., host firewall)\nRegularly patch the OS \nCheck listening ports and verify if those are required\nUse “netstat” or even an Intrusion Detection System (IDS) for monitoring\nRun only required system services\nUse “chkconfig” to list all services started at bootup\nAvoid telnet, rlogin and rsh – use scp/sftp instead \nSecure remote access\nSecure NFS if sharing files over network\n\nFor more details - http://www.puschitz.com/SecuringLinux.shtml\n\n31\n32\nOnline Security Resources\nCERT\nwww.cert.org\nMicrosoft Security Response Center \nhttps://www.microsoft.com/en-us/msrc?rtc=1\nF-Secure\nwww.f-secure.com\nSANS\nwww.sans.org \n\n\n\nCertification List\n(5%) Certificate of Cloud Security Knowledge (CCSK) https://cloudsecurityalliance.org/education/ccsk/ \n(10%) ISC2 Certified Cloud Security Professional (CCSP) https://www.isc2.org/certifications/ccsp \n(5%) ISC2 Certified in Cybersecurity (CC) https://www.isc2.org/certifications/cc \n(10%) ISC2 Systems Security Certified Practitioner (SSCP) https://www.isc2.org/certifications/sscp \n(10%) CompTIA Security+  https://www.comptia.org/certifications/security \n\n34\nNetwork, IoT, and Cybersecurity Lab \n(EagleCyberNest @ HE 303)\nIs Hiring!!!\nVisit: chengyiqu.com  EagleCyberNest\n35\nNetwork, IoT, and Cybersecurity Research Lab \u000b\nWe’re the 1st student research lab focus on network and cybersecurity in the computing and software engineering department!!!\nThis research job counts for FGCU service-learning hours!\nWe have tons of network devices and resources (e.g., routers, switches, racks, high-speed network)!!!\nWe even have drones!\nCome and join us! Email your resume now! cqu@fgcu.edu \n"
}