{
  "filename": "Module 1 - Application and Network Analysis - Part 4.pptx",
  "text": "CEN 3078 Computer Security\nModule 1 – Application and Network Analysis\n\n2\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nCyber Crime and Forensic Evidence\n\nCybercrime, is a term used broadly to describe criminal activity in which computers or computer networks are a tool, a target, or a place of criminal activity\n\nForensic Evidence includes anything used in court to prove the validity or falsity of a statement\nCannot be “Hearsay”  (E.g. monitor 1 or 2 days and point fingers at attack sources)\nRoutine monitoring is hence vital\nPromotes custody of regular records of cyber activity\nHas to present information beyond reasonable doubt\n3\nTypes of Cyber Crime\u000b(as per US Department of Justice categorization)\n4\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\nIntellectual Property Infringement\n5\nMinimum human supervision\nRecover from crashes and reinitializations\nSelf-monitor and detect intruder modification\n\nIntellectual property: Any intangible asset that consists of human knowledge and ideas\nExamples include software, data, novels, sound recordings, the design of a new type of mousetrap, or a cure for a disease\n\nThere are three main types of intellectual property for which legal protection is available:\nCopyrights\nTrademarks\npatents\nCopyright\n6\nMinimum human supervision\nRecover from crashes and reinitializations\n\nProtects tangible or fixed expression of an idea but not the idea itself\n\nCreator can claim and file copyright at a national government copyright office if:\nProposed work is original\nCreator has put original idea in concrete form\n\nPatent\n7\nMinimum human supervision\nRecover from crashes and reinitializations\nGrant a property right to the inventor\u000b\n“The right to exclude others from making, using, offering for sale, or selling” the invention in the United States or “importing” the invention into the United States\nAn example of a patent from the computer security realm is the RSA public-key cryptosystem; from the time it was granted in 1983 until the patent expired in 2000, the patent holder, RSA Security, was entitled to receive a fee for each implementation of RSA\n\nTypes:\nTrademark\n8\nMinimum human supervision\nA word, name, symbol, or device \n\nUsed in trade with goods\n\nIndicates source of goods \n\nDistinguishes them from goods of others\n\nTrademark rights may be used to:\nPrevent others from using a confusingly similar mark\nBut not to prevent others from making the same goods or from selling the same goods or services under a clearly different mark\n\nPrivacy\n9\nMinimum human supervision\nOverlaps with computer security\n\nDramatic increase in scale of information collected and stored\nData-intensive research, Modeling & Simulation, IoT, Social Networks\n\nMotivated by law enforcement, national security, economic incentives\n\nIndividuals have become increasingly aware of access and use of personal information and private details about their lives\n\nConcerns about extent of privacy compromise have led to a variety of legal and technical approaches to reinforcing privacy rights\n\nPrivacy: Assures that individuals control or influence what information related to them may be collected and stored and by whom and to whom that information may be disclosed\nPrivacy Protection\n10\nMinimum human supervision\nBoth policy and technical approaches are needed to protect privacy\n\nIn terms of technical approaches, the requirements for privacy protection for data stored on information systems can be addresses in part using the technical mechanisms developed for database security\n\nWith regard to social media sites, technical controls include:\nThe provision of suitable privacy settings to manage who can view data on individuals\nNotification when one individual is referenced or tagged in another’s content\nAlthough social media sites include some form of these controls, they are constantly changing, causing frustration for users who are trying to keep up with these mechanisms\n\nAnother approach for managing privacy concerns in big data analysis is to anonymize the data, removing any personally identifying information before release to researchers or other organizations for analysis\n\nData Privacy\n11\nMinimum human supervision\nIn terms of policy, guidelines are needed to manage the use and reuse of big data, ensuring suitable constraints are imposed in order to preserve privacy:\n\nConsent\nEnsuring participants can make informed decisions about their participation in the research\nPrivacy and confidentiality\nPrivacy is the control that individuals have over who can access their personal information\nConfidentiality is the principle that only authorized persons should have access to information\nOwnership and authorship\nAddresses who has responsibility for the data, and at what point does an individual give up their right to control their personal data\nData sharing – assessing the social benefits of research\nThe social benefits that result from data matching and reuse of data from one source or research project in another\nGovernance and custodianship\nOversight and implementation of the management, organization, access, and preservation of digital data\nEthical Issues\n12\nMinimum human supervision\nEthics: “A system of moral principles that relates to the benefits and harms of particular actions, and to the rightness and wrongness of motives and ends of those actions”\n\nMany potential misuses and abuses of information and electronic communication that create privacy and security problems\n\nBasic ethical principles developed by civilizations apply\n\nUnique considerations surrounding computers and information systems\n\nScale of activities not possible before\n\nCreation of new types of entities for which no agreed ethical rules have previously been formed\n\nEthical Hacking\n13\nMinimum human supervision\n\nEthical hackers learn and perform hacking in a professional manner, based on the direction of the client, and later, present a maturity scorecard highlighting their overall risk and vulnerabilities and suggestions to improve\n\nNew worms, malware, viruses, and ransomware are multiplying every day and creating a need for ethical hacking services to safeguard the networks of businesses, government agencies or defense\n\nAn Ethical Hacker answers the following questions:\nWhat kind of vulnerabilities does an attacker see?\nWhat information or system would a hacker most want access?\nWhat can an attacker do with the information?\nHow many people notice the attempted hack?\nWhat is the best way to fix the vulnerability?\n\nhttps://www.eccouncil.org/ethical-hacking/\n14\nNetwork, IoT, and Cybersecurity Lab \n(EagleCyberNest @ HE 303)\nIs Hiring!!!\n15\nNetwork, IoT, and Cybersecurity Research Lab \u000b\nWe’re the 1st student research lab focus on network and cybersecurity in the computing and software engineering department!!!\nThis research job counts for FGCU service-learning hours!\nWe have tons of network devices and resources (e.g., routers, switches, racks, high-speed network)!!!\nWe even have drones!\nCome and join us! Email your resume now! cqu@fgcu.edu \n"
}