{
  "filename": "Module 1 - Application and Network Analysis - Part 2.pptx",
  "text": "CEN 3078 Computer Security\nModule 1 – Application and Network Analysis\n\n2\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\nThreats on Assets\n3\nAn online drive is compromised\nAfter a successful attack (e.g., Sony Hack)\nAn unauthorized copy of software is made - or -\nLicenses are used without permission\nImportance of Cybersecurity for Manufacturers\nManufacturing businesses are increasing online for operations\nWeb, Cloud Computing, Internet-of-Things, Big Data\nManufacturers are unfortunately a frequent target of hackers and attackers\nAccording to a report from the U.S. Department for Homeland Security, manufacturing is the second highest industry with the most reported cyber attacks, only subsequent to the energy sector\nAccording to a report by NTT Security, the manufacturing industry was the most heavily targeted industry during Q2 2017, accounting for 34% of all documented attack activity\nA Kaspersky Lab Survey of IT managers published in Virus News also found that “21 percent of manufacturers suffered a loss of intellectual property (IP) within the past year” \n4\nhttps://www.nist.gov/blogs/manufacturing-innovation-blog/cybersecurity-protecting-manufacturing-technology-and-innovation \nIn-Class Exercise: \u000bCreate a survey for a small-business company\n5\n\nCreate a survey questionnaire that will help a cybersecurity expert to assist a manufacturing/utility enterprise in becoming aware of their current cyber security posture and help them in:\nDefending their company’s vital data and information\nPreventing theft or damage to company infrastructure, equipment and systems\nAvoiding major disruptions to operations and the delivery of products\nProtecting employee’s personal information\nShielding the company from negative publicity\nPlanning IT budgets and policies with adequate cyber incident response\n\nDiscuss potential improvements in cyber attack threat detection and mitigation strategies that result in benefits in terms of: \nincreased productivity, cost savings and reduced risk\nSmall Business Response Exercise\nQ1) Important assets in your enterprise that are networked internally or with an external site\na) Do you use industrial equipment that is connected to the Internet? Yes  /  No\nb) Are there machines connected to computers with industry-standard/paid software licenses? Yes  /  No\nc) Do you store and share business-related data using cloud platforms? Yes  /  No\nd) Do you operate a private data center/server with network equipment? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q1:\n\n6\nAssume you are speaking to a small business enterprise \n- <<Name>>\nSmall Business Response Exercise (2)\nQ2) Potential cyber attack threats and the risks associated with compromise of valuable assets\na) Are you concerned about loss of data confidentiality due to undesired information exposure? Yes  /  No\nb) Are you concerned about data integrity because of data corruption by human/machine? Yes  /  No\nc) Are you concerned of loss of services or infrastructure that makes data inaccessible? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q2:\n\n7\nSmall Business Response Exercise (3)\nQ3) Solutions adopted to address cyber security threats and the risks associated with compromise of valuable assets\na) Do you use commercial or open-source software or network appliances for cyber security? Yes  /  No\nb) Do you manage network firewalls or role-based access control policies? Yes  /  No\nc) Do you have a process to monitor and prevent potential cyber intrusion detection? Yes  /  No\nd) Do you need the cyber security solutions to be compliant for external security audits? Yes  /  No\ne) Briefly describe any other relevant information pertaining to Q3:\n\n\n8\nSmall Business Response Exercise (4)\nQ4) Cyber security posture and potential of impact limits your workers day-to-day productivity\na) Do you have a cyber security posture related design document? Yes  /  No\nb) Do you have a budget allocated for cyber security related business cost? Yes  /  No\nc) Are you satisfied with the effort and/or $$ on cyber security? Yes  /  No\nd) Briefly describe any other relevant information pertaining to Q4:\n\n\n9\nCybersecurity Challenges\n10\nCybersecurity is not as simple as it might first appear to the novice\nSelf-explanatory one-word labels: confidentiality, authentication, nonrepudiation, and integrity; BUT mechanisms to meet those requirements can be quite complex, and understanding them may involve rather subtle reasoning\n\nIn developing a particular security mechanism or algorithm, one must always consider potential attacks on those security features\nIn many cases, successful attacks are designed by looking at the problem in a completely different way, therefore exploiting an unexpected weakness in the mechanism\n\nProcedures to provide security mechanism are driven by user requirements\nTypically, a security mechanism complexity depends on user requirements; greater the impact of threats, greater is the need for elaborate security mechanisms\n\n\n\n\n\n\nCybersecurity Challenges (2)\n11\nPhysical and logical placement of security mechanisms needs to be determined\nPhysical placement (e.g., at what points in a network are certain security mechanisms needed) \nLogical placement (e.g., at what layer or layers of an architecture such as TCP/IP should mechanisms be placed)\n\nSecurity mechanisms typically involve more than a particular algorithm or protocol and also require that participants be in possession of some secret information which raises questions about the creation, distribution, and protection of that secret information\nThere may also be a reliance on communications protocols whose behavior may complicate the task of developing the security mechanism\nFor example, if the proper functioning of the security mechanism requires setting time limits on the transit time of a message from sender to receiver, then any protocol or network that introduces variable, unpredictable delays may render such time limits meaningless\n\n\n\n\n\n\nCybersecurity Challenges (3)\n12\nAttackers only need to find a single weakness, while the designer must find and eliminate all weaknesses to achieve perfect security\nIt is a battle of wits between a perpetrator who tries to find holes, and the designer or administrator who tries to close them\n\nSecurity is still too often an afterthought to be incorporated into a system after the design is complete, rather than being an integral part of the design process\nThere is a natural tendency on the part of users and system managers to perceive little benefit from security investment until a security failure occurs\nUsers view strong security as an impediment to efficient and user-friendly operation of an information system or use of information\n\nSecurity requires regular and constant monitoring\nWhat to monitor – raw or aggregate, How much to monitor – metrics, How frequent – sampling rates?\n\n\n\n\n\n\n13\nModule 1\nNetwork and application layers – security concepts\nPacket sniffing and spoofing\n\nIntrusion detection systems\nLegal and ethical issues\n14\nPassive and Active Attacks\n\nPassive Attack\nActive Attack\n\nAttempts to learn or make use of information from the system but does not affect system resources\nHard to detect (no alteration)\nEasy to stop\nEavesdropping on, or monitoring of, transmissions\nGoal of attacker is to obtain information that is being transmitted\nTwo types:\nRelease of message contents\nTraffic analysis\n\nAttempts to alter system resources or affect their operation\nHard to stop\nEasy to detect (application impact)\nInvolve some modification of the data stream or the creation of a false stream\nFour categories:\nReplay\nMasquerade\nModification of messages\nDenial of service\nPassive Attack – Interception\u000b(Sniffing)\n15\nPacket sniffing describes the process of capturing live data as they flow across a network\nPassive Attack – Traffic Analysis\u000b(Sniffing)\n16\nObserve traffic pattern\nActive Attack – Interruption\u000b(Spoofing)\n17\nBlock delivery of message\n\nPacket spoofing occurs when critical information in the packet is forged by an attacker\nActive Attack – Fabrication\u000b(Spoofing)\n18\nFabricate message\n\nE.g., TCP session hijacking, DNS cache poisoning\nActive Attack – Replay\u000b(Sniffing + Spoofing)\n19\nActive Attack – Modification\u000b(Sniffing + Spoofing)\n20\n\n\n\nModify message\n21\nPassive and Active Attacks\n\nPassive Attack\nActive Attack\n\nAttempts to learn or make use of information from the system but does not affect system resources\nHard to detect (no alteration)\nEasy to stop\nEavesdropping on, or monitoring of, transmissions\nGoal of attacker is to obtain information that is being transmitted\nTwo types:\nRelease of message contents\nTraffic analysis\n\nAttempts to alter system resources or affect their operation\nHard to stop\nEasy to detect (application impact)\nInvolve some modification of the data stream or the creation of a false stream\nFour categories:\nReplay\nMasquerade\nModification of messages\nDenial of service\nTCP/IP Communication (Recall)\n22\nSocket Programming – Sending packets\nTCP – connection-oriented transport protocol (error-free)\nUDP – connectionless transport protocol (for time-sensitive communication)\nPort Number – Route information to particular application process (some numbers are reserved e.g., port 80 for web servers)\nUDP Client Example – sending packets using Python; and use Netcat program to test the server\n\n\n\n\n\n\n\n\n\n\n23\nHow packets are received?\nNIC (Network Interface Card) is a physical or logical link between a machine and a network\n\nEach NIC has a MAC address\n\nEvery NIC on the network will hear all the frames on the wire\n\nNIC checks the destination address for every packet, if the address matches the card’s MAC address, it is further copied into a buffer in the kernel\n\n\n\n\n\n\n\n24\nApplication\nLAN (Layer 2)\nSocket System Calls\nNIC\nUpper layer processing starting with IP\nOS control starts\nSniffing and Spoofing - Related Concepts\n25\nPromiscuous Mode - NIC passes every frame received from the network to the kernel; requires root or other elevated privilege to enable\n\nRaw Sockets – a special type of socket that allows a sniffing program to capture all packets flowing on the network cable, regardless of destination IP address or port number; used to implement spoofing\n\nBSD Packet Filter (BPF) – Unix utility for packet filtering at the lower level; a user space program to attach a filter to a socket; Kernel can be made to discard unwanted packets as early as possible by setting filters at different places along a captured packet’s traverse path\n\npcap API – a packet capture API used to implement sniffing using a platform independent interface – allows portable access to operating system’s packet capture facility; libpcap in Unix (from TCPdump) and WinPcap in Windows\nWireshark tool is popular to capture packets and examine contents (without coding)\n\nScapy – built on top of libpcap; commonly used for productivity (for performance purposes, better to use C); Hybrid Approach also works where Scapy is used to construct packets, and use C to slightly modify packets and then send packets\nUse Scapy for coding packet manipulations: packet parsing, packet sending and receiving, packet sniffing, packet spoofing, adding new protocols, etc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSnort, Mysql\nHoney Pot - Sniffing\nHacker Story -Kevin Mitnick with SDSC  \nAttack Surfaces\n27\nAttack Surface Categories\n28\nAttack Surface Analysis\n29\nAn attack surface analysis is a useful technique for assessing the scale and severity of threats to a system\n\nA systematic analysis of points of vulnerability makes developers and security analysts aware of where security mechanisms are required\nUse Decomposition to document components, applications and their infrastructure  develop data flow diagrams along with privilege boundaries  ensure proper controls are in place for any data crossing boundaries \n\nOnce an attack surface is defined, designers may be able to find ways to make the surface smaller, thus making the task of the adversary more difficult\nIgnore “high-risk, low-reward” cases\n\nThe attack surface also provides guidance on setting priorities for testing, strengthening security measures, or modifying the service or application\nDetermine the layers of security you need based on the threat, don’t forget they impact performance\n\n\n\n\n\n\n\nApplying all possible security tools strengths security at expense of the performance \n30\nThere is need to bridge the gaps in the information management and security/compliance needs, while also maintaining satisfactory application performance…\nBy 2020, $101.6 billion will be spent in cyber security, to build high walls and deep moats\nhttp://fortune.com/2016/10/12/cybersecurity-global-spending/\nAttack Surface and Defense Depth\n31\nAttacks in a Cloud Computing Environment\nThree actors involved; six types of attacks possible\nThe user can be attacked by:\nService  SSL certificate spoofing, attacks on browser caches, or phishing attacks\nThe cloud infrastructure  attacks that either originates at the cloud or spoofs to originate from the cloud infrastructure\nThe service can be attacked by:\n A user  buffer overflow, SQL injection, and privilege escalation are the common types of attacks\nThe cloud infrastructure  the most serious line of attack; Limiting access to resources, privilege-related attacks, data distortion, injecting additional operations\nThe cloud infrastructure can be attacked by:\nA user  targets the cloud control system\nA service  requesting an excessive amount of resources and causing the exhaustion of the resources\n32\nThreat Modeling\n33\nThreat model - a framework which details internal and external vulnerabilities, as well as objectives and countermeasures\n\nFive major threat modeling steps:\n Defining security requirements\n Creating an application diagram \n Identifying threats \n Mitigating threats\n Validating that threats have been mitigated \n\n\nThreat Models\n34\nMicrosoft STRIDE\nhttps://www.microsoft.com/en-us/securityengineering/sdl/threatmodeling\n\n\nFundamental Security Design Principles\n35\nDespite years of research and development, it has not been possible to develop security design and implementation techniques that systematically exclude security flaws and prevent all unauthorized actions\nIn the absence of such foolproof techniques, it is useful to have a set of widely agreed design principles that can guide the development of protection mechanisms [NSA/DHS Proposed]\nSecurity Design Principles\nEconomy of mechanism\nDesign of security measures embodied in both hardware and software should be as simple and small as possible\nThe motivation for this principle is that - small design is easier to test and verify thoroughly; complexity complicates management\nFail-safe defaults\nAccess decisions should be based on permission rather than exclusion\nDefault situation is lack of access, and the protection scheme identifies conditions under which access is permitted\nComplete mediation\nEvery access must be checked against the access control mechanism\nSystems should not rely on access decisions retrieved from a cache\nOpen design\nDesign of a security mechanism should be open rather than secret\nFor example, although encryption keys must be secret, encryption algorithms should be open to public scrutiny\n\n\n\n\n\n36\nSecurity Design Principles (2)\nSeparation of privilege\nA practice in which multiple privilege attributes are required to achieve access to a restricted resource\nE.g., multifactor user authentication, which requires a password and a smart device, to authorize a user\nLeast privilege\nEvery process and every user of the system should operate using the least set of privileges necessary to perform the task\nE.g., use of this principle can be seen in role-based access control\nLeast common mechanism\nDesign should minimize the functions shared by different users, providing mutual security\nThis principle helps reduce the number of unintended communication paths\nPsychological acceptability\nSecurity mechanisms should not interfere unduly with the work of users, while at the same time meeting the needs of those who authorize access\nIf security mechanisms hinder the usability or accessibility of resources, users may opt to turn off those mechanisms\n\n\n\n\n\n37\nSecurity Design Principles (3)\nIsolation\nPublic access systems should be isolated from critical resources (data, processes, etc.) to prevent disclosure or tampering\nIn cases where the sensitivity or criticality of the information is high, limit the number of systems on which that data are stored \nEncapsulation\nA specific form of isolation based on object-oriented functionality\nProtection by encapsulating a collection of procedures and data objects so that they may be called only at designated domain entry points \nModularity\nDevelopment of security functions as separate, protected modules and use of a modular architecture for mechanism design and practice\nLayering\nUse of multiple, overlapping protection approaches addressing the people, technology, and operational aspects of information systems\nLeast astonishment\nA program or user interface should always respond in the way that is least likely to astonish the user\nFor example, the mechanism for authorization should be transparent enough to a user that the user has a good intuitive understanding of the security goals\n\n\n\n\n\n38\nOpen Science is also vulnerable to cyber attacks!\n39\nOpen Science Cyber Risk Profile - http://trustedci.github.io/OSCRP/OSCRP.html \nThreat Model Example – Bioinformatics Workflow\nSoyKB: Distributed Computing\n40\nSEED Lab 1: Packet Sniffing and Spoofing Walkthrough\u000b\u000b\nSubmission Due: Jan 31st \n42\nNetwork, IoT, and Cybersecurity Lab \n(EagleCyberNest @ HE 303)\nIs Hiring!!!\n43\nNetwork, IoT, and Cybersecurity Research Lab \u000b\nWe’re the 1st student research lab focus on network and cybersecurity in the computing and software engineering department!!!\nThis research job counts for FGCU service-learning hours!\nWe have tons of network devices and resources (e.g., routers, switches, racks, high-speed network)!!!\nWe even have drones!\nCome and join us! Email your resume now! cqu@fgcu.edu \n"
}