{
  "filename": "Module 5 - Cloud and IoT Security.pptx",
  "text": "CEN 3078 Computer Security\nModule 5 – Cloud and IoT Security\n2\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n3\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n\nThe Story of Amazon EC2\n\nAmazon wanted to utilize their resources more efficiently\nSo that developers wouldn't need to procure hardware\nCloud means they didn't need to provision dedicated resource capacity for each type of system \nThey just needed to pull from the resource pool\nStill, there was a need for sufficient peak capacity (such as during holidays), so a large amount of hardware wasn't in use every day.\nRenting out spare capacity (EC2)\nThe public AWS is a separate project, not leasing core capabilities, but all of Amazon's business runs on top of it\n4\nResource Pools\nComputing Resources\nStorage Resources\nNetwork Resources\n5\n\nWhat is Cloud Computing?\nApplications and commodity computing resources (storage, CPU, networking, etc.) are separated in the cloud model. So the idea of managing actually servers and provisioning storage and dealing with network connectivity is no longer an issue.\nAnother aspect of cloud computing is flexibility, since computing resources are organized into “pools” this allows customers to buy what they need. However they want to buy it.\nThese so-called pools can be instantly provisioned and rolled-out (or deprovisioned and taken offline) meaning there aren’t constraints to how quickly the infrastructure can be changed.\nCloud resources can be scaled up and/or down with ease, providing a customer the ability to scale their environment based on usage, not based on hardware.\n\n\n\n\nPotential benefits\nOf Cloud Computing \n\nNo Capital Expenditures\nMore Agility\nUnbounded Scale\nImproved Resource Utilization\nCustomer-controlled Migration\nResilience\nPay for Use \nAgility Resiliency Economics\n7\nNIST Cloud Computing Model\n8\n\nEssential Characteristics\n\nMeasured Service\nBroad Network Access\nRapid Elasticity\nOn-Demand Self-Service\nResource Pooling\nStandard clients, like mobile phones, laptops and desktop computers\nTraditional software services\nThere shouldn’t be any restrictions in terms of access via cloud-based software services either.\n\nBroad Network Access\nRapid Elasticity\nMeasured Service\nOn-Demand Self-Service\nResource Pooling\nTo the customer, the capabilities available for provisioning often appear to be unlimited \n\nCan be purchased in any quantity at any time. This applies to both scaling and contracting the infrastructure at any time.\nEssential Characteristics\n\nAutomated control and optimization of resource usage\nLeveraging some level of abstraction in measurement capability\nUtility computing - paying only for the portion you use\nEssential Characteristics\nBroad Network Access\nRapid Elasticity\nMeasured Service\nOn-Demand Self-Service\nResource Pooling\n\nUsers can automatically provision computing capabilities such as server time and network storage as needed, without the need for manual interaction with the provider.\nEssential Characteristics\nBroad Network Access\nRapid Elasticity\nMeasured Service\nOn-Demand Self-Service\nResource Pooling\n\nEssential Characteristics\nBroad Network Access\nRapid Elasticity\nMeasured Service\nOn-Demand Self-Service\nResource Pooling\nResources are pooled and provided to multiple clients in a multi-tenant model. \nDifferent physical and virtual resources are used. \nLocation independence Customers cannot control the exact location of resources.\nCloud Service\n\n     \nThe SPI stack. \nS for Software as a Service. \nP for Platform as a Service. \nI for Infrastructure as a Service. \nInfrastructure as a Service(IaaS)\nThe customer then can install its own software or interact with the computing infrastructure via a set of abstractions and/or APIs.\n\nThe consumer does not manage or control the underlying cloud infrastructure but has control over operating systems, storage, deployed applications, and possibly limited control of select networking components (e.g., host firewalls).\n15\nSimplified IaaS Architecture\n\n16\nPlatform as a Service(PaaS)\n\nApplication development frameworks, middleware capabilities, as well as functionalities like databases, messaging, queues, etc.\nDeploying services created or acquired by users to cloud infrastructure\nCreating applications using programming languages and tools supported by cloud providers\n17\nSimplified PaaS Architecture\n\n18\nSoftware as a Service(SaaS)\nUsers utilize applications provided by service providers.\nSaaS doesn't necessarily have to run on IaaS or PaaS, but still needs to have basic cloud characteristics.\nUsers cannot manage or control the underlying infrastructure including networks, servers, operating systems, storage, or even individual application capabilities.\n\n19\nSimplified SaaS Architecture\n21\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n\nmacro layers \n\n22\n23\n24\n\nmacro layers \nSecurity Suggestions \n\nSuggestions on Virtual Infrastructure\n\n\nIt's preferable to use SDN if available.\nUtilize SDN functionality for multiple virtual networks and multiple cloud accounts/segments to enhance network isolation.\nIndependent accounts and virtual networks greatly limit the scope of harm compared to traditional data centers.\nImplement default deny on cloud firewalls.\nBase cloud firewall policies on each workload rather than per network application.\nUse cloud firewall policies to restrict communication between workloads within the same virtual subnet as much as possible, such as using security groups.\n26\nSuggestions on Fundamental Resources\n\n\nStore logs externally from the workload.\n\nUnderstand and comply with the cloud provider's limitations on vulnerability assessments and penetration testing.\nDisable remote access.\nIntegrate security testing into the image creation process.\nSet up alerts and file integrity monitoring.\nPatch by updating images rather than directly patching running instances.\nSelect security agents that are cloud-aware and minimize performance impact.\nMaintain security controls for long-running workloads using tools that can identify the cloud environment.\n27\n\n\nSuggestions on Management Plane\n\nEnsure that API gateways and web consoles have sufficient perimeter security.\n\nUtilize strong authentication and multi-factor authentication.\n\nStrictly control the credentials of the main account holder/root account and consider dual authorization access to them.\n\nEstablishing multiple accounts with your provider will help with account granularity and limit the scope of harm (using IaaS and PaaS).\n28\n29\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n\nWhy Cloud Storage\nAll data ultimately needs to be stored on physical devices, but cloud platforms abstract and build storage pools through various types of data storage virtualization.\nThis type of storage can present the same functionality as traditional storage, but underneath the surface, it's completely different technology.\nJust like SDN, the focus of security concerns is on access control, encryption, and proper configuration.\n\n\n\n30\nAccess and Location \n\n31\nMap Life Cycle to Matrix\n32\nUnderstand the unique capabilities of the cloud platform you are using.\n\nDon't overlook data security from the cloud provider. In many cases, it's more secure and cost-effective than self-building.\n\nCreate an authorization matrix for access control decisions. There are significant differences in execution capabilities based on the cloud provider's abilities.\n\nSelect appropriate encryption options based on threat models tailored to data, business, and technical requirements.\nCloud Storage Security - Suggestions\n33\nConsider using provider-managed encryption and storage options. Use user-managed keys where possible.\nLeverage architecture to enhance data security. Don't rely solely on access control and encryption.\nEnsure that API and data-level monitoring are properly implemented, and logs meet compliance and lifecycle policy requirements.\nCloud Storage Security – Suggestions – Cont.\n34\n35\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n36\n37\n38\n39\n40\n41\n42\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\nRelated Technologies\u000bIntroduction\n43\n44\n\n\n45\n\n\n46\n\n\n47\n\n\n\n\n\n\n\n\n\nIntroduction – what is IoT?\nThe Internet of things (IoT) is a system of interrelated computing devices, mechanical and digital machines, objects, animals or people that are provided with unique identifiers ( UIDs ) and the ability to transfer data over a network without requiring human-to-human or human-to-computer interaction  - IoTAgenda\nA thing in the IoT can be a person with a heart monitor implant, a farm animal with a biochip transponder, an automobile that has built-in sensors to alert the driver when tire pressure is low or any other natural or man-made object that can be assigned an IP address and is able to transfer data over a network.\nIoT is a sensor network of billions of smart devices that connect people, systems and other applications to collect and share data.\n\n48\n49\nIntroduction – cont’d\nIoT is a concept of connecting any device with an on and off switch to the Internet (and/or to each other). This includes everything from cellphones, coffee makers, washing machines, headphones, lamps, wearable devices and almost anything else you can think of.  This also applies to components of machines, for example a jet engine of an airplane or the drill of an oil rig – Forbes. \nThe IoT is a giant network of connected \"things\" (which also includes people).  The relationship will be between people-people, people-things, and things-things.\nThe dominant consumer IoT device, worldwide, is the smart TV. Between 25-35% cent of consumers worldwide own a television that can connect to the Internet, according to a Deloitte research. However, other areas of the IoT market are growing rapidly.\n50\nBenefits of IoT\nIoT offers a number of benefits to organizations, enabling them to:\nMonitor their overall business processes;\nImprove the customer experience;\nSave time and money;\nEnhance employee productivity;\nIntegrate and adapt business models;\nMake better business decisions; and\nGenerate more revenue.\n\n51\nThe smart world of the future – using Iot\nSource: https://www.forbes.com/sites/jacobmorgan/2014/05/13/simple-explanation-internet-things-that-anyone-can-understand/#ef2433f1d091 \n52\nSmart farming: Use of iot to improve agriculture\nIn IoT-based smart farming, a system is built for monitoring the crop field with the help of sensors (light, humidity, temperature, soil moisture, etc.) and automating the irrigation system. The farmers can monitor the field conditions from anywhere. This is highly efficient compared to the traditional/conventional approach.\nIn terms of environmental issues, IoT-based smart farming provides great benefits including:  better and efficient water usage, and optimization of inputs and treatments.\nTherefore, smart farming based on IoT technologies enables growers and farmers to reduce waste and enhance productivity. \nSome of the IoT applications in this area are:\nPrecision farming\nAgricultural drones\nLivestock monitoring\nSmart greenhouses\n\n53\nIndustrial Iot (iiot)\nIndustrial IoT (IIoT) focusses on the use of cyber-physical systems to monitor the physical factory processes and make data-based automated decisions.\nWhile the physical systems are made the intelligent using IoT, the real-time communication, and cooperation both with each other and with humans is established via the wireless web\nIIoT brings in the concept of ‘a connected factory leads to a smart factory’.\n54\nIiot in manufacturing\nDigital/connected factory: IoT enabled machinery can transmit operational information to the partners like original equipment manufacturers and to field engineers. \nFacility management: The use of IoT sensors in manufacturing equipment enables condition-based maintenance alerts.\nProduction flow monitoring: IoT in manufacturing can enable the monitoring of production lines starting from the refining process down to the packaging of final products.\nInventory management: IoT applications permit the monitoring of events across a supply chain.\n\n\n\n55\nIiot in manufacturing (cont’d)\nPlant Safety and Security: IoT combined big data analysis can improve the overall workers’ safety and security in the plant. . \nQuality control: IoT sensors collect aggregate product data and other third-party syndicated data from various stages of a product cycle.\nPackaging Optimization: By using IoT sensors in products and/or packaging, manufacturers can gain insights into the usage patterns and handling of product from multiple customers.\nLogistics and Supply Chain Optimization: The Industrial IoT (IIoT) can provide access to real-time supply chain information by tracking materials, equipment, and products as they move through the supply chain.\n\n\n\n56\nIOT CHALLENGES\nSecurity, privacy and data sharing issues\nBecause IoT devices are closely connected, all a hacker has to do is exploit one vulnerability to manipulate all the data, rendering it unusable. And manufacturers that don't update their devices regularly -- or at all -- leave them vulnerable to cybercriminals.\nHowever, hackers aren't the only threat to the internet of things; privacy is another major concern for IoT users. For instance, companies that make and distribute consumer IoT devices could use those devices to obtain and sell users' personal data.\nChallenges with IIoT:\nSecurity of data – same as above\nReliability and stability – of IIoT sensors\nConnectivity of all the systems in IIoT setup – no maintenance envisioned?\nBlending legacy systems – IIoT is new in the market\n57\nModule 5 – Cloud and IoT Security\n\nIntroduction to Cloud Computing\nSecurity on Cloud Services\nCloud Storage Security\nCloud Application Security and Access Control\nIntroduction to Internet of Things\nIoT Security and Cloud\n58\nFamous Talk\n"
}