{
  "filename": "Module 2 - Application and Network Attacks - Part 2.pptx",
  "text": "CEN 3078 Computer Security\nModule 2 – Application and Network Attacks\n\n\n2\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \n3\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\n4\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nSYN Flooding Attack\nIdea : To fill the queue storing the half-open connections so that there will be no space to store TCB for any new half-open connection, basically the server cannot accept any new SYN packets.\n\nSteps to achieve this : Continuously send a lot of SYN packets to the server. This consumes the space in the queue by inserting the TCB record\nDo not finish the 3rd step of handshake as it will dequeue the TCB record\nWhen flooding the server with SYN packets, attackers use random source IP addresses; otherwise the attacks may be blocked by the firewalls…\n5\nLaunching SYN Flooding Attack \u000b– Before Attacking\nTCP States\nLISTEN: waiting for TCP connection.\nESTABLISHED: completed 3-way handshake\nSYN_RECV: half-open connections\n\nCheck the TCP states\n6\nSYN Flooding Attack – Launch the Attack\nTurn off the SYN Cookie countermeasure:\n   $sudo sysctl -w net.ipv4.tcp_syncookies=0\nLaunch the attack using netwox\nResult\nTargeting telnet server port 23 with SYN packets\n7\nNOTE: In your SEED Lab-2, you will use Scapy for launching a SYN Flooding attack\nNote ssh at server port 22 will still work, but not telnet\nSYN Flooding Attack - Results\nUsing netstat command, we can see that there are a large number of half-open connections on port 23 with random source IPs\nUsing top command, we can see that CPU usage is not high on the server machine. The server is alive and can perform other functions normally, but cannot accept telnet connections only\n\n\n\n8\nCountermeasures: SYN Cookies\nAfter a server receives a SYN packet, it calculates a keyed hash (H) from the information in the packet using a secret key that is only known to the server\nThis hash (H) is sent to the client as the initial sequence number from the server. H is called SYN cookie\nThe server will not store the half-open connection in its queue when SYN Cookie kicks-in after a certain number of SYN packets are received; instead information is put in the packet to see if it is a real connection to get information back\nIf the client is an attacker, H will not reach the attacker\nIf the client is not an attacker, it sends H+1 in the acknowledgement field\nThe server checks if the number in the acknowledgement field is valid or not by recalculating the cookie\n9\n10\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Reset Attack\nTo disconnect a TCP connection gracefully :\n\nA sends out a “FIN” packet to B\nB replies with an “ACK” packet. This closes the A-to-B communication\nNow, B sends a “FIN” packet to A and A replies with “ACK”\n\nUsing Reset flag (another way to terminate connection between A & B in abnormal/urgent situations) :\n\nOne of the parties sends RST packet to immediately break the connection\n11\nTCP Reset Attack\nGoal: To break up a TCP connection between A and B\n\nSpoofed RST Packet: The following fields need to be set correctly:\nSource IP address, Source Port, Destination IP address, Destination Port (i.e., 4-Tuple to identify a TCP connection) \nSequence number (within the receiver’s window)\n12\nFun fact: This tampering technique can be used by a firewall or abused by a malicious attacker to interrupt Internet connections.\nThe Great Firewall of China, and Iranian Internet censors are known to use TCP reset attacks to interfere with and block connections as a major method to carry out Internet censorship.\n13\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nMaintaining user/server state: cookies\nRecall:  HTTP GET/response interaction is stateless\nno notion of multi-step exchanges of HTTP messages to complete a Web “transaction” \nno need for client/server to track “state” of multi-step exchange\nall HTTP requests are independent of each other\nno need for client/server to “recover” from a partially-completed-but-never-completely-completed transaction\na stateful protocol: client makes two changes to X, or none at all\n\n\ntime\ntime\n\nX\nt’\nQ: what happens if network connection or client crashes at t’ ?\nApplication Layer: 2-14\nMaintaining user/server state: cookies\nWeb sites and client browser  use cookies to maintain some state between transactions\nfour components:\n1) cookie header line of HTTP response message\n2) cookie header line in next HTTP request message\n3) cookie file kept on user’s host, managed by user’s browser\n4) back-end database at Web site\nExample:\nSusan uses browser on laptop, visits specific e-commerce site for first time\nwhen initial HTTP requests arrives at site, site creates: \nunique ID (aka “cookie”)\nentry in backend database for ID\nsubsequent HTTP requests from Susan to this site will contain cookie ID value, allowing site to “identify” Susan\nApplication Layer: 2-15\nMaintaining user/server state: cookies\nclient\nAmazon server\ncookie file\none week later:\nbackend\ndatabase\n\n\ntime\n\ntime\nApplication Layer: 2-16\nHTTP cookies: comments\nWhat cookies can be used for:\nauthorization\nshopping carts\nrecommendations\nuser session state (Web e-mail)\ncookies and privacy:\ncookies permit sites to learn a lot about you on their site.\nthird party persistent cookies (tracking cookies) allow common identity (cookie value) to be tracked across multiple web sites\naside\nChallenge: How to keep state?\nat protocol endpoints: maintain state at sender/receiver over multiple transactions\nin messages: cookies in HTTP messages carry state\nApplication Layer: 2-17\nExample:  displaying a NY Times web page\nnytimes.com\nAdX.com\nNY times page with embedded ad displayed\nnytimes.com (sports)\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nCookies: tracking a user’s browsing behavior\nCookies: tracking a user’s browsing behavior\nnytimes.com\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nsocks.com\n7493: socks.com, 2/16/22\n\nAdX:\ntracks my web browsing over sites with AdX ads\ncan return targeted ads based on browsing history\nCookies: tracking a user’s browsing behavior (one day later)\nnytimes.com (arts)\nAdX.com\n1634: sports, 2/15/22\nNY Times: 1634\n7493: NY Times sports, 2/15/22\nAdX: 7493\nsocks.com\n7493: socks.com, 2/16/22\n\n\n1634: arts, 2/17/22\n7493: NY Times arts, 2/15/22\nReturned ad for socks!\n GDPR (EU General Data Protection Regulation) and cookies\n“Natural persons may be associated with online identifiers […] such as internet protocol addresses, cookie identifiers or other identifiers […].\nThis may leave traces which, in particular when combined with unique identifiers and other information received by the servers, may be used to create profiles of the natural persons and identify them.”\n\n\nGDPR, recital 30 (May 2018)\n23\nModule 2\nAttacks on the TCP protocol\nAttack on connect – TCP SYN Flooding\nAttack to terminate -  TCP Reset Attack\nUnderstanding Cookies\nAttack during session – TCP Hijacking Attack\nTCP Session Hijacking Attack\nGoal: To inject data in an established connection.\n(This is different from the DoS attack in TCP SYN Flooding or Reset)\n\nSpoofed TCP Packet: The following fields need to be set correctly:\nSource IP address, Source Port, \nDestination IP address, Destination Port\nSequence number (within the receiver’s window)\n\n\n24\nTCP Session Hijacking Attack Examples\nZoom bombing\nDuring the Covid-19 pandemic, the world turned to video conferencing apps like Zoom. These apps became a popular target of session hijackers, even earning the nickname ‘zoom bombing’. There were news reports of session hijackers joining private video sessions, in some cases shouting profanities, hateful language and sharing pornographic images. In response, Zoom introduced greater privacy protections to minimize the risk.\nSlack\nIn 2019, a researcher on a bug bounty platform identified a vulnerability in Slack which allowed attackers to force users into fake session redirects so they could steal their session cookies. This gave attackers access to any data shared within Slack (which for many organizations, can be significant). Slack was quick to respond and patched the vulnerability within 24 hours of the researcher highlighting it.\n\n25\nDefending Against Session Hijacking\nMaking it difficult for attackers to spoof packets\nRandomize source port number\nRandomize initial sequence number \n\nNote: Randomization is NOT effective against local attacks that can sniff packets and determine this information \n\nEncrypting payload\n26\n27\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nDenial-of-Service (DoS) Attack\n28\nA denial of service (DoS) is an action that prevents or impairs the authorized use of networks, systems, or applications by exhausting resources such as central processing units (CPU), memory, bandwidth, and disk space\nA form of attack on the availability of a service; focus is generally on network services that are attacked over their network connection\n\nDoS Attack - Facts\nOne of the most common types of attacks\nAims to prevent users from accessing system\nRequires a minimum of technical skill\nEffective because computers and other systems have physical limitations\nNumber of simultaneous users\nSize of files\nSpeed of data transmission\nAmount of data stored\n\n29\nCommon Tools Used for DoS Attacks\n30\nLow Orbit Ion Cannon (LOIC)\nCommon Tools Used for DoS Attacks\n31\nHigh Orbit Ion Cannon (HOIC)\nSEED Lab 2: TCP attacks Walkthrough\u000b\u000b\nSubmission Due: Feb. 16th\n"
}