{
  "filename": "Module 2 - Application and Network Attacks - Part 3.pptx",
  "text": "CEN 3078 Computer Security\nModule 2 – Application and Network Attacks\n\n\nSEED Lab 2: TCP attacks Walkthrough\u000b\u000b\nSubmission Due: Feb. 18th\n3\nModule 2\nTCP fundamental\nAttacks on the TCP protocol\nDenial-of-Service attack\nSQL injection attack\nCross-side scripting attack\nMiscellaneous: Heartbleed bug and attack, Ransomware, Cryptojacking \nDenial-of-Service (DoS) Attack\n4\nA denial of service (DoS) is an action that prevents or impairs the authorized use of networks, systems, or applications by exhausting resources such as central processing units (CPU), memory, bandwidth, and disk space\nA form of attack on the availability of a service; focus is generally on network services that are attacked over their network connection\n\nDoS Attack - Facts\nOne of the most common types of attacks\nAims to prevent users from accessing system\nRequires a minimum of technical skill\nEffective because computers and other systems have physical limitations\nNumber of simultaneous users\nSize of files\nSpeed of data transmission\nAmount of data stored\n\n5\nCommon Tools Used for DoS Attacks\n6\nLow Orbit Ion Cannon (LOIC)\nCommon Tools Used for DoS Attacks\n7\nHigh Orbit Ion Cannon (HOIC)\nDenial-of-Service (DoS) Attack Categories\n8\nClassic DoS Attacks\nFlooding ping command\nAim of this attack is to overwhelm the capacity of the network connection to the target organization\nTraffic can be handled by higher capacity links on the path, but packets are discarded as capacity decreases\nSource of the attack is clearly identified (e.g., in ICMP echo request) unless a spoofed address is used - attacker might use a large company’s Web server to target a medium-sized company with a lower-capacity network connection\nNetwork performance is noticeably affected\nDefense: Load balancers, firewalls\n\n\n9\nFlooding Attacks\nClassified based on network protocol used\nIntent is to overload the network capacity on some link to a server\nVirtually any type of network packet can be used\n\n\n\n10\nDistributed DoS (DDoS) Attacks\nUse of multiple systems to generate flooding attacks\nAttacker uses a flaw in operating system or in a common application to gain access and installs their zombie program on it \nLarge collections of such systems under the control of one attacker’s control can be created, forming a botnet\n\n\n11\nHypertext Transfer Protocol (HTTP) Based Attacks\n12\nHTTP flood attack\nAttack that bombards Web servers with HTTP requests\nConsumes considerable resources\nSpidering - Bots start from a given HTTP link and follow all links on the provided Web site in a recursive way \nSlowloris attack\nAttempts to monopolize a server’s multi-threading by sending HTTP requests that never complete\nEventually consumes Web server’s connection capacity\nUtilizes legitimate HTTP traffic\nExisting intrusion detection and prevention solutions that rely on signatures to detect attacks will generally not recognize Slowloris\nRate limiting number of host connections can help defend or delayed binding can be done by a load balancer to ensure web server or proxy will not see incomplete requests\n\n\n\n\nDNS Reflection Attack\nReflector attack establishes a self-contained loop between the intermediary and the target system; Both systems act as reflectors\nMost reflector attacks can be prevented through network-based and host-based firewall rulesets that reject suspicious combinations of source and destination ports\n\n\n13\nNormal DNS Operation\nDNS Operation under Attack\nThe DNS client sends a query from its UDP port 1792 to the server’s DNS port 53 to obtain the IP address of a domain name. The DNS server sends a UDP response packet including the IP address. \nThe attacker sends a query to the DNS server with a spoofed IP source address of j.k.l.m; this is the IP address of the target. The attacker uses port 7, which is usually associated with echo, a reflector service. The DNS server then sends a response to the victim of the attack, j.k.l.m, addressed to port 7. If the victim is offering the echo service, it may create a packet that echoes the received data back to the DNS server. This can cause a loop between the DNS server and the victim.\nAmplification Attacks\n14\nThey are a variant of reflector attacks and also involve sending a packet with a spoofed source address for the target system to intermediaries\nThey differ in generating multiple response packets for each original packet sent; this can be achieved by directing the original request to the broadcast address for some network; as a result, all hosts on that network can potentially respond to the request, generating a flood of responses to a victim (spoofed) IP address\nIt is only necessary to use a service handled by large numbers of hosts on the intermediate network; the well-known Smurf DoS program used ping flood mechanism using ICMP echo request packets\nThe best additional defense against this form of attack is to not allow directed broadcasts to be routed into a network from outside\n\n\nAmplification Attacks cont.\n15\nSmurf Attack\nDNS Amplification Attack\n16\nUse packets directed at a legitimate DNS server as the intermediary system\n\nAttacker creates a series of DNS requests containing the spoofed source address of the target system\n\nExploit DNS behavior to convert a small request to a much larger response (amplification)\n\nTarget is flooded with responses\n\nBasic defense against this attack is to prevent the use of spoofed source addresses\n\n\n\n\n\nAnother way to category DDoS\nVolume Based Attacks\u000bIncludes UDP floods, ICMP floods, and other spoofed-packet floods. The attack’s goal is to saturate the bandwidth of the attacked site, and magnitude is measured in bits per second (Bps).\nProtocol Attacks \u000bIncludes SYN floods, fragmented packet attacks, Ping of Death, Smurf DDoS, and more. This type of attack consumes actual server resources, or those of intermediate communication equipment, such as firewalls and load balancers, and is measured in packets per second (Pps).\nApplication Layer Attacks \u000bIncludes HTTP Based Attacks, attacks that target Apache, Windows, or OpenBSD vulnerabilities, and more. Comprised of seemingly legitimate and innocent requests, these attacks aim to crash the web server, and the magnitude is measured in Requests per second (Rps).\n\n17\nReal-World Examples of DoS Attacks\nGoogle Attack\nAWS (Amazon Web Services) Attack\nMemcache Attacks\nMirai\n\n18\nFour lines of DDoS Attack Defense\n19\nDDoS Attack Prevention\n20\nBlock spoofed source addresses\nOn routers as close to source as possible\nFilters may be used to ensure path back to the claimed source address is the one being used by the current packet\nFilters must be applied to traffic before it leaves the ISP’s network or at the point of entry to their network\nUse modified TCP connection handling code\nCryptographically encode critical information in a cookie that is sent as the server’s initial sequence number\nLegitimate client responds with an ACK packet containing the incremented sequence number cookie\nDrop an entry for an incomplete connection from the TCP connections table when it overflows\n\n\n\n\n\n\nDDoS Attack Prevention (2)\n21\nBlock IP directed broadcasts\n\nBlock suspicious services and combinations\n\nManage application attacks with a form of graphical puzzle (captcha) to distinguish legitimate human requests\n\nGood general system security practices\n\nUse mirrored and replicated servers when high-performance and reliability is required\n\n\n\n\n\nResponding to DoS Attacks\n22\nAntispoofing, directed broadcast, and rate limiting filters should have been implemented \n\nIdeally have network monitors and IDS to detect and notify abnormal traffic patterns\n\n\n\n\n\n\n\nResponding to DoS Attacks\n23\nIdentify type of attack\nCapture and analyze packets \nDesign filters to block attack traffic upstream\nOr identify and correct system/application bug\nHave ISP trace packet flow back to source\nMay be difficult and time consuming\nNecessary if planning legal action\nImplement contingency plan\nSwitch to alternate backup servers\nCommission new servers at a new site with new addresses\nUpdate incident response plan\nAnalyze the attack and the response for future handling\n\n\n\n\n\nMoving Target Defense\n24\nMoving target defense (MTD) is the concept of controlling change across multiple systems by moving around VMs hosting services \nMTD focuses on enabling safe operation in a compromised environment, rather than trying to create a perfectly secure environment\n\n\n\n\n\n\n\nMTD System Model\nMalicious and regular users accessing the services hosted by a target VM\nAuthentication server to direct users to entitled services in VMs\nOpen flow controller to detect attack, run MTD logic, and perform migration\nOnly regular users redirected to new VM\n\n25\nMTD Controller Architecture\n26\nThree Big Questions\nWhere to move?\nFinding the optimal candidate VM to migrate\nIdentifying the most pertinent VM selection factors and their relative importance to create migration logic\nPeriodic/on-demand information collection\nWhen to move?\nFinding the optimal frequency of movement\nNot too frequent as migration incurs cost, and not too seldom as increases probability of getting attacked\nHow to move?\nMostly pertains to implementation issues\nProactive/reactive migration execution\nRuntime migration or file copy\nRedirection of regular users\n27\nHow to Defend Against DoS Attacks – On your own?\nIn addition to previously mentioned methods…\nConfigure your firewall to \nFilter out incoming ICMP packets\nDisallow any incoming traffic\nUse tools such as NetStat and others\nDisallow traffic not originating within the network\nDisable all IP broadcasts\nFilter for external and internal IP addresses\nKeep AV signatures, OS, and software patches current\nHave an Acceptable Use Policy\n\n\n\nSummary\nDoS attacks are among the most common attacks on the Internet\nDoS attacks are unsophisticated\nDoS attacks can have devastating effects\nYour task is constant vigilance and protection strategy\n\n"
}