{
  "filename": "Module 3 - Defense Architectures and Design - Part 3.pptx",
  "text": "CEN 3078 Computer Security\nModule 3 – Defense Architectures and Design\n\n2\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\n3\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\nThe Need For Firewalls\n4\nInternet connectivity is essential\nHowever it creates a threat\n\nEffective means of protecting LANs\n\nInserted between the premises network and the Internet to establish a controlled link\nCan be a single computer system or a set of two or more systems working together\n\nUsed as a perimeter defense\nSingle choke point to impose security and auditing \nInsulates the internal systems from external networks\n\nFirewall Characteristics\n5\nDesign Goals:\nAll traffic from inside to outside, and vice versa, must pass through the firewall\n\nOnly authorized traffic as defined by the local security policy will be allowed to pass\n\nThe firewall itself is immune to penetration\nNot always true\n\nThe firewall of a large-sized enterprise network can typically have a ruleset or ACL (Access Control List) comprising 10K+ rules\nLast-matching rules are located at the bottom of the ruleset and consume the most CPU processing power of firewalls\nIf these rules get discovered by an attacker, the attacker can effectively launch a low-rate DoS attack that can bring the firewall to its knees\nCountermeasures: Random delay, periodic re-arranging of rules or caching\n\n\n\nK. Salah, K. Sattar, A. Baig, M. Squalli, P. Calyam, “Resiliency of Popular Network Firewalls against Remote Discovery of Last-Matching Rules”, ACM Conference on Security of Information and Networks (SIN), 2009.\nFirewall Access Policy\n6\nA critical component in the planning and implementation of a firewall is specifying a suitable access policy\nThis lists the types of traffic authorized to pass through the firewall\nIncludes address ranges, protocols, applications and content types\n\nThis policy should be developed from the organization’s information security risk assessment and policy\n\nShould be developed from a broad specification of which traffic types the organization needs to support\nThen refined to detail the filter elements which can then be implemented within an appropriate firewall topology\n\n\n\nFirewall Filter Characteristics\n7\nCharacteristics that a firewall access policy could use to filter traffic include (as per NIST SP 800-41):\n\n\nFirewall Capabilities and Limits\n8\nCapabilities:\n\tDefines a single choke point\n\tProvides a location for monitoring security events\n\tConvenient platform for several Internet functions that are not security related\n\tCan serve as the platform for IPSec\nIPSec is a standard suite of protocols between 2 communication points across the IP network that provide data authentication, integrity, and confidentiality; It also defines the encrypted, decrypted and authenticated packets\n\nLimitations:\n\tCannot protect against attacks bypassing firewall\n\tMay not protect fully against internal threats\n\tImproperly secured wireless LAN can be accessed from outside the organization\n\tLaptop, or portable storage device may be infected outside the corporate network then used internally\n\n\n\nTypes of Firewalls\n9\nTypes of Firewalls (2)\n10\nPacket Filtering Firewall\n11\nApplies rules to each incoming and outgoing IP packet \nTypically a list of rules based on matches in the IP or TCP header\nForwards or discards the packet based on rules match\n\n\n\n\n\n\nTwo default policies:\nDiscard - prohibit unless expressly permitted\nMore conservative, controlled, visible to users\nForward - permit unless expressly prohibited\nEasier to manage and use but less secure\n\n\n\n\nPacket Filtering Examples\n12\nDo you see problems with this rule set?\nRule 4 allows external traffic to any destination port above 1023. As an example of an exploit of this rule, an\nexternal attacker can open a connection from the attacker’s port 5150 to an internal Web proxy server on port 8080. This is supposed to be forbidden and could allow an attack on the server.\n\nTo counter this attack, the firewall rule set can be configured with a source port field for each row. For rules 2 and 4, the source port is set to 25; for rules 1 and 3, the source port is set to >1023.\n\nPacket Filtering Advantages and Weaknesses\n13\nAdvantages:\nSimplicity\nTypically transparent to users and are very fast\n\nWeaknesses:\nCannot prevent attacks that employ application specific vulnerabilities or functions\nLimited logging functionality\nDo not support advanced user authentication\nVulnerable to attacks on TCP/IP protocol bugs\nImproper configuration can lead to breaches\n\n\n\n\nTypes of Firewalls\n14\nStateful Inspection Firewall\n15\nExample Stateful Firewall Connection State\n16\nTypes of Firewalls (2)\n17\nApplication-Level Gateway\n18\nAlso called an application proxy\n\nActs as a relay of application-level traffic\nUser contacts gateway using a TCP/IP application\nUser is authenticated\nGateway contacts application on remote host and relays TCP segments between server and user\n\nMust have proxy code for each application\nMay restrict application features supported\n\nTend to be more secure than packet filters\n\nDisadvantage is the additional processing overhead on each connection\n\n\n\n\nCircuit-Level Gateway\n19\nCircuit-level proxy\nSets up two TCP connections, one between itself and a TCP user on an inner host and one on an outside host\nRelays TCP segments from one connection to the other without examining contents\nSecurity function consists of determining which connections will be allowed\n\n\nTypically used when inside users are trusted\nMay use application-level gateway inbound and circuit-level gateway outbound\nLower overheads \n\n\n\n\n\n\n20\nModule 3 – Defense Architectures and Design\n\nNetwork Scanning and Vulnerability Scanning\nDigital Forensics\nCybersecurity Engineering\nSecurity policies\nFirewalls\nAuthentication, Access controls\nFederated trust\nIoT/Cloud middleware\nAuthentication\n21\nThe process of establishing confidence in user identities that are presented electronically to an information system\n\n\n\n\n\n\nIdentification and Authentication Security Requirements\n22\n\n\n\n\n\n\nAuthenticating User Identity - Basis\n23\nMulti-factor Authentication\n24\nMultifactor authentication refers to the use of more than one of the authentication means \nRisk Assessment for User Authentication\n25\n\n\n\n\n\n\nAssurance Level\n26\n\n\n\n\n\n\nPotential Impact\n27\n\n\n\n\n\n\nFIPS 199 defines three levels of potential impact on organizations or individuals should there be a breach of security:\nLow\nAn authentication error could be expected to have a limited adverse effect on organizational operations, organizational assets, or individuals\nModerate\nAn authentication error could be expected to have a serious adverse effect\nHigh \nAn authentication error could be expected to have a severe or catastrophic adverse effect\n\n\n\n\n\n\n\nMaximum Potential Impacts for Each Assurance Level\n28\n\n\n\n\n\n\nPassword Cracking\n29\n\n\n\n\n\n\nBiometric Authentication\n30\n\n\n\n\n\n\nAttempts to authenticate an individual based on unique physical characteristics\n\nBased on pattern recognition\n\nIs technically complex and expensive when compared to passwords and tokens\n\nPhysical characteristics used include:\nFacial characteristics\nFingerprints\nHand geometry\nRetinal pattern \nIris \nSignature \nVoice\n\n\n\n\n\n\nBiometric Authentication – Cost vs. Accuracy\n31\n\n\n\n\n\n\nBiometric Authentication – Process\n32\n\n\n\n\n\n\nAuthentication Security Issues\n33\n\n\n\n\n\n\nPotential Attacks, Susceptible Authenticators, and Typical Defenses \n34\n\n\n\n\n\n\nen·tro·py: lack of order or predictability; gradual decline into disorder\nPotential Attacks, Susceptible Authenticators, and Typical Defenses \n35\n\n\n\n\n\n\n"
}