{
  "filename": "Module 4 - Security Analytics - Part 1.pptx",
  "text": "CEN 3078 Computer Security\nModule 4 – Security Analytics\n\n2\nModule-4: Security Analytics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\n3\nModule-4: Security Analytics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\nCritical Application Infrastructures\nVery large user bases, and web services that benefit societal needs \n4\nHealth Care\nConsumer Apps\nOnline Retail\nAdvanced \nManufacturing\nCloud Computing \nAnd Networking\nGaming\nBalancing resilience (security) and user experience (performance/usability)\n5\nSecurity architectures need to build upon fundamental concepts of cyber security, along with their relevance in on-premise and cloud computing infrastructure for different application contexts…\n\nApplications: Public Safety, Media, Manufacturing, Healthcare, SmartGrid, …\nLightweight and Flexible Security for IoT-based Public Safety Applications\nRecreated disaster scenes of tornado damages (in Joplin, MO 2011) at the: (a) Joplin High School; (b) Joplin Hospital\n6\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\nA. Esquivel, D. Kavzak Ufuktepe, R. Ignatowicz, A. Riddle, C. Qu, P. Calyam, K. Palaniappan, “Enhancing Network-edge Connectivity and Computation Security in Drone Video Analytics”, IEEE Applied Imagery Pattern Recognition (AIPR) Workshop, 2020.\n7\nLightweight and Flexible Security for IoT-based Public Safety Applications\n\nIoT Gateway Middleware that uses machine learning to decide on tradeoffs in energy, latency and security in deciding computing policies at core or edge\n8\nMedia Application: \u000bJust-in-time News Feeds\nRecent shift in news related media consumption trends\nReaders are relying on 'just-in-time news feeds' versus the traditional print medium\nMedia companies are offering ‘just-in-time news’ feed service for their subscribers who pay money for ‘premium’ content\nParticularly popular in sectors such as Finance and Health Care\n\n9\nMedia Application: Anomaly Detection\n10\nUsed to detect anomalies occurring in a network path or server\nRequires collection of profiles or signatures that represent the normal and abnormal behavior \nE.g., number of failed login attempts permissible/occurred for a host, the level of processor usage, and consumed network bandwidth\n\nMedia Application: Anomaly Detection\n11\n“URL Anomaly Detection” checks the abnormality of a URL through detection of the deviation of the character distribution in the received URL string \nTraining Phase:\nHere, the data is trained using some sample URLs\nFrom the URLs, an ASCII map count of each character is generated. This count is used in the Anomaly Detection phase to calculate the String Length Probability and Character Distribution Frequency Probability\nDetection Phase:\nThis phase calculates the Anomaly value for a given input URL\nThe Character Frequency Distribution uses Histogram model to calculate the Frequency Distribution of each character in the given input URL string\nThe Anomaly Score is calculated as -\n\nManufacturing Application \u000bSecurity & Privacy\n12\n“Agile manufacturing” builds on the benefits of cloud computing (e.g., businesses\nDon’t need to invest and manage expensive computing resources or computational solver licenses) \nNeed to bridge the collaboration gap between Manufacturing App Developer and a Cloud Engineer  in “Manufacturing App Marketplaces”\n\nOr AWS, GCP, …\nManufacturing App Marketplace \u000bSecurity Architecture\n13\nHow to secure on-going efforts to scale-up the App Marketplace with user opt-in via a new web-access layer features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to run virtual desktops, and virtual machines for web servers to host the various Apps\n(c) secure storage of results after the computation stages to protect intellectual property of the manufacturers’ App designs and data sets\n(d) Defense against LoC using HoneyFiles (Defense by Pretense)\n\nSmartGrid Application\n14\nWide-area measurement and control systems (WAMCS) technology using Phasor Measurement Units (PMUs) is important\nHelps guarantee resilience, stability, reliability, state estimation, control, and protection of next-generation power systems\nHowever, there is an exponentially increasing number of PMUs and PDCs being deployed in the North American grid\nResult is an explosion in data volume, which needs an efficient wide-area communication and computing infrastructure\nSmartGrid Application\n15\nAs an example for power grids, according to UCAlug Open Smart Grid, every PMU (from a utility company) requires 600 to 1500 Kbps bandwidth, 20 ms to 200 ms latency, almost 100% reliability, and a 24-hour backup\nWAMCS will require cloud computing resources (e.g., storage) and Gigabit per second bandwidth for satisfactory performance and resilience\nChallenges are even more aggravated by the gradual transition from centralized to distributed systems for increased speed of data processing\nWith SDN\nPrivacy and Non-disclosure issues\nSmartGrid Security Architecture\n16\nHow to secure on-going efforts to store and process PMU data with utility companies opt-in via a new web-access layer and software-defined network features?\n(a) an integrated single sign-on authentication\n(b) on-demand/secure access to computation in the cloud to calculate e.g., secure state estimates in the power grids\n(c) secure storage of results after the computation stages to protect intellectual property of the utility company’s data sets\n(d) Defense against LoC attacks using Role-based Access Control\n\nDrone Applications: Security Concerns\n2015: A drone flew into the power line and causes 3 hours of black-out of several hundred houses in West Hollywood, near Los Angeles.\n\n2016: Drone slam into Seattle's Space Needle.\n\n2017: A drone fragment got caught in the front wheel of one of the cyclists, causing him to go over the handlebars.\n\n2017: An accident that happened in 2017 in the Canadian province of Quebec, no eyewitnesses were present to prevent a drone collision. [3]\n\n2019: Drone Crash into Las Vegas Stadium Causes $10K Damage\n\n2021: Drone Slams into Building in World Trade Center\n\n\n\nFig. 1 Worldwide Drone Incidents, drone-related incidents and intrusions from around the world [2]\n[2] https://www.dedrone.com/resources/incidents/all\n[3] https://www.kaspersky.com/blog/drone-incidents/29000/ \nDrone swarms or collaborative drone systems with high-resolution video cameras are used for many operations such as precision agriculture, aerial imaging, and critical applications such as disaster scenarios or rescue response \n\nDrone swarms can also provide and facilitate communication in areas where terrestrial infrastructure is poor or has been destroyed.\nDrone swarms and their integration with cloud/edge infrastructure accomplishing collaborative missions.\n18\nDrone Applications: Security Concerns\nMotivation on Collaborative drone systems \n\nCollaborative drones and IoT play a vital role in supporting a lot of smart city applications such as those involved in communication, transportation, agriculture, safety and security, disaster mitigation, environmental protection, service delivery, energy saving, e-waste reduction, weather monitoring, healthcare, etc. [4]\nFig. 3 Collaborative drone and IoT for improving the smartness of smart cities[7]\n[4] Alsamhi, Saeed H., Ou Ma, Mohammad Samar Ansari, and Faris A. Almalki. \"Survey on collaborative smart drones and internet of things for improving smartness of smart cities.\" Ieee Access 7 (2019).\n19\n\nEnhancing\nNetwork Connectivity\n\nFire detection\n\nTraffic\nControl\nMonitoring\n\nPollution\nMonitoring\n\nAccident\nDetection\n\nSecurity\nAnd\nSurveillance\n\nPacking\nMonitoring\nSecurity and challenges in Collaborative Drone Systems\n\nThe use of these systems has been increasing and the issues related to security, privacy, reliability, regulation, and ownership are also increasing at the same pace [5].\n\nFurthermore, collaborative drone systems are usually resource-constrained, in addition to being highly vulnerable to physical and cyber attacks/threats.\n\nChallenges exist to secure the communication in collaborative drone services in terms of privacy leakage, data confidentiality protection, and the lack of development and implementation of mechanisms for reliable and secure protocols [6].\n[5] Hassija, V., Chamola, V., Agrawal, A., Goyal, A., Luong, N.C., Niyato, D., Yu, F., & Guizani, M. (2021). Fast, Reliable, and Secure Drone Communication: A Comprehensive Survey. \n[6] C. Lin, D. He, N. Kumar, K. R. Choo, A. Vinel, X. Huang, \"Security and Privacy for the Internet of Drones: Challenges and Solutions\", IEEE Communications Magazine, Vol. 56, no. 1, pp. 64-69, 2018.\n20\nAttacks on Drones\n\n21\nDoS\nMITM\nBlack Hole\nAttack Vectors\nThroughput is decreased. The communication between UAVs and the GCS is slowed and eventually, it will go out of service.\nThe attacker changes the GPS location information in the packets causing the target UAV to change its target destination (sending information to another agents, or making it crush to an entity)\nThis malicious node begins to beacon with the other UAVs in the swarm, and show high levels of energy, consistent on the protocol activity, causing the UAV to run out of energy before reaching the destination or accomplishing the task.\nHow these attacks are performed\n\n\n\nZero Trust – One way to solve all\n\n22\n\nDetection\nPrevention\nMitigation\nModeling threats that focus on\n\nCheck for a maliciously high data rate of packers from any UAVs in the network. If a drone is found to be send packets at a rate greater than the threshold, the node is blacklisted from the network and the updated blacklist will be sent to the remaining drones in the network.\n\nCompares the energy levels of the drones in the network with a predetermined energy threshold based on the known energy capabilities of the UAV. If the energy level of a UAV is greater than the threshold, then the node is blacklisted from the network.\n\nApply message authentication by using a hash value for each packet and an algorithm to enforce policies if the message integrity is violated. \n\nZero Trust - Defense Mechanisms\n\n\n\n23\nModule-4: Discussion Topics\nSecurity architectures\nMoving target defense, Defense by pretense\nAnomaly detection\nThreat intelligence collection\nPenetration testing\nRisk assessment and management\n"
}