{
  "filename": "Project Overview.pptx",
  "text": "CEN 3078 Group Project\nRequirements Overview\nFeb. 2025\n2\nLogistics\n5 people in one group\nEach group choose one project topic\n5 Project topics in total\nEach project topic, we will have exactly two groups working on that\nGroup leader must select \nGroup leader MUST join leader meetings and report the process\n3\nMilestones\nMilestone 1: February 25th , each group should provide a research plan document detailing the tasks for each team member in the group. \nMilestone 2 (Presentation Day): March 18th or March 20th , mid-term evaluation presentation. Each group should present their process so far and plans for the final output in the class. Mentors can choose to join.\nMilestone 3 (Presentation Day): April 22nd or April 24th , final presentation. Each group should present their final outputs to the class. Peer evaluation will be given by professors and students. Mentors should join in the presentation and present together with students. \nMilestone 4: April 29th , final report. Each group should submit a final report of the project including a comprehensive description of the project method, algorithm/modeling details, and evaluation output. Mentors can guide the writing of the report.\n4\nTeam leader regular meetings – Meeting 1\nTime: Feb. 21st, 11:00am to 12:00pm\nLocation: Online Teams meeting\nTopics to be covered:\nResearch Plan Progress: Discuss the status of each group’s research plan document.\nTask Allocation: Verify tasks are assigned to individual team members and are well-defined.\nMilestone Planning: Ensure each group has set clear intermediate milestones for their project.\nChallenges: Identify any challenges faced in planning and task delegation.\nNext Steps: Set short-term goals to prepare for Milestone 1 presentation.\n\n5\nTeam leader regular meetings – Meeting 2\nTime: Mar. 14th, 11:00am to 12:00pm\nLocation: Online Teams meeting\nTopics to be covered:\nFeedback Review: Discuss feedback from the research plan presentations.\nProgress Update: Assess whether groups are meeting their intermediate milestones.\nCoordination Issues: Address any coordination challenges or conflicts within teams.\nMid-Term Preparation: Outline expectations for the mid-term evaluation presentation and review draft content.\nSupport Needed: Determine if additional guidance or resources are required.\n\n6\nTeam leader regular meetings – Meeting 3\nTime: Apr. 11th, 11:00am to 12:00pm\nLocation: Online Teams meeting\nTopics to be covered:\nMid-Term Recap: Review progress and feedback from the mid-term evaluation.\nFinal Deliverables: Ensure each group has a clear plan for the final presentation and report.\nPeer Evaluation Prep: Discuss strategies for improving peer evaluations.\nMentor Involvement: Confirm mentors’ roles in final presentations and report writing.\nRisk Assessment: Identify and address any risks that could delay project completion.\n\n\n7\nPresentations\nTwo presentation – Mid-term and Final\nMid-term presentation time: March 18th or March 20th \nFinal presentation time: April 22nd or April 24th \nEVERY team member should present your contributions during the two presentation\nMentors may join to help\nEach presentation worth 50 points, and count for 5 points toward final score.\n\n\n8\nPresentation 1 – Mid-term presentation\nGoal: Present progress so far and plans for final deliverables.\nKey Components:\nRecap of Objectives: Briefly restate project goals.\nAchievements: Share progress made since the research plan.\nChallenges: Discuss difficulties encountered and solutions implemented.\nUpdated Timeline: Adjustments to the project plan.\nPlans for Final Output: Outline final deliverables and next steps.\nDuration: 15 minutes per group.\nEvaluation Criteria:\nContent clarity and relevance.\nDemonstration of progress.\nTeam participation.\n\n9\nPresentation 2 – Final Presentation\nGoal: Showcase final project outputs and results.\nKey Components:\nSummary of Objectives: Restate the project’s purpose.\nFinal Outputs: Demonstrate and explain deliverables.\nEvaluation Results: Highlight performance metrics or findings.\nReflection: Discuss lessons learned and areas for improvement.\nTeam Collaboration: Show how the team worked together.\nDuration: 15 minutes per group.\nEvaluation Criteria:\nQuality and completeness of outputs.\nPresentation organization and flow.\nTeam collaboration and delivery.\n\n10\nProject grading policy – From Syllabus\nWill be based on the type of project but in general breaks down as: \nIndividual Grade: Based on your contribution to the Project and Presentation: 5 pts \nGroup Grade: \nSuccess or detailed analysis of failure of project: 2 pts \nMeetings attended and students display communication: 1 pt \nDetails and citations/examples included: 5 pts \nArtifacts for the project are created, turned in, and make sense: 2 pts\nPresentation: 5 pts\n\n\nPoints given during the presentation.\n11\nFinal Output – 100 points = 10 points to final grade\nComponents of Final Output:\nFinal Presentation Slides:\nClearly summarize project objectives, methods, and findings.\nInclude visuals to support data and results.\nEnsure professional design and organized flow.\nFinal Code:\nFully functional and well-documented.\nIncludes comments to explain key sections.\nOrganized in a repository for easy access and review.\nFinal Report:\nComprehensive description of the project.\nIncludes:\nObjectives and scope.\nDetailed methodology and processes.\nAlgorithm/modeling details.\nChallenges and solutions.\nResults and evaluation metrics.\nReflection on team collaboration and lessons learned.\nMust follow professional formatting and citation standards.\n\nSubmission Deadline: April 29th.\n\n12\nAny questions?\n"
}