{
  "filename": "Project 5 - NCL Competition.pptx",
  "text": "National Cyber League\nCompetition\nFeb. 2025\n2\nNational Cyber League\nCompetition\nWhat is NCL?\nWhy attend NCL?\nTimeline and milestone\nHow I grade?\n\n3\nWhat is NCL?\nThe mission of the NCL Competition is to prepare the next generation of cybersecurity professionals by providing high school and college students, as well as their coaches, an online, safe platform of real-world cybersecurity challenges. We build pathways for students that lead to successful career placements in the cybersecurity field. \n\u000b\nNumber of NCL Players Through the Years\n\u000b\n4\nWho join NCL?\nhttps://cyberskyline.com/data/schools \nYou are representing FGCU!\nYou are the first few teams from FGCU joining the NCL competition!\n\n\n5\nWhy join NCL?\nThe students who participate in the NCL gain practical experience solving real-world challenges and earn a Scouting Report that provides evidence of their capabilities to potential employers. These benefits are uniquely valuable to individuals that are traditionally underrepresented within the cybersecurity industry. Our efforts to deliver these benefits is the primary way that we strive to improve diversity within the workforce. \n6\nThis Year’s NCL Details\n\n7\nNCL as a project\t\nWe will have two teams in our class joining the NCL competition this year.\nEach team have 5 members\nWe will provide bucket tickets for all team members. So, join the competition is FREE!\nYou will also have fully access with a branch of cybersecurity resources, in the NCL practice portal. \n8\nTimeline and Milestones\nTeam leader meetings are also required for NCL teams.\nMilestone 1: Instead of providing project plans, each team member should show me a screenshot on finishing partially practice questions inside their own gym portal.\nMilestone 2: Each team member preparing slides on showing what you’ve learned from the gym. And your plans for the upcoming practice game happening Mar 31st to Apr 6th. As well as individual competition, happening Apr 11th to 13th. \nMilestone 3: Each team member report their rankings, and conclude the good, the bad, and the ugly during the presentation. And detailed the plans for the final team competition, happening Apr 25th to 27th. \nMilestone 4: In the final report, report your team ranking, write a report on describing what’s happening during the team competition.  How many questions have been solved? Why you missed some points? What excited you most? Share your thoughts!\n9\nFinal Report  - Share your team’s stories!\nTell Your NCL Journey:\nIntroduction:\nShare your team's goals and expectations before the competition.\nWhat inspired your participation?\nThe Journey:\nDescribe your experiences during the competition.\nHighlight memorable moments, challenges, and breakthroughs.\nTeam Dynamics:\nHow did your team collaborate?\nShare examples of problem-solving and teamwork.\nLessons Learned:\nReflect on the skills gained, challenges overcome, and personal growth.\nFuture Aspirations:\nHow will this experience shape your future in cybersecurity\n\n10\nMore surprises await you to discover!\n"
}