{
  "filename": "Project 2 - FL-Home System Application.pptx",
  "text": "FL-Home System Application\n\nProblem & Motivation\nSenior citizens, who are often unfamiliar with the complexities of modern cyber security, are particularly vulnerable to cyberattacks.\nPhishing\nMalware\nIdentity theft\nEtc.\n\nThese vulnerabilities not only compromise their personal information but also pose significant risks to their financial and emotional well-being.\nThere is an urgent need for accessible and user-friendly tools that can safeguard this demographic from malicious online activities.\nSolution & Novelty\nA user-friendly app designed to monitor and manage smart home systems for senior citizens.\n\nThe app provides a centralized platform where users can oversee all connected devices, receive alerts about unusual activities, and control device settings to enhance security.\n\nSecurity features include automatic updates and encryption of data transmissions.\n\nThe smart system securely collects via Federated Learning (FL) and analyzes data with from multiple users to identify common settings, preferences, and needs among seniors with specific health conditions.\n\nUtilizes cloud resources such as AWS or Chameleon Cloud to empower machine learning algorithms, training, and testing. \n\nThe app is designed to provide an intuitive interfaces with voice command capabilities, cross-platform support with various IoT applications and systems, and intuitive UI customization to tailor to any user’s appeal and handicap.\nMethods: Tech Stack - Main Application\nFront End: \nReact Native for iOS and Android.\nElectron.js for Desktop.\n\nBack End:\nDjango (Python) for backend API and logic handling.\nApple HomeKit, Google Home, Amazon Smart Home, and other apis \nDatabase:\nCSV for datasets for training models\nObject based Database\nFirebase real-time database features good for updating smart home settings.\nMethods: Tech Stack \u000bBackend System & Algorithms\nCloud Services:\nChameleon Cloud offloading federated learning and hosting resources\nAWS Lambda serverless function for event driven action, e.g. sending alerts\nAWS IoT Core or Azure IoT Hub for storing IoT information and metrics.\n\nSecurity and Communication:\nAES-256 to encrypt transmissions\nSSL/TLS to safely transmit data\nWireshark/Nmap to view into Wi-Fi and monitor network\nSnort or Suricata as a baseline IDS to compare with novelty\n\nMethods: Tech Stack \u000bBackend System & Algorithms Continued\nMachine Learning Algorithm\nFederated Learning framework\nTensorFlow Federated, Pysyft, or FLWR as the possible frameworks due to intuitive apis and compatibility. Possibly TensorFlow.\ngRPC for efficient, secure, and scalable communication\n\nSecurity\nAdversarial Pre-training\nSecure Aggregation\nSecure Multiparty Computing\nDifferential Privacy\n\nUtility\nRegularization (Kernel Regularizer, Dropouts, BatchNormalization)\nModel Pruning (Tmot, pysyft)\n\n\nMethods: Infrastructure of Application\nEdge Devices\nEdge Systems \n& Servers\nCloud Systems \n& Servers\nMachine Learning Framework & Libraries\nPlanned Experiments\nTesting Detection of Network Intrusions with machine learning model and compare against Snort or Suricata.\nMeasures:\nModel Performance such as accuracy, precision, recall, loss, ROC.\nHardware Resource consumption such as CPU utilizing and RAM usage.\n\nTesting Defense Strategies on model against a Network and Data Poisoning attack pipelines.\nMeasures:\nModel Performance such as accuracy, precision, recall, loss, ROC.\nHardware Resource consumption such as CPU utilizing and RAM usage.\nMeasures Network Metrics such as latency, RTT, and Bandwidth.\n\n Testing User Validation and Verification of Visuals and Interactions of the Application Menu and Notifications.\nMeasures:\nSpeed and Performance of the Application and Menu.\nSpeed of Comprehension of the menu and interaction.\nUser Satisfaction.\n"
}