{
  "filename": "Syllabus and Course Introduction.pptx",
  "text": "CEN 3078 Computer Security\nSyllabus and Introduction\n\nSyllabus\n2\nCourse Introduction\n\nOpening Questionnaire\n\n\nQuestion-1) Do you know some coding (e.g., python, java, c++)?\n\nQuestion-2) Do you follow news stories on cyber attacks?\n\nQuestion-3) Have you attended a cybersecurity course in the past?\n\nQuestion-4) Have you or anyone you know experienced a cyber attack incident? \n\nQuestion-5) Do you know about these attacks: Distributed Denial of Service (DDoS), SQL injection or Cross-side scripting (XSS)?\n\u000b\n4\n5\nCritical Application Infrastructures\n\nVery large user bases, and web services that benefit societal needs \nHealth Care\nConsumer Apps\nOnline Retail\nAdvanced \nManufacturing\nCloud Computing \nAnd Networking\nGaming\n6\nModern Day System Security\n\n6\n7\nVirus Past and Modern\n\n7\nhttps://www.safetydetectives.com/blog/most-dangerous-new-malware-and-security-threats/\nhttp://www.ted.com/talks/mikko_hypponen_fighting_viruses_defending_the_net#t-1021940\nModern Viruses\n8\n8\nhttps://www.safetydetectives.com/blog/most-dangerous-new-malware-and-security-threats/\nModern Viruses\n9\n9\n10\nHacking Humor\u000bHackers find a way!\n\nMinimum human supervision\n11\nEveryone is being cyber-attacked!\nYou have been attacked, You are going to be attacked soon…\n12\nSony Hack Story, 2014\nhttps://en.wikipedia.org/wiki/Sony_Pictures_hack \nhttps://deadline.com/2017/04/as-north-korea-rumbles-insiders-tell-how-small-players-stood-tall-helping-sonys-the-interview-1202069868/ \n13\nHow does a serious intrusion today look like?\nIt’s a surprise!\n(affects critical infrastructure)\n\nIt is disruptive!!\n(All systems are taken down)\n\nIt has dire consequences!!!\n(Gas prices climb)\nWhy Cyber-attacks are launched by hackers?\nEntertainment\nDisruptive mentality to write virus/worms/trojans\nSocial acceptance\nWebsite defacement, “Hacker’s God”\nFraud\nHacking for SSN, Credit Card #s and other sensitive information\nEarning ransoms\nThreats to sabotage services using DDoS attacks\nCyber wars are the next threat to national security! \n– Published in 2010\n14\nhttps://www.ted.com/talks/james_lyne_everyday_cybercrime_and_what_you_can_do_about_it#t-931371\nCyber Attack Sources\nMotivated hackers are highly organized and dangerous\n\n\n\n\n\n\n\n15\n\nThey have significant resources available \nPossess access to a large underground economy\nInvolving the sale of attack kits, access to compromised hosts, and to stolen information\n\nTypes of Cyber Attacks\n16\nGartner® Hype Cycle™ for Workload and Network Security, 2023\nGrowth of Cybersecurity Industry\n18\nCyber Security Career Opportunities\nCybersecurity is a major hiring thrust in industry, government\nForbes: The global cyber security market size was estimated at USD 202.72 billion in 2022 and is projected to grow at a compound annual growth rate (CAGR) of 12.3% from 2023 to 2030.\nSecretary of Commerce Wilbur Ross stated in 2018, “A skilled cybersecurity workforce is necessary for our nation so that we can fully reap the benefits of the 21st-century digital economy.”\nNumber of jobs for fresh graduates is expected to grow over the next 8-10 years, with a predicted employment trend of 10.24%, an average rate of growth (total labor market 5.78%)\nThe average salary in the nation for fresh graduates is $103,774\nCybersecurity spans research and economy \nAttractive component of curriculum for students planning to “graduate and work in industry” or “go on to PhD” \n19\nSkills in Greatest Demand\u000b(Employer job posting results)\n20\nAccording to CyberSeek (https://www.cyberseek.org/), there were an estimated 504,316 active openings for cybersecurity jobs in the US as of April 26, 2020\nSample Cybersecurity Engineer Job Description\nJob Title:      Cybersecurity Engineer\n\nCybersecurity engineers are the gatekeepers of information within an organization, responsible for the protection and security of the systems that store this data\nThey are in charge of the network and systems in a security capacity; they execute and plan security measures accordingly\nCybersecurity engineers help to keep attackers at bay by implementing safeguards that prevent intrusions and breaches\nCybersecurity engineers don’t work in isolation, though, and they are widely seen as being an extension of the IT department\n\n\n21\nhttps://resources.infosecinstitute.com/category/cybersecurity-careers/how-to-become-a-cybersecurity-engineer/cybersecurity-engineer-job-description/#gref\nCourse Summary\n\nThis is a COIL Program Course!\nCollaborative Online International Learning (COIL) Program with Lucerne University of Applied Sciences and Arts (HSLU), Switzerland on the Data Science Basics Course, given by Dr. Luca Mazzola (luca.mazzola@hslu.ch) \nWhat is COIL? https://www.youtube.com/watch?v=ix8CoP9pzQI\nOne (or Two) Project Group will join in this COIL program. You will have meetings with HSLU students and do the following objectives:\nShared Datasets: Collaborate on creating datasets that encompass cybersecurity challenges prevalent in different regions. This can facilitate joint analysis and understanding of diverse threat landscapes.\nJoint Analysis and Modeling: Encourage joint analysis of datasets focusing on international cybersecurity incidents. Merge skills from both classes to model and predict global cybersecurity trends or threats.\nEthical Considerations: Discuss the ethical implications of data science techniques in the context of global cybersecurity and data privacy laws in different countries.\n\nSo, this course in short is…\nA fun course on Computer Security covering: application and network security foundations, advanced concept labs, in-class discussion of state-of-the-art research, and a half-semester-length project implementation/report/talk!!! \n24\n"
}